const TempDB =[
   
   {
      "info":{
         "userId":0,
         "name":"서연수",
         "tel":"010-3335-6876",
         "email":"pzxcvasd@ewhain.net",
         "major":"화학나노과학과",
         "studentNum":"2103061",
         "isCore":0
      },
      "firstInput":"프로젝트를 진행하면서 세미나를 통해 많은 사람들의 프로젝트에 대해 설명을 들으며 내가 진행하는 프로젝트에서도 도움이 될 수 있는 지식을 얻고, 스피치에서 여러 피드백을 주고받으며 프로젝트의 완성도를 높이고 싶다. 스피치를 통해서 개발실력 뿐만 아니라 스피치 자료도 준비하다 보면 발표실력도 늘 수 있을 것 같고, 많은 의견공유를 통해 견문을 높일 수 있을 것 같아서 지원했다. 또한 멤버들간의 스터디도 운영된다고 하는데, 국내에서는 생소한 Graphic Tech에 관심이 있는 멤버들과 함께 스터디를 진행하며 서로 도움을 주고받으면서 Graphic Tech 실력을 높이고 싶어서 지원했다. 무엇보다도 내가 개발을 꾸준히 한다기 보다 빠르게 끝내버리고 오랫동안 안하면서 다 까먹는 습관이 있는데, GDSC 커뮤니티 활동을 통해 조금 느리더라도 천천히 꼼꼼하게 배우고 꾸준히 개발을 하는 습관을 키우고 싶어서 지원했다.",
      "secondInput":"어떤 일이든 혼자 하다보면 지칠 때도 있고, 내가 어디까지 왔는지 뭘 더 해야하는지 확신이 안설때가 있다. 그럴 때 커뮤니티를 보면 어떤 사람은 나보다 더 많은 것을 이뤄냈는데 더 고민하고, 어떤 사람은 내가 생각치도 못했던 부분을 고민하고 있다. 이런 사람들을 보면 지쳐서 뭘 해야할지 모르겠어도 뭔가 해보려고 시도하곤한다. 시도해서 쉽게 되는 건 없지만 시도를 하지 않으면 아무것도 안된다. 이런 점에서 나는 시도한다는 것 자체가 굉장히 중요하다고 생각하는데, 커뮤니티는 이런 시도를 시작하게 한다. 커뮤니티에서 주는 정보와 각종 의견들을, 사람들은 의욕이 없다면 찾아보지도 않고 공유하려 하지도 않을 것이다. 하지만 각종 커뮤니티에서 많은 의견들이 공유된다는 것은 누군가 타인의 글로 인해 자극을 받고 도전하고,해보고자 하는 심리로 인해 다시 의견을 내고, 이것이 순환되면서 커뮤니티가 돌아간다고 생각한다. 그렇기 때문에 나는 커뮤니티의 가장 첫 본질이 자극과 의욕부여라고 생각한다.",
      "thirdInput":"중학생 때 아이언맨 헬멧을 만들어 그 헬멧 안에 아두이노 프로그램을 심은 적이 있다. 유튜브에서 어떤 외국 마블 팬 분이 아이언맨 슈트를 만든 영상을 보고 나도 막연하게 시작해본 프로젝트 였는데, 처음에는 가벼운 마음으로 시작했다가 헬멧이 틀을 갖춰가는 모습을 보면서 더 열심히 해야겠다는 욕심이 생겼던 것 같다. 헬멧의 틀은 EVA폼을 이용해 제작하였고, 처음에는 얇은 폼으로 제작했지만 튼튼하지 않아 더 두꺼운 폼을 통해 제작하였다. 개발적 요소는, 나만의 아이언맨 헬멧을 만들겠다는 생각이 있었기 때문에 기존의 아이언맨 헬멧처럼 단순히 열리고 닫히는 것 뿐만 아니라 아두이노의 자석센서를 활용해 적(Enemy)의 팔을 인식해 헬멧 옆의 미사일이 나오게끔 코딩을 하였다. 이때 프로그램을 잘 작성했음에도 디자인적 요소를 잘못 고려해 헬멧의 미사일 부분이 보이지 않아 애를 먹었는데, 이 부분을 다시 수정하면서 개발프로젝트에서도 아트적인 면이 상당히 중요하다는 것을 깨달았다.",
      "fourthInput":"친구랑 만나면 오늘 뭐하고놀지, 뭐먹을지, 뭐할지 만나서 고민하다가 시간 보내지 않게끔 출발지점과 헤어지는 지점을 정하면 그 범위 내에서 놀거리, 맛집 등을 찾아내서 코스를 추천해주는 웹사이트나 앱을 만들어보고 싶다. 놀거리나 맛집의 리뷰는 타 사이트를 종합해서 보여주면 사용자가 코스를 정할 때 도움을 줄 수 있을 것 같다. 혹시나 이 프로젝트가 조금 더 크게 성장한다면 수익적인 면에서는 길거리에 있는 공유자전거나 전동킥보드 회사와 결연을 맺어 내 프로젝트 내에서 가장 가까운 킥보드나 자전거를 보여주며 이동수단을 추천해서 어느정도 시간이 단축되는지도 보여주면 좋을 것 같다. 내가 합격해서 이 프로젝트를 제작한다면 나는 프론트엔드와 UXUI를 맡을 수 있는데 지도를 불러올 때 쓰이는 API에 대해 더 공부를 한 뒤에 제작할 예정이다. ",
      "stacks":"Computer Graphics Technology (관심만) / Hacking (Forensic, Web-hacking, Misc) / Python, C, Html, CSS, Java",
      "paths":"이화이언",
      "portfolio":"https://velog.io/@pzxcvasd (해킹 write-up)"
   },
   {
      "info":{
         "userId":0,
         "name":"오서영",
         "tel":"010-6275-5465",
         "email":"ohseoyoung5@gmail.com",
         "major":"사이버보안전공",
         "studentNum":"2171070",
         "isCore":0
      },
      "firstInput":"GDSC 커뮤니티 활동을 통해 프로젝트에 대한 경험을 쌓고 싶고, 여러 사람과 함께 성장하고 싶고, 스터디와 행사에 참여해 좋은 자극을 받고 싶습니다. 우선 프로젝트에 대한 경험을 쌓고 싶습니다. 그중에서도 개인 프로젝트는 개인적으로 진행한 바가 있지만, 팀 프로젝트는 아직 경험이 없습니다. 그래서 팀 프로젝트를 GDSC를 통해 경험해보고 싶습니다. 다음으로는 개발에 뜻이 있는 사람들과 함께 성장하고 싶습니다. 저는 혼자서 개인 프로젝트로 웹페이지를 제작해본 적이 있습니다. 물론 좋은 경험이었지만, 다른 사람들과 결과를 공유하고 다양한 생각을 들어보고 싶다는 생각을 항상 마음 한 켠에 가지고 있었습니다. GDSC가 이러한 저에게 딱 맞을 것 같다고 생각이 듭니다. 또한 GDSC에서 주최하는 다양한 행사와 스터디로 좋은 자극을 받고 싶습니다. 이미 현업에서 일하고 계신 분들이나 개발자를 꿈꾸는 사람들을 만나면 제 향후 진로를 구체화하는 데 분명 도움이 될 거라 장담합니다.",
      "secondInput":"저는 커뮤니티란 사람들과 함께 발전할 수 있는 원동력이고, 개인적인 장점은 극대화해주는 한편 단점은 보완해줄 뿐더러, 좋은 사람들을 만날 수 있는 기회라고 생각합니다. 먼저 커뮤니티를 통해 사람들과 함께 발전할 수 있는 동기부여를 받을 수 있습니다. 스터디를 진행하고 행사를 주최 및 참여하는 과정에서 꾸준히 개발에 관한 공부를 할 수 있는 자극이 될 수 있습니다. 또 함께 스터디하고 프로젝트를 하는 동료들에게 짐이 되지 않고자 더욱 책임감을 가지고 공부에 임할 수 있습니다. 다음으로 장점은 극대화해주고 단점은 보완해줄 수 있습니다. 왜냐하면 개인이 잘못 생각하고 있던 부분에 대해 사람들과 소통하며 깨달을 수 있기 때문입니다. 마지막으로 좋은 사람들을 만날 수 있는 기회를 제공해줍니다. 열심히 살고, 또 자기 분야에서 입지를 쌓기 위해 부단히 노력하는 사람들을 만나 그들을 본받을 수 있습니다. 결국 커뮤니티는 제 스스로를 성장시키는 좋은 계기를 마련해준다고 생각합니다.",
      "thirdInput":"제가 가장 열심히 참여했던 프로젝트는 1학년 겨울방학 때 NFT를 제작하고 팔기 위해 진행했던 개인 프로젝트입니다. NFT는 대체불가능한토큰으로, 이것을 제작해 팔고 싶었던 이유는 돈을 벌고 싶었기 때문입니다. 그래서 NFT란 무엇이며 어떻게 작동하는지, 잘 팔리는 NFT의 종류는 무엇이 있고 어떻게 하면 경쟁력 있는 NFT를 만들 수 있을지 고민했습니다. 그 고민의 결과, 내 NFT를 소개하는 웹페이지를 하나 만들어야 하고, SNS로 활발히 홍보해야 한다고 생각하게 되었습니다. 그래서 HTML, CSS, 자바스크립트, 일러스트레이터를 독학을 통해 배웠습니다. 그 결과 저의 NFT를 소개하는 웹페이지를 하나 제작할 수 있었습니다. 또한 홍보의 수단인 SNS에 친숙해지기 위해 평소 안 하던 인스타그램도 깔고 사용해보았습니다. 비록 결과적으로는 올해 여름방학에 NFT를 파는 것으로 계획이 미루어졌지만, NFT와 블록체인에 대해 많이 이해하게 되었고 관심도 가지게 되었습니다.",
      "fourthInput":"GDSC Member로 함께 하게 된다면 팀 프로젝트 진행, 앱 개발, 웹페이지 개발, 관심 분야의 스터디, 소모임과 행사 참여를 하고 싶습니다. 우선 팀 프로젝트를 해보고 싶습니다. 왜냐하면 저는 개인 프로젝트 경험만 있어서, 팀 프로젝트를 통해 다른 사람들과 소통하는 방식을 익히고 경험해보고 싶기 때문입니다. 또한 앱 개발을 시도해보고 싶습니다. 플러터 등을 배우는 스터디를 통해 앱 개발을 배우고 싶습니다. 제가 만들고 싶은 앱은 사람들의 mbti를 알 수 있는 앱입니다. 뿐만 아니라 프런트엔드와 관련된 스터디를 하며 동적인 웹페이지를 만들고 싶습니다. 리액트, 앵귤러, 뷰, 노드, 깃헙 등에 대해 스터디를 진행하며, 수준 높은 웹페이지를 개인 프로젝트로 만들어보고 싶습니다. 그리고 소모임을 통해 좋은 친구들을 사귀고 싶습니다. GDSC 인스타그램을 보니, 자전거 소모임도 진행되고 있는 것을 확인했습니다. 저도 이러한 소모임으로 좋은 사람들을 만나 취미를 즐기고 싶습니다.",
      "stacks":"Frontend, Backend, mobile",
      "paths":"에브리타임",
      "portfolio":""
   },
   {
      "info":{
         "userId":0,
         "name":"염다민",
         "tel":"01051395636",
         "email":"damin321@ewhain.net",
         "major":"전자전기공학부",
         "studentNum":"1972028",
         "isCore":0
      },
      "firstInput":"저학년 시절 인공지능과 관련한 교양수업을 통해 인공지능과 머신러닝의 전반적인 흐름을 익힐 수 있었습니다. 이전부터 각종 매체에서 전하는 인공지능의 발전 및 자율 주행의 성장, 가족들의 편리성을 극대화해주는 IoT 등에 의해 AI와 ML 분야는 자연스럽게 저의 삶 속에 녹아들어 있었습니다. 프로그래밍을 좋아하는 저는 그 중에서도 딥러닝, 컴퓨터 비전, 이미지 프로세싱에 큰 관심을 가졌고 최근에서야 이러한 기술을 실제 지능로봇에 옮기는 과정을 꿈꾸게 되었습니다.\n \n이를 위해 관련 분야 강좌를 듣거나 논문을 참고했고 코드를 직접 짜보며 원리를 익혀 나갔습니다. 그러던 중 새롭게 얻은 지식을 개인 학습으로만 소비하지 않고 좀 더 생산적인 일에 사용하고 싶다 생각했고, 서로의 관심 분야나 개발 과정을 공유하고 의견을 나눌 수 있는 기회를 가지고 싶었습니다. GDSC를 통해 서로의 성장을 함께해 나가고 싶고 저 또한 더 책임감 있는 모습으로 저의 꿈에 한 발짝 더 다가가고 싶습니다.",
      "secondInput":"커뮤니티의 사전적 의미는 ‘자연에 의하여 자연 발생적으로 이루어진 공동 사회’입니다.\n하지만 저에게 있어서 커뮤니티란 ‘common’이라는 어원에 따라 서로 공통된 관심사를 가지고 같은 목표를 향해 나아가는 단체 혹은 사회를 지칭한다고 생각합니다. 물론 다양한 정의가 존재하겠지만 가장 중요한 핵심은 단순히 물리적인 인접이 아닌 심적으로까지 서로 영향을 주고받는 의미가 포함되어있어야 한다고 생각합니다. \n\n커뮤니티에 속하여 자신의 의견을 제시하고 다른 이의 의견을 수용하는 등의 상호작용을 통해 스스로 더 성장할 수 있는 기회가 되고, 비슷한 관심사를 가진 이들끼리 소통을 통해 앞으로의 목표나 꿈을 더 구체화할 수 있다 생각합니다. 커뮤니티의 최대 장점은 오직 나 자체로서의 존재감을 느낄 수 있다는 것이고, 이러한 소속감을 통해 공통된 관심을 가지는 사람들과 함께 공감하고 서로 응원할 수 있을 것이라 생각합니다. ",
      "thirdInput":"지난 학기, ICT 공모전에 참가하여 라즈베리 파이를 이용한 스마트 도어벨 프로젝트를 진행하였습니다. 해당 도어벨은 openCV를 활용하여 사람의 얼굴 및 몸 인식을 통해 외부인을 파악하고 수상한 움직임을 잡아내 사용자에게 위험 알림 서비스를 제공했습니다.  \nOpenCV 모듈 + python을 활용해 외부인의 얼굴 인식 및 학습을 담당했고 학습 데이터셋의 증가와 변형을 통해 클래스의 정확도를 향상시키려 노력하였습니다. \n프로젝트 시작 당시 기기의 동작원리나 웹 자동화 기술과 관련하여 지식이 부족했었고 이를 극복하고자 외부 강의나 관련 자료, 스터디 등을 적극 활용하여 실력을 점차 키워나갈 수 있었습니다. 새롭게 배운 것을 실제 모델에 적용하고 응용하면서 더 다양한 기능을 추가 및 보완할 수 있었고, 덕분에 사용자의 편리성과 접근성을 충분히 고려하여 공모전에서도 좋은 결과를 얻어낼 수 있었습니다.",
      "fourthInput":"첫 번째로 부원들과 팀 프로젝트를 진행해보고 싶습니다. 단순히 ML에만 국한되지 않고 데이터 분석, 웹 개발 등 다양한 분야의 팀원과 함께 여러 의견을 모으고 이를 융합할 수 있는 프로젝트를 진행하여 함께 공모전에도 나가보는 것이 저의 목표입니다. 서로 다른 분야가 융합되어 더 좋은 시너지 효과를 낼 수 있다고 생각합니다. \n두 번째로는 딥러닝을 활용한 이미지 처리 프로젝트를 진행해보는 것입니다. idec, coursera 등 외부강의를 참고하여 컴퓨터 비전, ML에 관한 지식을 더 쌓은 후 구글 코랩을 활용하여 real-time에서 빠르고 정확하게 객체를 인식하고 클래스를 분류하는 다양한 기법들을 구현해내고 싶습니다. \n마지막으로 서로의 관심 분야에 대한 논문을 읽고 발표하는 스터디를 진행하고 싶습니다. 자신의 분야에 관한 논문을 읽고 이를 발표해보는 시간을 통해 분야의 이해도를 더 높일 수 있고 다른 분야의 새로운 지식을 얻을 수 있는 좋은 기회가 될 것이라 생각합니다. ",
      "stacks":"ML(DL, computer vision), 프로그래밍 언어(C, C++, Python)",
      "paths":"에브리타임 게시판",
      "portfolio":"https://github.com/Gitdamin"
   },
   {
      "info":{
         "userId":0,
         "name":"최지원",
         "tel":"01050152960",
         "email":"jiwonchoi99@ewhain.net",
         "major":"컴퓨터공학전공",
         "studentNum":"1876425",
         "isCore":0
      },
      "firstInput":"이화의 개발자들과 소통하고 싶어서 지원하게 되었습니다. 학교에 다니면서 선후배들과 개발에 관한 이야기를 많이 나누지 못한 것이 항상 아쉬웠습니다. 하지만 GDSC Ewha와 함께라면 신기술이나 업계 동향에 대해 다양한 의견을 나눌 수 있으리라고 생각합니다. 개발이라는 공통된 관심사를 주제로 대화하면서 배우는 점도 많을 것입니다. 이러한 과정에서 이화의 개발자들과 친분을 쌓는 것도 기대하고 있습니다.\n \n또한 개발 역량을 키우기 위해 GDSC Ewha에서 스터디를 조직하고 싶습니다. 지난 겨울 방학, 혼자 코틀린과 알고리즘을 공부했습니다. 하지만 태만해지는 순간이 오기도 하고, 배운 내용에 대해 다른 누군가와 토론하고 싶어지기도 했습니다. 이러한 한계를 극복하기 위해 22년 상반기에는 스터디에 참여해야겠다고 생각했습니다. 마침 GDSC 는 스터디를 위한 지원이 풍부한 그룹입니다. 이번 기회에 GDSC에 지원해, 이화의 개발자들과 함께 효율적이고 즐겁게 공부하고 싶습니다.",
      "secondInput":"어떠한 관심사를 주제로 뭉친 사람들의 모임을 커뮤니티라고 여기고 있습니다.  커뮤니티는 정보 공유의 장이 되기 좋습니다. 개발 커뮤니티에 적극적으로 참여하면 보다 폭넓은 개발 지식을 얻을 수 있으리라고 생각합니다. 스택 오버플로우 같은 익명의 대형 온라인 커뮤니티도 좋습니다. 하지만 성장을 위해서는 GDSC Ewha같은 실명제 모임이 더 좋다고 생각합니다.\n\n커뮤니티의 또 다른 특징은 서로 도우려고 한다는 점입니다. 소속감은 커뮤니티 구성원을 돕는 원동력이 됩니다. 저는 ‘이화여자대학교’ 도 하나의 커뮤니티라고 생각합니다. 저에게 도움을 주신 이화의 선배님들이 많습니다. 저 또한 하루 빨리 성장해 후배들을 이끌어 줄 수 있는 그릇이 되고 싶습니다.",
      "thirdInput":"졸업 프로젝트로 기획, 개발한 [딥러닝을 활용한 다육 식물 홈 가드닝 가이드 어플, Leafy]에 가장 열심히 참여하였습니다.\n\n다육 식물은 접근성이 좋은 반면, 의외로 초심자가 키우기 어려운 식물입니다. Leafy 어플에서는 이러한 초심자를 돕기 위해 식물 상태 진단, 정보성 챗봇, 물주기 보조 서비스를 제공합니다. 사용자는 사진을 찍음으로써 간편하게 다육 식물의 질병 여부를 판단할 수 있고, 궁금한 점이 생기면 ai 챗봇에게 조언을 구할 수 있습니다. 안드로이드 스튜디오, 아두이노 스케치, 케라스, 파이어베이스 등을 사용하여 개발하였습니다.\n \n생소하고 어려운 부분이 많았지만, 팀원들과 함께 열정적으로 프로젝트에 임해  성공적으로 졸업프로젝트를 마무리할 수 있었습니다. 개발자로서 크게 성장하는 계기가 되기도 했고, 교내 대회 수상이라는 눈에 보이는 성과를 얻기도 해서 제게 의미가 깊은 프로젝트입니다.",
      "fourthInput":"GDSC Ewha의 멤버들과 함께하면서 새롭게 알게 되는 기술이 많으리라고 생각합니다. 이렇게 배운 것들을 개인 프로젝트에 적용해 제 것으로 흡수하고 싶습니다. 특히 완성도 높은 모바일 어플을 개발하고 싶다는 욕심이 있습니다. 현재는 개인 프로젝트로 계획하고 있지만, 저와 뜻이 맞는 멤버분이 있다면 팀 프로젝트로 진행해도 좋을 것 같습니다.\n\n스터디에도 꼭 참여하고 싶습니다. 만약 원하는 분야의 스터디가 열리지 않으면, 직접 인원을 모아 주도적으로 스터디를 조직할 생각입니다. 현재 코틀린, 면접 대비 cs 지식, 알고리즘, 리액트 네이티브에 관심이 있습니다.  이중 정확히 어떤 분야를 골라 스터디를 진행할지는 아직 정하지 않았으나, 적어도 2개 이상의 스터디를 진행하고 싶습니다. 막학기를 앞두고 있어 학점을 적게 듣는 반면, 취업 준비를 본격적으로 할 생각은 없어서 충분히 감당할 수 있다고 생각합니다.",
      "stacks":"안드로이드, Java, Kotlin",
      "paths":"지인 소개",
      "portfolio":"https://drive.google.com/file/d/10JDdE7eiS-GPrT27fXn5OcxNxT8aZ28M/view?usp=sharing"
   },
   {
      "info":{
         "userId":0,
         "name":"오지은",
         "tel":"01068779509",
         "email":"0909oje@naver.com",
         "major":"컴퓨터공학전공",
         "studentNum":"1971027",
         "isCore":0
      },
      "firstInput":" 저와 진로가 비슷한 개발자들을 만나 지식 공유를 하며 함께 발전해 나가고 싶습니다. 그런 점에서 GDSC 활동 중에 본인의 지식을 세미나에서 공유하고 다른 사람의 세미나를 들을 수 있다는 것이 좋았던 것 같습니다. 세미나를 준비하는 과정에서 해당 지식의 이해도 또한 높아질 것이고 다른 사람의 세미나를 들으면서 새로운 지식을 접할 수 있을 것이라고 생각됩니다. \n 또한 저는 소규모로라도 스터디를 하는 것을 좋아해서 현재도 리액트 스터디, 1일 1커밋 스터디를 진행 중인데 새로운 기술 도서를 읽으려고 생각 중이라 GDSC에서 새로운 스터디를 진행하면 좋을 것 같다고 생각했습니다.\n 마지막으로 백엔드 개발자 한 분과 같이 웹 개발 프로젝트를 진행하면서 온전히 저의 힘으로 웹 개발 프론트를 개발하는 경험을 하고 싶습니다. 이전 프로젝트 중에서 웹 프론트를 저 혼자 개발한 경험은 없었기 때문에 GDSC와 함께 성취하고 싶은 목표라고 생각했습니다.\n",
      "secondInput":"관심사가 비슷한 사람들이 비슷한 목표를 가지고 모인 조직이라고 생각합니다. 대부분의 커뮤니티는 스스로 가입을 해야하는 경우가 많은데 제가 가입한 커뮤니티만 생각해봐도 알고리즘 실력을 늘리기 위해 가입한 알고리즘 동아리, 학과 내 정보를 얻기 위해 가입한 소프트웨어학부 카페 등 제가 관심을 가지고 가입한 커뮤니티이기 때문입니다. 그런 면에서 GDSC는 개발에 관심을 가지고 스스로 성장하고 싶어서 모인 사람들의 커뮤니티라고 생각합니다.",
      "thirdInput":" 현재 진행 중인 졸업 프로젝트에 열심히 참여 중입니다. 이전에는 웹 개발 프로젝트만 했었고 항상 프론트를 같이 개발하는 팀원이 있었는데 이번에 진행 중인 졸업 프로젝트에서는 react-native를 이용해 앱의 프론트를 저 혼자 개발하게 되어 그 책임과 참여도가 높아진 것 같습니다. \n 또한 react-native는 라이브러리를 필요할 때마다 설치해서 사용해야 하는데, 다른 사용자가 만들어둔 라이브러리를 쓰면 알려지지 않은 오류가 발생해 해결하는 데에 시간을 많이 썼던 것 같습니다. 또한 팀 내 분업이 철저하고 다른 팀원의 에러를 해결해 줄 수 없는 경우가 대부분이어서 저 혼자 에러를 해결해야하는 것이 힘들었던 것 같습니다.\n 이 과정에서 누군가의 힘을 빌리지 않고 온전히 저 혼자 구글링을 해서 에러를 해결하는 능력, 프론트에 대한 지식이 없는 팀원에게 제가 한 개발을 이해시키는 능력을 기르게 되었습니다.\n",
      "fourthInput":" 먼저 ‘모던 자바스크립트 Deep Dive’와 ‘클린코드’룰 읽고 기술 블로그에 작성하는 스터디를 진행하고 싶습니다. 자바스크립트는 프론트, 백 개발자 상관없이 중요한 언어인데 깊이가 깊어 제대로 공부할 필요가 있는 언어이기 때문에 자바스크립트 책 중에서 가장 깊이가 깊다고 알려진 딥다이브를 읽으면 한번 더 성장할 수 있을 것 같습니다. 그 다음으로 클린코드는 선배님께서 학부생 때 읽었으면 좋을 책으로 추천해주신 책인데 꼭 완주를 하고 싶은 책이라 함께 읽고 싶습니다.\n 다음으로 세미나에서 redux에 관한 지식 공유를 진행하고 싶습니다. redux는 상태 관리 라이브러리인데 작년에 처음 접한 후로 항상 제대로 이해하리라 마음 먹지만 아직도 그 이해도가 깊지 않아 redux 관련 세미나를 진행하면서 스스로 더 공부해보고 사용하면서 힘들었던 경험, 어떻게 사용하면 좋을지 등 지식을 공유하면서 redux를 제대로 이해하고 싶습니다.\n",
      "stacks":"Front-end(React)",
      "paths":"에브리타임",
      "portfolio":"https://velog.io/@0909oje, https://github.com/0909oje"
   },
   {
      "info":{
         "userId":0,
         "name":"박은성",
         "tel":"010-2585-8474",
         "email":"eunseong0607@ewhain.net",
         "major":"컴퓨터공학과",
         "studentNum":"2076161",
         "isCore":0
      },
      "firstInput":"자유롭고 활동적으로 질의응답이 오고 가는 GDSC에서 제가 참여한다면, 저는 다양한 분야에 관심이 많은 분들과 같이 지식을 공유하는 기회를 갖고 싶습니다. 또한, GDSC에서 직접 기획부터 개발까지의 과정을 경험하며 저만의 프로젝트를 시작하고, 이를 멤버 분들과 나누어 보는 모임에 참여하면서 저와 비슷하게 개발에 열정을 가진 분들과 함께하는 경험을 쌓고 싶습니다.",
      "secondInput":"커뮤니티는 친구들과 만나는 일반적인 만남과 다르게 몇 가지 특징을 갖고 있다고 생각합니다. 가장 중요한 점은 다양성에 대한 존중입니다. 나이가 다르고 사는 지역도 아주 다른 사람들이 만나는 장이기 때문에 아주 기본적인 약속과 예의가 필요하다고 생각합니다. 또, 성실함에 대한 약속이 필요합니다. 진심으로 하려는 의지를 다른 멤버들과 지켜나가기 위해서는 프로젝트 마감 기한, 프로젝트 발표, 스터디 참여 등 일정들에 최대한 성심성의를 다해 참여해야 한다고 생각합니다.",
      "thirdInput":"동기 세 명과 함께 리액트 네이티브를 활용해 무료 투두리스트 애플리케이션을 개발한 경험입니다. 한 학기 동안 처음 만난 동기들과 함께 배우면서 개발하다 보니 계획한 것 이상으로 시간이 들었지만 그만큼 배운 점이 많은 기회가 되었습니다. 데이터 베이스, 즉 백엔드 분야까지 개발을 하고 싶다는 열의가 생겨 개인적으로 백엔드 개발에 대한 책을 찾아 보고 이를 동기들과 토의하며 조정해 나가는 과정이 무척 즐거운 경험으로 기억이 납니다. 이후 이를 깃허브에 올려 저장했는데, 깃에 초록색으로 표시된 오늘의 활동 기록이 무척 뿌듯했습니다.",
      "fourthInput":"GDSC는 멤버들의 자율적이고 적극적인 참여를 독려한다고 생각합니다. 저는 개인 프로젝트를 진행하는 활동에 기대를 갖고 있으며, 구글 익스텐션(Extension)을 수정해서 배포하는 활동을 GDSC멤버로서 해보고 싶습니다. 그리고 정기 모임에 성실히 참여하며 멤버들과의 활발한 교류를 통해 관심이 가는 기술 스택 분야에 스터디를 참여하고 싶습니다. 함께 공부를 하며 질문을 주고 받는 장이 만들어진다면, 더 재미있고 효율적으로 관심 분야에 대한 배경 지식을 쌓을 수 있을 것이라 생각합니다.",
      "stacks":"CUDA, tensorflow",
      "paths":"지인 소개",
      "portfolio":"https://github.com/hi-rama"
   },
   {
      "info":{
         "userId":0,
         "name":"박현정",
         "tel":"01093874622",
         "email":"py0429@ewhain.net",
         "major":"사이버보안",
         "studentNum":"1971102",
         "isCore":0
      },
      "firstInput":"저는 ESFJ 엠비티아이 유형으로 새로운 사람들과의 만남을 통해 원동력을 얻습니다. 안드로이드 아카이빙 앱 서비스와 웹 프로젝트를 협업하며 네트워킹의 중요성과 그러한 소통을 통해 저 자신이 활력을 받고 있음을 느꼈고, 더 많은 사람들을 만날 수 있는 환경에서 큰 성장을 이루고자 GDSC에 지원하게 되었습니다. 소통하는 것을 좋아하는 성격으로 인해 개발 동아리에서 운영진으로 활동한 경험이 있는데, 커뮤니티와 프로젝트를 원활하게 진행하고자 팀원들이 참여할 수 있도록 아이디어를 내며 적극적으로 활동하였고 멤버들은 가장 열심히 임한 멤버와 도움을 준 멤버 중에 저를 뽑아주었고 다른사람들에게 힘이 됐다는 생각에 자신감을 얻었습니다. 이러한 경험을 토대로 GDSC에서 6개월간 함께 소통하고 실력 성장까지 얻어가기 위해 열정을 바칠 것입니다. 멤버들간 소통을 유도하고 프로젝트 경험을 진행하며 개발 능력과 스피킹 능력은 물론이고 다른 사람들과의 소통을 통해 행복해하는 저 자신을 찾아가고 싶습니다.",
      "secondInput":"커뮤니티란 혼자가 아닌 다른 사람들과의 경험을 공유하며 나 스스로를 발전시키는 과정입니다. 저는 혼자 프로젝트를 만들어 나가고 스터디를 하는 것보다, 여러팀원들과 공부했을 때 더 큰 발전을 이룬다고 생각합니다. 팀원들의 공부 방식, 개발 지식 모두 다르기 때문에, 그 사람들의 개발 지식을 배우고 스스로 해결 하기엔 막막했던 과정들을 함께 해결해나가면서 커뮤니티의 이점들을 얻을 수 있었습니다. 그리고 혼자 해결했을 때는 함께 기뻐해줄 팀원이 없지만, 협업에서는 함께 응원해주고 칭찬 한 마디 해주는 그러한 팀원으로 자존감 상승의 기쁨 또한 느낄 수 있습니다. 처음부터 완벽한 사람은 없으므로 커뮤니티 속에서 조언을 얻어가며 성장할 수 있는 배경을 만들어주고 그렇게 성장을 이룬 후 조언자의 역할로 다른 사람들을 도울 수 있는 기회가 주어집니다. 이렇게 도움을 받으면 나중에 도움을 줄 기회가 주어지고 이러한 사이클 같은 원리가 커뮤니티에서의 핵심이라고 생각합니다.",
      "thirdInput":"선물, 편지를 아카이빙하는 안드로이드 앱 서비스를 협업하여 만들어본 경험이 있습니다. 안드로이드 코틀린으로 설정하여, fragment로 home, like, user page를 기본적인 틀로 만들었습니다. 로그인, 회원가입, 게시글 작성 및 수정, 친구추가, 선물 추가기능 그리고 리사이클러뷰를 통한 게시글 관리기능 등 앱 서비스 기능으로 구성했습니다. 깃허브를 통해 협업을 진행하였고, 처음에 협업을 통해 생기는 충돌에 겁을 먹었으나 git bash에서 충돌난 부분을 유심하게 읽어본 후 고쳐보니 쉽게 해결할 수 있었습니다. 저와 팀원들 모두 안드로이드가 미숙했지만 그만큼 책임감을 갖고 더 좋은 프로젝트를 만들기 위해 힘썼고, 처음과 마지막을 돌아봤을 때 코드의 이해도가 높아진 저의 모습을 보며 고생한 만큼 많이 배웠음을 느꼈습니다. 엄청난 오류들을 겪었지만, 많은 시간 투자와 열정만 있다면 불가능은 없다는 것을 다시 한 번 깨달았던 경험이었습니다.",
      "fourthInput":"우선 프로젝트를 진행한다면 안드로이드 스튜디오를 통한 감정 관리 앱을 만들고 배포까지 진행하고 싶습니다. 현재 자존감이 떨어져 있는 사람들이 증가하고 있는데 이를 위해 자신의 감정 관리를 위한 웹사이트를 만들고 싶습니다. 그리고 매주 프로젝트 관련 스피치를 준비하여 당차고 자신감 넘치는 발표를 할 것입니다. 작년에 Devfast에 티켓을 구매해서 참여한 경험이 있습니다. 14일간 많은 학교 학생들을 만나 행복한 경험이었고 그러한 경험은 GDSC 멤버들이 구성하는 것이라 생각하기 때문에, 멤버들의 역할이 중요하다고 생각합니다. 많은 분들이 궁금해할 노션 사용법 같은 세션을 준비하여 여러 학생들에게 도움을 줄 만한 강연을 준비하고 싶습니다. 상호작용을 위한 네트워킹 세션 및 강연 세션에 참여하여 개발 지식을 공유하여 함께 발전하는 시간을 갖고 싶습니다. 또한 이러한 네트워킹을 통해 동일한 관심분야를 갖는 사람들과의 만남으로 관련 스터디와 모각코를 개최하여 함께 공부하고 싶습니다.",
      "stacks":"Backend(java,kotlin,spring)",
      "paths":"에브리타임",
      "portfolio":"https://github.com/hyeonjeongs"
   },
   {
      "info":{
         "userId":0,
         "name":"이민경",
         "tel":"01059545476",
         "email":"minlee4321@ewhain.net ",
         "major":"컴퓨터공학",
         "studentNum":"2176251",
         "isCore":0
      },
      "firstInput":"개인적으로 개발 공부를 하고 프로젝트를 하는데에 어떻게 시작해야 할지 막연함을 느껴 GDSC커뮤니티 활동을 통해 어려움울 느끼는 부분에 대해 도움을 받고 다양한 사람들과 만나보며 새로운 것들을 경험하고 배워보고자 하여 지원하게 되었습니다. 또한 컴퓨터공학과로 진학을 하였지만 컴퓨터공학 내부의 진로선택에 있어서도 무엇을 원하는지 알지 못해 커뮤니티내에서의 직접적인 활동 경험이 본인의 진로탐색의 기회가 될 수 있을것이라는 생각이 되어 GDSC 에서 활동을 하고자 합니다.",
      "secondInput":"커뮤니티란 다양한 사람들이 모여 서로 소통하며 도와주어 각자의 목적을 향해 나아갈 수 있도록 도와주는 모임이라고 생각합니다. 커뮤니티원들은 서로의 목적이 완전히 동일하지 않더라도 서로서로 도와주며 커뮤니티 전체가 득이 될 수 있도록 서로 공생하는 관계와 같다고 생각합니다.",
      "thirdInput":"아직 프로젝트 경험이 없으나 gdsc ewha에서 활동하면서 프로젝트 경험을 쌓고자 합니다.",
      "fourthInput":"GDSC모임과 네트워킹에 참여하여 개발 분야 내에서 흥미가 가는 분야를 찾아내고 해당 분야에서의 개발 실력을 향상시키고자 합니다. 또한 커뮤니티 내 프로젝트에 참여를 하며 개발 프로젝트의 시작부터 끝까지의 과정을 배우고 프로젝트 경험을 쌓아 개인 프로젝트도 만들어보고 싶습니다.",
      "stacks":"",
      "paths":"에브리타임 홍보",
      "portfolio":""
   },
   {
      "info":{
         "userId":0,
         "name":"조민서",
         "tel":"010-2007-6620",
         "email":"min1130@ewhain.net",
         "major":"컴퓨터공학전공",
         "studentNum":"2071047",
         "isCore":0
      },
      "firstInput":"저는 GDSC 커뮤니티 활동을 통해 도전하고 성장하고 싶습니다. 저는 그동안 저보다 뛰어난 실력을 가진 개발자들을 보며 저도 모르게 주눅이 들었습니다. 그러나 더 이상 주눅들지 않고 훌륭한 개발자들을 보며 저 역시 훌륭한 개발자가 되기 위해 도전해야겠다고 다짐하여 GDSC에 지원하게 되었습니다.\n저는 GDSC 커뮤니티 활동에서 개발에 관심을 가진 분들과 만나서 소통하고 싶습니다. 코로나로 인해 같은 컴퓨터공학을 전공하는 학우들과도 만나기 어려워서 아쉬운 점이 많았습니다. GDSC 커뮤니티에서 활동하며 저와 같은 관심사를 가진 다양한 개발자들과 네트워킹하며 저 자신의 성장을 위해 끝없이 노력하고 싶습니다. 그리고 스스로 기획부터 개발까지 개인 프로젝트를 진행하는 것은 혼자서도 할 수 있지만 세미나에서 제 프로젝트 및 핵심기술을 스피치하는 것은 GDSC에서만 할 수 있는 경험이라고 생각합니다. 스피치를 준비하는 과정에서 제 프로젝트의 핵심기술을 더 확실하게 공부하며 발전하고 싶습니다.",
      "secondInput":"저는 커뮤니티가 비슷한 사람들이 모여 있는 하나의 마을이라고 생각합니다. 커뮤니티에는 같은 관심 분야를 가지고 있는 사람들이 모여서 함께 활동합니다. 그리고 커뮤니티에서는 관심 분야에 관해서만 활동하는 것 뿐 아니라 새로운 분야에 대해 같이 스터디를 하기도 하고, 커뮤니티 사람들끼리 행사를 열기도 하기 때문에 저는 다양한 이벤트들이 일어나는 마을 같다고 느꼈습니다.\n또한, 코로나로 인해 같은 관심사를 가지고 있는 사람을 찾는 것이 쉽지 않고, 직접 만나기는 더더욱 어려운 현 상황에서 커뮤니티는 사람과 사람을 이어주는 중요한 역할은 하는 것 같습니다. 같은 관심사를 가진 사람들이 이어진다면 사람들은 서로 소통하는 과정에서 자신이 가지고 있는 지식을 나누고 다른 사람들의 지식을 습득하게 됩니다. 그리고 이러한 과정에서 커뮤니티는 지식 공유의 근원이 된다고 생각합니다. 이와 같이 공통된 관심사를 가진 사람들이 모여서 유의미한 가치 창출을 하는 곳이 바로 커뮤니티인 것 같습니다.",
      "thirdInput":"저는 제로웨이스트 실천을 돕는 앱을 기획하는 프로젝트에 참여한 적이 있습니다. 저와 팀원들은 사회에 선한 영향력을 끼치는 앱을 목표로 하며 환경 보호를 실천하는 제로웨이스트를 널리 알리고 제로웨이스트 실천을 돕는 앱을 기획하였습니다. 그리고 제로웨이스트에 대한 사람들의 인식과 인지도를 파악하기 위해 설문조사를 진행했고, 이를 바탕으로 세 가지 주요 기능을 결정했습니다. 지도에서 제로웨이스트 상점들의 위치를 보여주고, 유저들이 커뮤니티에서 게시글을 쓰거나 채팅하며 소통할 수 있도록 하고, 제로웨이스트 실천을 인증하고 포인트를 얻는 것이 주요 기능이었습니다. 프로젝트 과정에서 유저들을 끌어모을 수 있을지에 대해 갈등이 생겼지만, 제로웨이스트 상점들과 컨택하여 포인트를 상점에서 직접 사용할 수 있게 한다면 제로웨이스트 실천을 장려하고 유저들을 끌어모으는 데 도움이 될 것이라는 결론을 내렸습니다. 이후 기능을 실행하는 화면을 설계하고 프로토타입을 제작하며 프로젝트를 성공적으로 마쳤습니다.",
      "fourthInput":"저는 GDSC Ewha Member로 함께 하게 된다면 우선 개인 프로젝트로 제가 기획했던 프로젝트를 직접 개발하는 활동을 하고 싶습니다. 앞서 제로웨이스트 실천을 돕는 앱을 기획하는 프로젝트에 참여한 적이 있다고 말씀드렸는데 저는 이 프로젝트를 앱이 아닌 웹으로 다시 기획한 후 개발하고 싶습니다. 앱을 기반으로 한 프로젝트였기 때문에 웹 개발을 위해서 다시 기획을 하면 많은 부분을 수정해야 하겠지만 제가 기획한 프로젝트인 만큼 직접 실현시켜보고 싶습니다. 제가 이 프로젝트를 앱이 아닌 웹으로 개발하기로 마음먹은 이유는 최근 웹 개발에 관심을 갖고 공부하면서 웹 개발 프로젝트를 하고 싶다는 생각을 해왔기 때문입니다.\n그리고 저는 GDSC Ewha Member가 되어 다양한 스터디 활동에 적극적으로 참여할 것입니다. 개발 공부를 위한 스터디 뿐 아니라, 규칙적인 생활을 위해 기상 시간을 지키는 스터디 또는 함께 책을 읽는 스터디에 참여하여 자기 계발도 열심히 하고 싶습니다.",
      "stacks":"Front-End, Back-End, HTML, CSS, JavaScript",
      "paths":"인스타그램",
      "portfolio":"https://github.com/rovemin     https://rovemin.tistory.com/"
   },
   {
      "info":{
         "userId":0,
         "name":"정채윤",
         "tel":"010-2752-7928",
         "email":"chaeyounchung@ewhain.net",
         "major":"뇌인지과학과",
         "studentNum":"1976366",
         "isCore":0
      },
      "firstInput":"저는 뇌가 감각 정보를 수용,인지,해석해내는 방법에 대한 관심이 있습니다. 복수전공인 휴먼기계바이오공학의 수업을 들으며 이를 프로그램으로 구현해보고 싶다는 생각이 들어 인공지능과 컴퓨터비전과 같은 분야에 관심이 생겼습니다. 하지만 본전공이 아니다보니 이 분야에 대해 물어보거나 얘기할 사람이 없어 막막함을 많이 느꼈습니다. GDSC에서 사람들을 만나고 활동한다면 저에게 많은 도움과 본보기가 될 것이고, GDG의 현직 개발자분들과의 네트워킹을 통해 저의 커리어 멘토들을 만날 수 있을 것이 기대되어 지원하였습니다. 또한 제 관심분야에 대한 연구도 구글의 perception team등에서 많이 이루어지고 있어서 언젠가 구글에서 일해보고싶다고 생각했는데, 이렇게 학생으로서 참여할 수 있는 프로그램이 있어 기쁘게 지원하게 되었습니다. 마지막으로, 이번 학기에 휴학을 해서 이 기회를 활용하여 제대로 공부해보고 싶은데, GDSC에서의 활동이 방향설정과 유지에 큰 도움이 될 것 같습니다.",
      "secondInput":"1학년때부터 언어학회, 뇌인지과학과 학회 사회분과, 인지과학분과에서 학회활동을 해왔고, 학회 분과장으로도 활동하며 관심사가 같은 사람들이 모이는 것은 단순한 모임 이상의 것을 서로 주고 받는 경험이라는 것을 몸소 느꼈습니다. 학회 참여 전에는 같은 관심 분야의 사람을 만날 수가 없었기 때문에 세상에 저 혼자만 관심있는 분야인 것 같다는 생각을 했었는데, 학회에서 실제로 사람을 만나고 관련 이야기를 할 수 있어서 너무 행복했었습니다. 또한 같은 주제에 대해서도 다양한 전공, 배경을 가진 사람들의 생각의 흐름, 접근방식 등이 다른 점이 놀라웠고, 저에게도 많은 영향을 주었습니다. 이렇게 다양한 전공의 사람이 모였을 때 생기는 시너지를 경험했고, 계속해서 학문 커뮤니티에 있고싶다고 생각했습니다. 따라서 커뮤니티는 비슷한 관심사의 사람을 만나게 해주어 서로의 존재를 확인하고, 논의를 하고, 서로의 세계를 확장하며 관심사에 대한 활동을 지속할 수 있도록 임파워링을 해주는 것이라고 생각합니다.",
      "thirdInput":"작년부터 서울대 융합과학기술대학원에서 인턴을 하고 있고, 현재 1저자로 논문을 준비하고 있습니다. 처음엔 실험논문을 준비해서 주제 선정부터 실험 설계까지 완료했으나, 연구참여자 모집의 어려움으로 주제를 바꾸어서 ‘실어증 환자에 대한 디지털 언어치료’에 대한 리뷰논문을 준비하고 있습니다. 매주 연구 미팅을 준비하고, 논문을 읽고 세미나 발표도 하고, 연구의 방향성과 진행을 끊임없이 확인하고 조정하며 연구자로서의 기본 소양과 1저자로서의 책임을 배우고 있습니다. 이 과정에서 힘든 점도 있었지만 꾸준한 공부를 통해, 또 공동연구자와의 대화를 통해 극복해내어 지금은 안정된 상태로 연구를 진행하고 있습니다. 이 프로젝트를 통해 학부생의 신분으로 연구의 진행과정을 미리 겪어볼 수 있었을 뿐만 아니라 연구라는 긴 과정을 견디는 태도를 갖게 되었습니다. 앞으로 다른 길고 어려운 연구를 하게 되더라도 저항력을 갖고 끝까지 해낼 수 있을만큼의 정신과 몸을 만들어준, 의미있는 경험이라고 생각합니다.",
      "fourthInput":"아직 머신러닝/코딩 쪽 지식이 부족하기 때문에 처음 3-4개월 간은 머신러닝과 프로그래밍 언어 -  파이썬(필요에 따라 C 또는 java), 스탠포드 CS231n, 코세라 강의, open CV 등 - 를 집중적으로 공부할 것입니다. 2-3개월부터는 캐글의 공개된 코드를 따라 코딩 연습을 하며 공부를 하고, 그 후 남은 1-2개월은 그동안의 공부에서 얻은 인사이트로 프로젝트를 진행할 것입니다. 큰 주제는 컴퓨터 비전의 object identification/classification으로 생각하고 있고, 계속 공부를 하면서 필요한 스킬들을 공부해 나갈 것입니다. 현재 생각하고 있는 서브프로젝트는 뇌의 시각 처리 과정을 그대로 따라하는 프로그램을 만드는 것입니다. 뇌는 색깔, 선의 각도, 움직임 등의 정보를 따로, 단계별로 처리합니다. 그 과정을 똑같이 따라 구현해보고 싶고, 이 과정을 통해 뇌의 시각처리과정을 시각화하며 더 잘 이해할 수 있을 것이라고 생각합니다.",
      "stacks":"machine learning, deep learning, computer vision, python, pytorch, tensorflow",
      "paths":"에브리타임 게시판",
      "portfolio":"https://bit.ly/cy_portfolio"
   },
   {
      "info":{
         "userId":0,
         "name":"김승언",
         "tel":"01075567361",
         "email":"seungeon19@ewhain.net",
         "major":"컴퓨터공학",
         "studentNum":"1976070",
         "isCore":0
      },
      "firstInput":"",
      "secondInput":"",
      "thirdInput":"",
      "fourthInput":"",
      "stacks":"",
      "paths":"",
      "portfolio":""
   },
   {
      "info":{
         "userId":0,
         "name":"송지민",
         "tel":"010-6471-4487",
         "email":"songing01@gmail.com",
         "major":"컴퓨터공학과",
         "studentNum":"2076214",
         "isCore":0
      },
      "firstInput":"저는 GDSC 커뮤니티 활동을 통해서 이화의 개발자들을 알아가고, 그들과 상호 협력하여 저 개인 뿐만 아니라 모두의 발전을 경험하고 싶어 지원하게 되었습니다. 특히, GDSC에서 매주 본인의 프로젝트를 소개하고 핵심 기술에 대하여 스피치를 하는 활동이 인상 깊었습니다.\n저는 작년에 개발을 시작하게 되었는데, 그동안 개인과 팀 프로젝트를 수행하며 해당 웹이나 앱의 최종적인 기능이 아닌 코드에 대해 누군가에게 소개할 기회가 거의 없었습니다. 그러다 보니, 코드에 대한 충분한 이해보다는 빠르게 결과물을 내는 것에 초점이 맞춰지게 되었습니다. 그리고 블로그에 제가 작성한 코드를 정리하는 과정에서, 코드에 대해 적절한 용어와 함께 구체적인 설명을 하는 것이 어렵다고 느꼈습니다. 따라서, 저는 GDSC 활동 중 구성원들에게 제 프로젝트의 핵심 기술을 소개하고 매주 다른 구성원들의 소개를 들으며, 코드에 대한 더 정확한 이해 함께 기술에 대한 작성 및 스피치 능력을 키우고자 지원하게 되었습니다.",
      "secondInput":"저는 커뮤니티란 공통성을 기반으로 모인 단체로서, 서로 연대감을 가지고 협력할 수 있는 공동체라고 생각합니다. 이 커뮤니티의 구성원들은 특정한 가치의 실현을 위해 행동을 같이 하거나 뜻을 함께하며 서로를 도울 수 있습니다. 따라서, 저는 사람들이 단순히 공통성으로 모인 관계에서 그치지 않고 더 나아가, 그 공통성을 기반으로 서로 연대하여 모두의 발전을 이끌어나가는 것이 커뮤니티의 의미이자, 이상적인 모습이라고 생각합니다. GDSC Ewha의 경우, '이화'와 '개발자'라는 공통성을 가진 사람들이 모였을 뿐만 아니라, 그들은 개발자 간의 네트워크와 실력 성장이라는 공동의 목표를 가지고 모인 사람들이므로, 구성원 모두의 성장에 있어서 더욱 큰 시너지 효과를 발휘할 수 있는 커뮤니티라고 생각합니다. ",
      "thirdInput":"저는 react-native로 투두앱을 만들었던 팀 프로젝트와 react로 도서 검색 웹을 만들었던 프로젝트가 가장 기억에 남습니다.\n먼저, 전자의 경우는 시중에 출시된 투두앱의 거의 모든 기능과 추가적인 기능까지 갖추었었는데, 제가 진행해 본 프로젝트 중 가장 기능이 많았기에 그만큼 장기간 동안 열심히 참여했었습니다. 투두앱의 기본적인 기능과 google map api를 이용한 위치 입력, 사진 촬영 및 첨부 기능, 디자인 등등 팀원 모두가 열정적으로 참여했던 프로젝트였습니다. 또 제가 처음으로 진행해본 팀 프로젝트였기 때문에, 여러명이 함께 기획과 구상을 하고 git을 다루는 과정까지 익숙하지 않아 어려움이 많았기에 더욱 열심히 참여했습니다.\n도서 검색 웹의 경우 google books api를 이용하여 개발을 했었는데, api 연결과 가져온 정보를 다루는 과정에서 어려움을 많이 겪어 오랜 시간 동안 오류를 해결하며 열심히 참여했던 경험이 있습니다.  ",
      "fourthInput":"제가 GDSC Ewha Member로 함께한다면, 먼저 이화의 개발자들과의 네트워크에 적극적으로 참여하고 싶습니다. 그동안 이화의 개발자 뿐만 아니라 동기조차 제대로 만나본 적이 많이 없는데, 꼭 GDSC에서 많은 개발자들을 만나고 소통하고 싶습니다. 또, 개인 프로젝트를 진행하고 매주 정기 모임에 참석하며 개발 지식 및 실력을 키워 성장하고자 합니다. 저는 이번 학기에 휴학을 하게 된 만큼 개인 프로젝트에 많은 시간을 할애하고, 그동안 해온 것 보다 더 발전된 프로젝트를 개발하여 뚜렷한 성장을 이루어내고 싶습니다. 특히, 그동안은 프론트엔드만 개발을 했었는데, 백엔드까지 개발하여 출시가 가능한 앱이나 웹을 개발해보고 싶습니다.\n또, GDSC Ewha의 구성원으로서 2022 Google 행사, GDSC Ewha의 행사, GDE 개발자와의 미팅 등에 참여할 수 있는 기회가 있다면 누구보다 열정적으로 참여하여, 많은 지식과 개발자로서의 동기부여를 얻어 갈 수 있었으면 좋겠습니다. ",
      "stacks":"Frontend(React)",
      "paths":"개발자 쟈미님 티스토리",
      "portfolio":"github: https://github.com/songing01 || tistory: https://ssongjim.tistory.com/"
   },
   {
      "info":{
         "userId":0,
         "name":"한다현",
         "tel":"01082689877",
         "email":"ekgus9701@gmail.com",
         "major":"컴퓨터공학",
         "studentNum":"1971055",
         "isCore":0
      },
      "firstInput":"저는 GDSC 커뮤니티 활동을 통해 이화의 다른 멋진 개발자분들과 소통할 수 있는 기회를 얻고 싶습니다. 물론, 제가 컴퓨터공학과 학생이기 때문에, 동기들도 개발을 하는 친구들이 많습니다. 하지만, GDSC Ewha에서처럼 자신이 무엇을 하는지, 어떤 걸 개발하고 있는지에 대해 본격적으로 이야기를 들을 수 있는 기회는 많지 않습니다. 그래서, 저는 GDSC Ewha에서 다른 분들의 개발 이야기를 들으며 다양한 분야의 개발 이야기를 접하고 싶고, 그 분들의 영향을 받아 저 스스로 개발에 대한 의지를 불태우고 싶습니다. 또한, 6개월 간 개인 프로젝트를 진행한다는 점도 큰 장점인 것 같습니다. 혼자 개인 프로젝트를 진행하다보면 느슨해지기 쉽지만, GDSC Ewha에서 활동하게 되면 프로젝트를 공유해야 하기 때문에, 열심히 프로젝트를 진행할 수 있을 것 같습니다. 또한, 다른 분들과 개인 프로젝트 주제를 공유한다면 서로의 프로젝트를 기획하는 데에 도움이 될 수 있을 것 같습니다.",
      "secondInput":"제가 생각하는 커뮤니티란 두가지 측면이 있습니다. 첫번째 측면은 발전과 공생이라는 키워드를 포함하고 두번째 측면에서는 격려와 위로를 포함합니다. 우선, 전자에 대해 이야기해보자면, 본인이 필요한 정보만을 일방적으로 얻는 것이 아니라 그 공간에서 서로에게 유용한 정보를 공유하면서 서로에게 발전의 기틀을 마련해주는 것이 커뮤니티라고 생각합니다. GDSC Ewha에서는 참여자 전원이 개발자이기 때문에 서로에게 유용한 정보를 필수적으로 공유할 수 있습니다. 그 과정에서, 누구 하나만이 정보를 얻어가는 것이 아니라 모두가 필요한 정보를 얻어가면서 개발자로서 성장할 수 있을 것이라고 생각합니다. 다음으로, 후자의 개념의 커뮤니티는 서로에게 힘이 될만한 조언과 위로를 해줄 수 있는 곳이라고 생각합니다. GDSC Ewha는 모든 구성원이 이화여대 학생으로 기본적으로 서로에 대한 애정이 있다고 생각합니다. 따라서, 서로의 개발 이야기를 듣고 조언과 격려를 아낌없이 해줄 수 있을 것이라고 생각합니다.",
      "thirdInput":"저는 제 스스로의 진로를 찾기 위해 앱 개발, 웹 개발, 게임 개발, 데이터 분석 등 다양한 분야를 탐구해봤습니다. 제가 가장 열심히 한 프로젝트는 현재 진행하고 있는 졸업프로젝트입니다. 저는 현재 유니티를 이용한 vr 게임을 만들고 있습니다. 게임의 주제는 환경으로 환경오염이 심각한 요즘 시대에 경각심을 주고 관련 정보를 제공하기 위한 환경 관련 vr 게임을 3명이 함께 개발 중 입니다. 졸업프로젝트로 게임 개발을 진행하고있기는 하지만, 저의 진로로는 앱 프론트엔드를 생각하고 있기 때문에, 이와 관련한 프로젝트도 추가로 소개하겠습니다. 저는 react-native를 이용해서 제가 좋아하는 것들을 모두 모은 앱을 만들었습니다. 제가 좋아하는 유명인의 사진을 볼 수 있는 공간과, 좋아하는 드라마, 책에 대한 별점과 후기를 작성해 둔 공간, 포춘쿠키, 기분 캘린더, 버킷리스트를 구현해뒀습니다. 이 프로젝트를 통해 react-native의 다양한 기능을 구현해 볼 수 있었습니다.",
      "fourthInput":"제가 GDSC Ewha member로 함께하게 된다면, 앱 개발을 조금 더 공부해 볼 것 같습니다. 이전 질문에서 말씀드린 것처럼 여러 분야를 탐구하다보니 한 분야에 대한 전문성이 떨어지는 것을 느껴, GDSC Ewha에서는 앱 프론트엔드에 대해 깊이 공부해보려합니다. 특히, 앱 프론트엔드 개발 관련 언어 중 flutter를 새롭게 공부해보고 싶습니다. flutter는 한번도 공부해본 적이 없어 처음에는 어려움이 있겠지만, flutter를 공부해 제가 원하는 프로젝트를 기획하고 개발할 정도로 flutter 실력을 늘리고 싶습니다. 두번째로는, 발표 세션에도 적극적으로 참여하고 싶습니다. 앞서 말씀드렸다시피 저는 앱개발, 웹개발, 게임개발. 데이터분석까지 조금씩 경험해봤기 때문에, 관련 분야에 대한 기본적인 지식이 있습니다. 따라서, 다른 분들이 본인의 개발 이야기를 해주실 때 조금 더 수월하게 이해할 수 있을 것이고, 이를 바탕으로 도움이 되는 피드백을 드리고 싶습니다.",
      "stacks":"앱 프론트엔드(flutter(공부 예정), react-native)",
      "paths":"지인 소개",
      "portfolio":"https://github.com/ekgus9701 ,   https://velog.io/@kkily55"
   },
   {
      "info":{
         "userId":0,
         "name":"김유경",
         "tel":"010-3442-2516",
         "email":"bsoiyou@naver.com",
         "major":"사이버보안전공",
         "studentNum":"2081008",
         "isCore":0
      },
      "firstInput":" 매 방학이 오면 웹페이지 개발, 기초적인 안드로이드 앱 개발, 클론 코딩 프로젝트 등을 진행하면서 차근차근 혼자 개발 공부를 해왔습니다. 이번 방학에 클론 코딩을 즐겁게 마치고 나니, 다음으로는 직접 아이디어를 구현하여 처음부터 끝까지 개발하는 ‘나만의 프로젝트’를 완성하고 싶다는 목표가 생겼습니다. \n 학기가 다가오면 늘 바쁘다는 핑계로 개발 공부를 방학으로 미루었는데, 이번에는 다음 방학을 기다리는 것이 아니라 당장 프로젝트를 시작하고 싶은 마음이 컸습니다. 수업과 병행하면서 자율적으로 꾸준히 할 수 있을지 걱정하다가 ‘만약 혼자가 아니라 이 과정을 함께하는 커뮤니티가 있다면 어떨까?’라는 생각이 들었습니다. \n GDSC에서 같은 학생들끼리 서로 자극을 주고, 끝까지 할 수 있다는 용기를 얻고, 의지를 충전한다면 포기하지 않고 근사한 프로젝트를 완성할 수 있을 것입니다. 개인 프로젝트와 더불어 다양한 사람들의 공부 분야도 접하면서 시야를 넓히고 더 성장하고 싶습니다. \n",
      "secondInput":" 커뮤니티는 소속감을 주는 울타리면서, 동시에 자신을 가둔 틀을 깨부수어 줍니다. \n 혼자 공부할 때면, 같은 수업을 듣는 수강생들의 커뮤니티가 있는 경우와 없는 경우의 차이가 매우 컸습니다. 커뮤니티에서는 코딩할 때 자신이 했던 실수를 다른 사람이 하지 않도록 정보도 공유하고, 활발한 질문과 답변이 오갔습니다. 그 분위기에서 저는 언제든 도움을 요청하여 어려움을 해결할 수 있다는 용기를 얻었고, 실패에 실망하지 않을 수 있었습니다. \n 자신이 하기 힘들 것이라고 단정 지은 일에서 가능성을 찾을 수도 있습니다. 함께 할 때의 가장 큰 장점인 거침없음과 무모함을 이용하여 어려운 기능 구현에 도전해 보고, 무모한 아이디어의 실현을 시도할 수 있습니다. 커뮤니티 안에서 개인은 능력치의 틀을 깨고 한계 없이 성장할 수 있습니다. \n 커뮤니티의 이 두 가지 역할이 개발 공부와 프로젝트 진행에 매우 좋은 영향을 준다고 생각합니다.",
      "thirdInput":" 이번 방학에 '카카오톡 클론 만들기' 개인 프로젝트를 진행했습니다. HTML, CSS를 활용한 front-end 개발로 '카카오톡' 애플리케이션을 비슷하게 구현하는 프로젝트입니다. 로그인 화면, 채팅 화면, 친구 목록 등 다양한 페이지를 구성하고 애니메이션 생성과 원하는 테마 디자인까지 하면서 저만의 애플리케이션을 완성했습니다. \n 이전까지는 개발 공부를 할 때 이론 숙지에 급급했는데, 클론 코딩을 하니 코드와 동작의 관계를 명확히 이해할 수 있었습니다. 원하는 기능을 직접 작성하고 구현하며 자신감도 생겼습니다. 무엇보다 front-end 개발의 재미를 알게 된 것이 가장 큰 성과라고 생각합니다. \n 완성하고 욕심이 생기면서 어떤 기능을 더 추가할 수 있을지, 그럼 어떤 언어를 공부해야 하는지 등 다음 공부까지도 이어서 생각하는 기회가 되었습니다. 앞으로 다양한 프로젝트를 하면서 힘들고 어려울 때도 있겠지만 이 프로젝트에서 느낀 단순한 즐거움을 잊지 않고, 즐기며 개발할 것입니다.",
      "fourthInput":" 클론 코딩으로 front-end 웹 개발을 공부했으니, JavaScript와 back-end 공부를 하여 더 발전된 웹 개인 프로젝트를 진행할 계획입니다. 현재 공부 중인 Python, Django를 활용하여 back-end 개발을 연습하고 저의 아이디어를 바탕으로 웹사이트를 만들고자 합니다.\n 앱 개발에도 흥미가 있어 Android Studio를 활용한 기본적인 앱 개발도 연습하고 싶습니다. 이 모든 과정에서 커뮤니티를 적극 이용하여 스터디 모임이나 함께 코딩하는 시간에 활발히 참여하고, 공부량을 늘려 성장하겠습니다.\n 개인 프로젝트와 더불어 가장 하고 싶은 활동은 벗들과의 팀 프로젝트입니다. 함께 한다면 더 큰 목표를 가질 수 있고, 겁내지 않고 도전할 수 있다고 생각합니다. 가능하다면 공모전이나 leap 소그룹 활동 등에 팀을 이루어 참가하고 싶습니다. 1년간 개인 역량을 쌓아 내년에 열리는 GDSC Solution Challenge 해커톤에도 참여하고 싶습니다.",
      "stacks":"Frontend(HTML,CSS,JavaSript), Backend(C,Java,Python (Django,Spring)), Android Studio",
      "paths":"에브리타임 홍보게시판",
      "portfolio":"https://github.com/bsoiyou , https://ste4dy.tistory.com"
   },
   {
      "info":{
         "userId":0,
         "name":"안서연",
         "tel":"010-9171-4316",
         "email":"sonoasy@ewhain.net",
         "major":"컴퓨터공학과",
         "studentNum":"1876217",
         "isCore":0
      },
      "firstInput":"다른 개발자분들과 개발과정에 있어서 고민과 경험을 공유하면서 자극도 받고 개발 과정에서의 재미를 느껴보고 싶습니다.또, 어떤 주어진 주제나 성과를 달성하기 위한 개발만이 아닌 스스로 선택하여 도전해보고 싶은 분야에 프로젝트를 진행하면서 관심 있는 분야에 대해서 알아가기도 하고, 스스로 개발과정에서 마주칠수 있는 어려움들을 해결하기도 하면서 이를 다른 사람과 공유하면서 성장할수 있었으면 좋겠습니다.그리고 프로젝트에 대해서 자유로운 의견 교류를 하는 경험을 해 보고 싶습니다. 하나의 프로젝트에 대해서도 나올수 있는 다양한 의견을 접하면서 시야를 좀더 넓힐수 있는 기회를 가질수 있었으면 좋겠습니다. 이처럼 gdsc 활동을 통해서 다른 사람과 교류하면서 성장할수 있는 기회를 접하고 싶어서 지원하게 되었습니다. 서로 다른 사람들이 지향하는 개발에 대한 의미도 접해보고 싶고,자유로운 분위기 속에서 자율적으로 형성되는 모임이나 스터디에도 참여해서 자율적이고, 적극적인 태도도 배워보고 싶습니다. ",
      "secondInput":"다른 경험과 생각을 가진 사람들이지만, 교류를 하면서 공감되는 점이나 비슷한 지향점을 바탕으로 서로 지지해줄수도 있고, 다른 의견을 주고받으면서 성장할수 있는 곳이 커뮤니티라고 생각합니다.또한 사소한 아이디어라도 누군가 주목한다면 무언가 시작할수 있게 할 수 있는 역할도 할 수 있다고 생각합니다.자유로운 분위기의 커뮤니티에서 아이디어를 표현하면서 실현하는것까지도 가능하다고 생각합니다.그리고 다른 사람과 함께하면서 스스로가 겪어왔던 경험이나 관점과 다른 다양한 관점을 배울수 있을 거라 생각합니다. 커뮤니티는 아니지만 같은 자료를 읽고 토론을 하면서 진행되는 학교 수업을 들으면서 혼자 생각하는 것 보다 여러 사람들이 함께 다른 의견을 주고받으면서 읽기 자료에 대한 이해가 깊어지거나 생각을 다른 방향으로 전환할수 있는 계기가 되었던 것이 좋았던 경험이 있습니다. gdsc에서 개발과 관련하여 좀더 적극적으로 사고할수 있는 개발자의 태도도 배워보고 싶고 직접 개발하면서 실천해보고 싶습니다. ",
      "thirdInput":"가장 열심히 참여했던 프로젝트는 졸업프로젝트로,1년동안 기획부터 개발, 프로젝트를 다른사람에게 소개하는것까지 거의 모든 과정을 경험할수 있었던 프로젝트라고 생각합니다. 1년동안 진행해야하기 때문에 프로젝트를 진행시키기 위해 시간관리나 팀 내에서 역할분배와 같이 개발과정에서 고려해야할 점들을 많이 알게 되고 배워갈수 있었습니다.팀 단위로 개발하여 개발을 진행할 때 다른사람과 협력을 원활하게 하는 것이 중요하다는 것을 알게되기도 하였습니다.진행한 프로젝트는 일상에서 무인키오스크의 사용이 확산하는 가운데 디지털 기기에 익숙하지 않은 사람들을 위해 음성대화가 가능한 인공지능 서비스를 개발하는 것이었는데,프로젝트를 진행하면서 구현하려고 했던 기능이나 성능적인 부분에 대해서 생각하지 못하였던 의견들을 접하면서 의견 교환의 중요성에 대해서 배울수 있었습니다. 또한 깊이 아는 분야가 아니었음에도 조금씩 목표와 기준을 세우고 공부하면서 개발하고 마무리하는 경험을 할수 있어서 의미있었던 것 같습니다.",
      "fourthInput":"gdsc 활동을 할수 있게 된다면 관심있는 소모임이나 스터디에 참여해서 성실하게 활동해보고 싶습니다. 기회가 된다면 여러 가지 모임에 참여해보고 싶습니다.프로젝트의 경우 진행하고 싶은 주제를 정하고 진행하는데 필요한 지식이나 기술을 확인하고 시간 계획을 세워서 점차 배워가면서 진행하고 싶습니다. 잘 모르는 분야일 경우 다른분들께 물어보거나 스스로 많이 찾아보면서 알아가고 진행하면서 문제가 되는 상황이 생길 경우 해결하였을 때 문제상황을 해결한 방식을 기록하고 싶습니다. 새로 배우는 기술일 경우에도 조금씩 기록해서 진행 상황이나 어려웠던 부분을 정리하면서 진행하고 싶습니다. 또 프로젝트 관해서 다른 분들의 프로젝트 주제나 진행 과정에 대하여 경청하면서 많이 배워가고 싶습니다. 개발 분야를 많이 알지 못하기도 해서 여러 분야에 대해 알수 있었으면 좋겠습니다. 이외에도 행사나 강연이 개최된다면 참여하고 싶고 커뮤니티에서 참여하는 활동에 충실하면서 준비도 열심히 하면서 참여하고 싶습니다. ",
      "stacks":" (관심분야)컴퓨터그래픽스,컴퓨터비전,AR/VR,메타버스,게임개발,앱 개발 (기술스택)웹:html,css,js,php,mysql 언어:c/c++, java,python,c#(unity)  ",
      "paths":"2019년에 학교에서 devfest가 열려서 행사를 참여하면서 알게되었습니다.",
      "portfolio":"https://github.com/sonoasy"
   },
   {
      "info":{
         "userId":0,
         "name":"고민지",
         "tel":"01071864534",
         "email":"mjk4534@ewhain.net",
         "major":"사이버보안",
         "studentNum":"2071058",
         "isCore":0
      },
      "firstInput":"우선 저는 커뮤니티 활동을 통해 이화여대 개발자분들과 소통하고 싶습니다. 소수과 소속에다 코로나 학번으로 동종업계 진출 희망자를 만날 기회가 적었는데, GDSC 커뮤니티 활동을 통해 다른 개발자 분들과 소통하고 싶습니다. 또한 주변 분들이 다들 공대생이라서 타대생을 만나기 힘들었는데, GDSC 커뮤니티에서 활동하면 다양한 배경을 가진 분들을 만나볼 수 있지 않을까 하는 기대감에 지원하게 되었습니다. \n\n그리고 저는 혼자서 공부하면 효율이 떨어지는 스타일의 사람이라고 생각합니다. GDSC에서 진행하는 스터디에 참여해서 열심히, 도움을 주고 받으면서 공통의 관심분야에 대해서 스터디를 진행하고 싶습니다.",
      "secondInput":"커뮤니티란 서로에 대해 이해하고 공감하며, 같이 문제를 해결해 나가는 공간이라고 생각합니다. 같은 공동체에 소속된 사람들의 관계에서 이해와 공감이 뒷받침 되지 않는다면 커뮤니티의 의미는 퇴색될 것이라고 자부합니다. 이해와 공감이 앞선 채, 문제가 생기면 다 같이 해결해 나가는 것이 커뮤니티라고 생각합니다. 커뮤니티라는 공간은 제 스스로에게 도움이 될 뿐만 아니라, 같은 커뮤니티 멤버에게도 도움을 주어야 그 가치가 비로소 실현된다고 생각합니다. 또한 커뮤니티를 널리 알려 커뮤니티의 확장을 이루는 것도 커뮤니티가 해야할 일이라고 생각합니다. ",
      "thirdInput":"2021년 2학기 ‘웹보안및실습’ 수업의 일환으로 진행한 보안 프로젝트가 가장 기억에 남습니다. \n\nPDF 악성 여부를 판별하는 모델이 적용된 웹 사이트에서 사용자가 PDF 파일을 웹 사이트에 업로드 하면 머신러닝을 통해 판별 및 출력하는 기능을 구현하는 프로젝트에 참여했습니다. 저는 머신러닝을 구축하는 일을 담당했었는데, 사실 머신러닝에 대해 거의 모르는 상태에서 참여했어서 많이 힘들었지만 더 뿌듯한 경험이었습니다. \n\n참고 링크: [https://github.com/kshjessica/study_Web-Secuity](https://github.com/kshjessica/study_Web-Secuity)",
      "fourthInput":"Golang 스터디가 있다면 참여해서 Go 에 대해서 배워보고 싶습니다. 또한 따릉이 소모임과 같은 운동이나 취미 소모임에도 참여하고 싶습니다. \n\n현재 친구와 개인적으로 캠스를 진행하고 있는데, GDSC Ewha에 들어가게 된다면 GDSC Ewha만의 게더타운에서 멤버분들과 함께 모각코에 참여하고 싶습니다. 그리고 마지막으로 깃헙 잔디쌓기를 해보고 싶었는데, 커뮤니티 멤버로써 참여한다면 의무감이 생겨 더 열심히 하지 않을까 하는 기대감이 있습니다. \n\n또한 GDSC 커뮤니티의 목적 중 하나는 공통의 분야에 관심이 있는 사람들이 모여서 소통하는 것이라고 생각하는데, 괜찮은 공모전이나 대회가 있다면 커뮤니티 멤버들과 함께 참가하고 싶습니다.",
      "stacks":"관심 있는 개발 분야: Go lang, 웹앱 개발 / 기술 스택: C (중), C++ (중), Java (중), Python (하)",
      "paths":"코어 멤버들 중 친구들이 있어 알게 되었습니다. 한 학기 동안 활동하는 모습을 보고, GDSC Ewha에 들으며 굉장히 좋은 커뮤니티라는 확신이 생겼고, 이번 기회에 지원하게 되었습니다. ",
      "portfolio":"https://github.com/spiritstone?tab=repositories & https://mjprogramming.tistory.com/"
   },
   {
      "info":{
         "userId":0,
         "name":"이윤진",
         "tel":"01068996012",
         "email":"yuncom21@ewhain.net",
         "major":"컴퓨터공학",
         "studentNum":"2176283",
         "isCore":0
      },
      "firstInput":"안녕하세요. 저는 GDSC Ewha 3-2기 member에 지원한 컴퓨터공학과 2학년 이윤진입니다. 제가 GDSC Ewha에 지원한 이유는 GDSC　Ewha 란 Developer가  혼자만의 힘으로 기획한 개발뿐만 아니라 서로의 의견을 함께 주고받으며 기획한 Developers의 개발을 할 수 있는 커뮤니티라고 생각했기 때문입니다. GDSC Ewha에서 이러한 팀 활동을 developer로서 실현해낼 수 있다는 점에서 매우 멋있게 다가온 것 같습니다.\n\n저는 GDSC 커뮤니티 활동을 통해 먼저 Ewha 개발자들과 함께 성장해나가고 싶습니다. GDSC Ewha에서는 매주  Seminar를 통해 개발 지식을 학습할 수 있고, 개인 혹은 팀 Project를 통해 개발 실력을 향상시킬 수 있으며 모각코 또는 GDSC Solution Challenge와 같은 GDSC 행사를 통해 실력뿐만 아니라 member 간의 친밀감을 형성해 함께 성장을 도모할 수 있을 것 같았기 때문입니다.",
      "secondInput":"제가 생각하는 커뮤니티란 GDSC Ewha 그 자체라고 생각합니다. 왜냐하면 GDSC Ewha에서는 Ewha 개발자들 간의 커뮤니케이션을 통해 열정적인 개발을 할 수 있을 뿐만 아니라 GDSC Korea 개발자들과 스터디를 기획할 수 있으며, 더 나아가 여러 국가의 GDSC와 커뮤니케이션을 이룰 수 있기에 최종적으로 지역사회의 발전에 기여할 수 있기 때문입니다. 저는 GDSC Ewha의 세미나를 통한 개발 지식 공유, 그리고 팀원들과의 프로젝트 진행과 같은 협업 활동들을 통해 서로 도우며 발전해나가는 모습을 찾아 볼 수 있었는데 저는 이러한 협업 활동이 현재에도 멋진 GDSC Ewha 커뮤니티를 더욱 가치있게 성장시킬 수 있다고 생각합니다. 따라서 GDSC Ewha는 이 커뮤니티에 소속된 모든 (core) member들이 개발이라는 공통적 관심을 바탕으로 소속감과 친밀감을 지니고 있기에 저는 GDSC Ewha가 커뮤니티의 대표적인 사례이자 커뮤니티의 본질이라고 생각합니다.",
      "thirdInput":"저는 2022년도 1월과 2월에 걸쳐 동기들과 함께 자바 스터디를 진행했습니다. 이때 저희 팀은 자바의 이론 강의를 학습하고 프로젝트를 만들었습니다. 제가 열심히 참여한 프로젝트는 대중교통의 요금을 산출하는 프로젝트와 고객 관리 프로그램입니다.\n대중교통 요금 산출 프로젝트는 기본요금을 바탕으로 승객의 나이와 이동거리에 따라 요금을 추가해 가는 방식으로 만들었습니다. 저는 대중교통 클래스와 탑승객의 클래스 그리고 탑승객이 대중교통을 이용할 때의 상황을 구현한 클래스를 생성하여 프로젝트를 구현하였습니다. 이때 버스는 500m 와 같이 거리에 따라, 지하철은 1정거장에 따라 추가요금을 증가시켰습니다.\n두 번째 프로젝트는 고객을 일반 손님과 VIP 손님으로 나누고 손님이 사고자 하는 제품의 할인율과 혜택 적립 비율을 고객에 따라 각각 다르게 적용시켜 만들었습니다. 이때, VIP 손님 클래스는 일반 손님 클래스를 상속받게 만들어 일반 손님보다 더 많은 기능을 구현할 수 있도록 만들었습니다.",
      "fourthInput":"제가 GDSC Ewha Member로 함께 하게 된다면 매주 수요일 8시에 진행하는 GDSC Ewha Seminar를 통해 제가 공부한 개발 지식을 공유할 것입니다. 저는 벡엔드, 프론트엔드 개발자에 관심이 많기 때문에 벡엔드 개발을 위한 개발 언어와 웹 프레임워크인 NodeJS 그리고 프론트엔드 개발을 위한 언어인 HTML CSS에 대해 공부할 것입니다. 이때, 저는 GDSC Ewha member 들과 Study를 통해 같이 협업해서 개발 공부를 할 것입니다. 또한 저는 Member들과의 개발이 지역사회에 조금이라도 보탬이 될 수 있는 프로젝트를 생성해 많은 이들에게 도움을 주고 싶습니다. 마지막으로 저는 GDSC Ewha에서 진행하는 모든 Events and Activities를 참여할 것이며 특히 저는 다른 학교 GDSC와 함께하는 해커톤에 꼭 참여해 보고 싶고 Ewha Member 들과 함께하는 50days Committers Challenge에 도전해 보고 싶습니다.  ",
      "stacks":"Backend(Java)  Frontend",
      "paths":"에브리타임",
      "portfolio":"https://github.com/yunjin-21                     https://interesting-belly-f09.notion.site/Hello-I-m-Yunjin-Lee-389f745518f043bab42da35252b74a61"
   },
   {
      "info":{
         "userId":0,
         "name":"강민채",
         "tel":"01085469335",
         "email":"cha_ming20@ewhain.net",
         "major":"컴퓨터공학과",
         "studentNum":"2071002",
         "isCore":0
      },
      "firstInput":"몇 줄의 줄 글로, 머릿속 상상을 실제로 구현한다는 것은 정말 매력적입니다. 하지만 다양한 아이디어, 프로그램 툴 그리고 언어 등 선택의 폭이 넓고 자유도가 높습니다. 그에 반해 한정적인 시간과 매겨지는 우선순위들은, 늘 끄적여둔 토이 프로젝트들을 실현하기에 사소하지만 거추장스러운 제약이 됩니다. 매 학기마다, 이번에는 ‘파이썬을 정복하겠어’, ‘씨쁠을 정복하겠어!’하며 개발을 하기 위해 언어공부 계획을 세우지만, 실제로 개발에 착수하기도 전에, 현생에 쓸려내려가거나, 피드백의 부족으로 진전이 없는 일의 반복입니다.\n하지만, 늘 누군가와 함께 하곤 했던 계획들-랩 인턴, 해커톤, 하다못해 학교 수업의 팀플이라도-은 높은 우선순위를 배정받아, 끝까지 마무리하여 좋은 결과를 낼 수 있었습니다.\n그래서 저는 GDSC 커뮤니티 활동으로 ‘든든한 동료’를 얻고 싶습니다. 2020년, 코로나의 강타로 선후배들과 동기들과의 커넥션이 약한 제 자신에게, 함께하는 동지를 만들어주고 싶습니다. ",
      "secondInput":"‘어떤 분야에 관심있는 사람들끼리 모여 지식을 공유하는 장’이라고 생각합니다. 제가 커뮤니티의 의미를 몸으로 느낀 것은 2학년 여름방학때 참여한 HCI랩실 인턴 활동을 하면서 입니다.\n정신적 혹은 신체적으로 어려움이 있는 사람들에게 도움이 되는 일을 하고 싶어, 교내 HCI랩에 컨택해 학부생 인턴으로 프로젝트에 참여했습니다. 첫 인턴 활동인데다, 마땅히 조언을 구할 선배들도 없어 더욱 힘들었던 기억이 있습니다. 하지만 유니티 프로그램을 처음 배우며, 교수님과 석사님들께 조언을 많이 들었습니다. 뿐만 아니라 매주 연구 과정을 발표하는 시간을 보내며, 여러 프로젝트를 보고 듣는 것만으로도 시야가 넓어짐을 느꼈습니다. 이렇듯 비슷한 관심사를 둔 다양한 사람들과 한 커뮤니티에 속해 있다는 것만으로도 많은 지식을 얻을 수 있고, 나 또한 누군가에게 내가 도움받은 만큼 새로운 시야를 줄 수 있음을 깨달았습니다.\nGDSC Ewha라는 커뮤니티에서 이런 순기능의 순환을 다시한번 일깨우고 싶습니다.",
      "thirdInput":"교내 동아리 KING이 주최한 ’MAKING JAM 해커톤’에서 ‘랜덤으로 드롭되는 재료들을 습득하고, 그 조합에 따라 요리의 결말이 달라지는’ 게임 제작에 참여했습니다.\n처음 맡은 파트는 ‘여섯 가지 아이템을 끊임없이 드롭’하는 기능이었습니다. 구현해본 적 없는 내용이었지만, 문득 어렸을 때 했던 ‘떨어지는 장애물을 피하는 게임’이 떠올랐습니다. 비슷한 내용을 구현한 코드를 참조할 수는 있었지만, 이런 종류의 게임은 동일한 아이템을 드랍했기 때문에 여러 아이템을 랜덤하게 생성하는 기능을 추가하고 다듬어야 했습니다. 원하는 기능을 실현하기 위해서는, 마치 톱니바퀴가 가득 찬 기계가 매끄럽게 서로 맞물리며 돌아가는 것처럼, 구간 구간을 적절하게 나눠 구현한 뒤 다양한 부분 요소들에서 필요한 부분들을 매끄럽게 조합하는 것이 필요하다는 것을 체득할 수 있었습니다.\n확실히 3일 동안 하나의 게임을 만든다는 목적을 가지고 프로젝트에 집중을 하니, 실천적으로 배우는 게 컸다고 느꼈습니다.",
      "fourthInput":"작년 여름방학에 지인과 만든 보드 게임을 PC게임으로 구현하고자 합니다. 6개월 동안의 토이 프로젝트로, 간단하게 핵심 기능 몇 가지만이라도 만드는 게 목표입니다. 간단하게 게임을 소개하자면, 2명의 플레이어가 돌아가며 7개의 주사위를 굴려, 주사위 눈과 동일한 카드를 골라 가져올 수 있고, 모은 카드로 계산한 점수가 높을 수록 이기는 게임입니다. 7개 주사위 굴리기, 랜덤하게 카드 배열, 카드 뒤집기, 점수 계산 및 비교 등의 기능을 우선으로 개발하고 싶습니다. 사용할 프로그램은 지난 인턴과 해커톤에서 사용해보았던 유니티로 만들 생각입니다. 필요한 이미지는 우선, 유니티의 기본 에셋을 사용하고 필요하면 같이 기획했던 지인의 도움 혹은 디자이너 한 명을 구할 생각입니다. 프로젝트 시작 첫 달은 게임에 필요한 기능을 고민하고 그 우선순위를 나누며 정리할 생각입니다. 그리고 다음 4달 동안 각 기능 부분을 개발하고, 마지막 한 달 동안 기능을 종합하여 마무리하는 계획입니다.",
      "stacks":"게임 개발, 웹 서비스 분야// Frontend(React, JS) , Backend",
      "paths":"에브리타임 동아리 홍보 게시판",
      "portfolio":"https://thoughtful-scissor-971.notion.site/97504192485b4aa2bb913c7e36ba13c5"
   },
   {
      "info":{
         "userId":0,
         "name":"손효원",
         "tel":"01051944828",
         "email":"hyowon9964@ewhain.net",
         "major":"컴퓨터공학전공",
         "studentNum":"1976196",
         "isCore":0
      },
      "firstInput":"gdsc는 타 동아리나 학회와는 달리 '커뮤니티'라는 점이 매우 끌렸습니다. 정해진 커리큘럼을 따라서 공통된 공부를 진행해야 하는 것이 아닌, 정말 스스로에게 필요하고 제가 하고싶은 공부를 진행할 수 있을 것 같기 때문입니다. 그러면서도 원활한 커뮤니티 활동을 위해서는 저의 공부와 프로젝트를 제대로 진행을 시켜야 하고 남들에게 소개할 수 있어야 하기 때문에 약간의 의무감도 가질 수 있어 스스로의 성장에 큰 도움이 될 것 같다는 생각이 들어 지원하게 되었습니다. 여태까지 제가 공부를 하거나 프로젝트를 진행하면서 느낀 점은, 그 당시에는 알고 있다고 생각한 것도 시간이 지나면 다시 또 찾아봐야 하는 경우가 생각보다 매우 많다는 것이었습니다. 그래서 제가 공부한 내용이나 프로젝트의 진행상황을 정리하고, 발표하면서 남들에게 공유하고 기록을 남긴다면 그 과정과 결과 모두 저에게 매우 유익할 것이라고 생각합니다.  ",
      "secondInput":"커뮤니티는 공통의 관심사를 가진 사람들이 서로의 이야기와 고민을 자유롭게 공유할 수 있는 소통의 장이라고 할 수 있습니다. gdsc로 치자면 '개발'이라는 공통 관심사를 가진 멤버들이 소통하는 공간일 것입니다. 저는 개발의 과정에서는 남들과 생각이나 정보를 공유하는 것이 매우 중요하다고 생각합니다. 같은 결과를 내더라도 개발자마다 코드가 다르고 자신도 모르게 자신에게 익숙한 방식으로만 코드를 짤 때가 있는데, 커뮤니티를 통해 이러한 내용을 서로 공유하면 몰랐던 것도 알게 되고 더 좋은 방향으로 내 코드를 발전시켜나갈 수 있습니다. 이렇게 서로가 가진 방식과 생각을 공유해서 스스로의 능력을 향상시키고 성장할 수 있도록 하는 것이 진정한 커뮤니티의 역할이라고 생각합니다. 커뮤니티가 자유로운 소통을 가능하게 하는 만큼 개인이 그것을 올바른 방향으로 적절하게 활용하는 것 또한 중요하다고 생각합니다.",
      "thirdInput":"저는 다양한 분야를 경험해본 후 이번 겨울방학부터 웹개발자 쪽으로 관심이 기울어 관련 분야에 집중하여 공부하고 있습니다. 따라서 이전에 리액트를 공부했던 것을 기반으로 이번 겨울방학에 '고양이 짤방 만들기'라는 리액트를 활용한 프론트엔드 토이프로젝트를 진행했습니다. 고양이 사진에 제가 입력한 짧은 멘트를 올려 하나의 짤을 생성하는 프로젝트였습니다. 고양이 사진에 대한 데이터셋은 공개api를 연결하여 가져와서 사용하였습니다. 주요 기능으로는 영어로 멘트를 입력한 후 생성버튼을 누르면 랜덤으로 나온 고양이 사진에 입력한 멘트가 작성되어 하나의 짤을 생성하고, 생성된 짤 우측 하단의 하트버튼을 누르면 좋아하는 사진으로 등록할 수 있습니다. 이 토이프로젝트는 한 리액트 강의를 따라서 진행한 프로젝트인데, 강의를 끝낸 후에 저만의 기능과 디자인을 커스터마이징하여 추가하였고, 계속해서 추가 중에 있습니다. ",
      "fourthInput":"현재 백엔드 분야의 공부를 진행하고 있습니다. 공부를 시작한지 얼마 되지 않아 잘 할 수 있을지 모르겠지만, 일단 6개월동안 진행할 프로젝트로 백엔드쪽 프로젝트를 하나 진행해보고 싶습니다. 프론트엔드는 간단하게 구성하고 백엔드쪽에 집중한 프로젝트를 생각중인데, 만약 저와 같은 상황이신 분과 함께 프로젝트를 진행할 수 있는 기회가 있다면 팀프로젝트로 진행하고싶은 생각도 있습니다. 스터디에도 참여할 생각이 있습니다. sql이나 데이터분석 등 데이터를 다루는 활동을 배워볼 수 있는 스터디가 있다면 참여해보고 싶습니다. 또한 gdsc에서 진행하는 다양한 행사와 이벤트에도 적극적으로 참여하고 싶습니다. 해커톤에 참여하여 팀으로 역량을 발휘하고, 모각코로 다른 멤버분들과 인맥도 쌓고 소통도 하고, 강연이나 세미나에 참여하여 개발자분들의 이야기를 듣고 조언을 얻으며 제 스스로를 발전시켜나가고 싶습니다. ",
      "stacks":"Frontend(Javascript, React), Backend(Java, Spring)",
      "paths":"에브리타임",
      "portfolio":"https://github.com/hyowonii"
   },
   {
      "info":{
         "userId":0,
         "name":"곽현정",
         "tel":"01062974056",
         "email":"2171003@ewhain.net",
         "major":"컴퓨터공학전공",
         "studentNum":"2171003",
         "isCore":0
      },
      "firstInput":"저는 현재 인공지능 스터디를 운영하고 있습니다. 공부는 혼자서도 해왔지만 팀 경험이 갖고 싶었습니다, 하지만 그 당시에는 어떤 팀에도 속해있지 않았는데, 수동적으로 동아리를 기다리기 보다는 차라리 직접 만들자라고 생각하게 되었고, 그래서 에브리타임에서 동기들을 모아 스터디를 시작하였습니다. 지금도 이 스터디에서 데이터 분석 프로젝트와 머신러닝 스터디를 활발히 진행해오고 있습니다. 스터디그룹을 이끌어 오면서 함께 나누면 저도 얻을 수 있는 것이 늘어난다는 것을 깨달았고, 더 넓은 곳에서 더 많은 멤버들과 경험을 나누며 저의 기술도 더욱 업그레이드하고 싶다는 갈망이 생겼습니다. GDSC는 분야 상관없이 다양한 멤버들로 구성되어있어 저의 견문도 넓힐 수 있으리라 생각합니다. GDSC를 알게 된 때부터 지금까지 저의 기술적인 부분을 업그레이드시키고자 노력해왔고, 지금은 그 준비가 되었다고 생각합니다. 물론 아직 공부해야 할 것이 많기에 GDSC에서 함께하면서 저를 더욱 발전시키고 싶습니다.",
      "secondInput":"커뮤니티는 함께라는 뜻의 라틴어 ‘com’과 선물이라는 뜻의 ‘munus’가 합쳐진 말이라고 합니다. 즉, 함께, 서로 나누는 것이라고 해석할 수 있습니다. 어떤 커뮤니티는 다수의 의견으로 소수의 의견을 무시하고 내쫓아 결국 자신들의 질을 떨어뜨리곤 하지만, ‘진짜’ 커뮤니티는 서로의 것을 나누고 양보하고, 결국은 함께 발전하는 것이라고 생각합니다. 또, 커뮤니티의 구성원은 커뮤니티의 룰을 그대로 수용하고 수동적으로 따라가는 것이 바람직하다고 생각하는 사람도 있지만, 저의 생각은 다릅니다. 커뮤니티를 능동적으로 해석하고, 현재의 커뮤니티에 반할지라도 공동의 발전에 득이 된다면 자신의 의견을 당당하게 말할 수 있는 사람이 커뮤니티의 바람직한 구성원일 것입니다. ‘진짜’ 커뮤니티에서는 나의 성공뿐만 아니라 남의 실패도 나누면서 배워나가는 공간이라고 생각합니다. 서로의 경험을 나누고, 나눔으로써 생기는 시너지가 곧 자신의 발전에도 도움이 되는 곳이 바로 커뮤니티라고 저는 생각합니다.",
      "thirdInput":"아직까지는 큰 대회나 프로젝트 경험은 없지만, 현재 진행하고 있는 스터디에서 데이터 분석 공부와 병행하여, 거주 주민이 많은 지역의 선별진료소일수록 포화도가 높은지 그 상관관계를 파악하는 프로젝트를 진행하였었습니다. 수도권이나 광역시가 아닌 지역에서는 동과 리 수준의 자세한 데이터는 지원하지 않아서 지역은 서울로 한정하였고, 공공데이터포털과 서울열린데이터광장에서 필요한 데이터들을 수집했습니다. csv 파일로 얻은 데이터에서 pandas를 사용해 인구수, 선별진료소 위치 등 필요한 데이터들만 뽑아 가공하였고, 가공 완료한 데이터는 지도로 시각화하여 나타냈습니다. 도로명주소를 위도와 경도로 바꾸기 위해 구글 맵스 API를 사용하였고, 선별진료소 수 대비 인구수를 지도로 시각화하는 데에는 folium 라이브러리를 활용하였습니다. 아직 공부를 하는 단계였기에 갖가지 산전수전을 겪어야 했지만, 이를 헤쳐나가면서 새로운 것이라 할지라도 두려워하지 않고 부딪힐 수 있는 자신감을 얻었습니다.",
      "fourthInput":"데이터 분석을 공부하면서 금융 데이터를 더 공부해보고 싶어졌습니다. 그중에서도 통계와 컴퓨터를 활용해 금융시장을 분석하는 퀀트에 큰 흥미가 생겼고, 현재 최종 목표는 주식 퀀트 시스템을 구축하는 것입니다. 아직 경제와 관련한 공부를 할 수 있는 기회가 마땅히 없었지만 GDSC에서 단계별로 차근차근 공부해서서 저의 목표를 꼭 구현해내고 싶습니다. 만약 GDSC에 들어가게 된다면 가장 먼저 시계열 데이터 분석 및 가공법을 공부할 것입니다. 공부한 내용을 바탕으로 실제 경제 데이터를 크롤링하여 직접 다뤄보고, 금융 포트폴리오를 작성할 것입니다. 이후에는 케라스와 텐서플로를 활용한 RNN, NLP 등의 머신러닝 알고리즘을 공부하여 금융 머신러닝을 구현해볼 것입니다. 그렇게 직접 구현한 머신러닝을 바탕으로 실전 트레이딩까지 응용하여 퀀트 투자 시스템까지 구현해보고 싶습니다. 아직은 꿈만 같은 이야기지만, 목표한 바는 꼭 이뤄내고 마는 저의 열정이라면 충분히 해낼 수 있을 거라 자부합니다.",
      "stacks":"ML, Python",
      "paths":"에브리타임",
      "portfolio":"https://sideways-lake-a8a.notion.site/7035d3bb81d740b086834b61dcd700cf, https://blog-501b-21207b.tistory.com/"
   },
   {
      "info":{
         "userId":0,
         "name":"주송아",
         "tel":"010-5178-5316",
         "email":"songah119@ewhain.net",
         "major":"사이버보안",
         "studentNum":"2071082",
         "isCore":0
      },
      "firstInput":"  저는 GDSC 커뮤니티를 통해서 지식을 심화시키는 능력과 프로젝트를 객관적으로 바라볼 수 있는 기회를 얻고싶습니다. \n  GDSC 커뮤니티는 다른 커뮤니티와 달리 개인이 아이디어 기획부터 개발까지 진행하는 능동적인 커뮤니티라고 알고 있습니다. 따라서, gdsc는 스스로 배우고 익힌 내용을 단순히 공부하고 복습하는 것에 그치지 않고 그 내용을 활용하여 어떠한 결과물을 도출하는 것 까지 내용을 심화시킬 수 있는 좋은 기회가 될 것 이라고 생각합니다. \n  프로젝트를 진행해보면서 아쉬웠던 점은 프로젝트의 결과를 타인과 공유하는 경험, 또는 평가받는 경험을 할 수 없다는 것이었습니다. 따라서, 저는 gdsc를 통해서 커뮤니티 멤버끼리 프로젝트의 진행상황, 결과물을 공유하면서 프로젝트를 객관적으로 바라볼 수 있는 기회를 얻고싶습니다. ",
      "secondInput":"제가 생각하는 커뮤니티란 개인 혼자 할 수 없는 일들을 커뮤니티원들과의 네트워킹을 통해서 가능하게 하는 곳이라고 생각합니다. 자신에게 부족한 것은 스스로 판단하여 공부를 할 수도 있고, 궁금한 점은 찾아 볼 수도 있지만 커뮤니티 처럼 남들과 이를 공유하고, 의논하는 것은 불가합니다. 또한, 커뮤니티를 통해서 자신과 같은 위치의 커뮤니티 원들의 이야기를 듣는 것은 자신의 프로젝트에 실력에 더 많은 발전을 가져올 수 있다고 생각합니다. 또한, 커뮤니티는 개인이 참여할 수 없는 커뮤니티안에 속한 여러 행사나 대회등을 제공하여 개인이 더욱 성장할 수 있는 기회를 만들어 줄 수 있다고 생각합니다.",
      "thirdInput":"제가 가장 열심히 참여했던 프로젝트는 <여성위생용품 성분분석 앱>을 기획 개발한 것입니다. 이 는 현재에도 진행중인 프로젝트로 웹을 먼저 제작 후 앱 제작을 목표에 두고 있습니다. \n이 프로젝트의 목적은 앱을 통해서 여성위생용품의 안정성 이슈를 개선하는 것이며, 앱을 통해 본인이 사용하고 있는 여성위생용품의 발암물질, 유해성분들을 검색할 수 있습니다. 또한, 앱의 사용자들은 상품에 대해 리뷰를 쓸 수 있고, 상품에대한 다른 사용자들의 리뷰 별점등을 확인하여 그 상품이 사용자들에게 미칠 수 있는 영향들을 확인할 수 있습니다.  또한, 월경달력을 앱의 또다른 프로그램으로 제공함으로써 한가지 앱에서 위생용품의 성분을 분석함과 동시에 월경 기간 또한 확인할 수 있습니다.  저는 이 프로젝트가 제 첫 프로젝트 였고 두명이서 진행중이기 때문에 기획, 프론트, 백 등 풀스택으로 참여하고 있습니다. ",
      "fourthInput":"저는 위에서 소개한 <여성위생용품 성분 분석 앱> 개발을 3월에는 기본적인 html, css, js, database 등을 3월에는 마무리 지을 예정입니다. 또한 4월에는 사용자의 데이터, 리뷰 기능을 완성하고 이를 활용하여 상품을 추천해 주는 기능까지 구현할 예정입니다. 또한, 5월에는 상품데이터나 성분데이터등을 구체화 또는 가능하다면 web crawling까지 진행할 수 있는 방안을 모색하고 싶습니다. 따라서 5월까지 기존에 하던 프로젝트를 마무리 지을 예정입니다. 또한, 그 활동이 마무리 되면 2022-1 학기에 학교에서 공부할 <악성코드 분석>과목의 내용을 심화시켜서 또다른 프로젝트를 하나 더 기획하여 진행하고 싶습니다. 아직 공부한 내용이 없기 때문에 두번째 프로젝트의 계획은 미정이나, WEB FUZZER를 제작해보고 싶습니다. ",
      "stacks":"Backend (node) , 보안분야(웹해킹, 리버싱 등)",
      "paths":"지인소개",
      "portfolio":"https://github.com/songah119"
   },
   {
      "info":{
         "userId":0,
         "name":"김민주",
         "tel":"01029477934",
         "email":"minjoo9903@naver.com",
         "major":"사이버보안전공",
         "studentNum":"1971100",
         "isCore":0
      },
      "firstInput":"저는 이제 막 개발자가 되겠다는 진로를 구체화하게 된 개발 초보자입니다. 프론트 엔드 개발자를 꿈꾸며 이번 겨울 방학 동안 공부를 했었습니다. 좋은 강의, 좋은 책, 공부 과정을 선택하기까지 아는 것과 정보가 많이 없어 오랜 시간이 걸려 아쉬웠습니다. 이화의 개발자를 꿈꾸며 스스로 성장하려는 사람들끼리 모여서 함께 자신만의 팁과 여러 정보를 공유하며 효율적으로 공부하면서 실력을 쌓아나가고 싶습니다. 또한, GDG 개발자와의 콘택트할 수 있는 기회를 통해 현직으로 계신 선배님들에게 개발자가 되기까지 어떤 노력을 해오셨고 어떤 시행착오 과정이 있으셨는지 실무에서 어떻게 프로젝트가 진행되는지 등 궁금한 것들을 물으며 배울 수 있는 소중한 기회를 얻고 싶습니다. 열정을 가지고 적극적으로 GDSC 활동에 참여하면서 상호 성장하는데 큰 보탬이 될 수 있는 사람이 되기 위해 노력하겠습니다. 이화 개발자 간의 네트워킹을 통해서 서로에게 자극이 되고 자극을 주며 개발자로 함께 성장하고 싶습니다.",
      "secondInput":"제가 생각하는 커뮤니티란 말 그대로 '사람들의 모임', '공동체'라고 생각합니다. 같은 목적이나, 뜻을 가져 공통점을 가진 사람들끼리 모여 그 목적이나 뜻을 이루기 위해 함께하며 노력하는 것입니다. 같은 목적이나 목표를 가진 사람들끼리 함께 모여있기 때문에 더 큰 효과를 가져온다고 생각합니다. 그 목적이 선하거나 좋거나 자신을 위해서라면 더욱 큰 시너지 효과가 발생할 것입니다.  특히, 타인을 위해 모인 것이 아닌 자기 자신의 성장, 발전을 위해 모인 사람들이라 더욱 적극적이고 능동적일 것이며 쉽게 목적이 변하지 않을 것입니다. GDSC Ewha 커뮤니티 또한 개발에 관심이 있는 사람들이 모였으며 개발자 네트워킹에 함께하고 싶고 개발자로 성장하고 싶다는 뚜렷한 목적이 있는 모임이라고 생각합니다. 저는 그 목표를 달성하기 위해 최선을 다해 참여하고 공부하고 성장하겠습니다.",
      "thirdInput":"수업 중 팀 프로젝트에서 일정 관리 역할을 수행하여 높은 성적으로 이끈 경험이 있습니다. 쓰레기를 감지하고 쓰레기장으로 모두 치운 후 차고지로 복귀하는 차를 만드는 프로젝트였습니다. 수업이 끝난 이후 모임을 가지려 하였으나 한 팀원이 시간 조정이 안 돼서 모임에 불참하는 경우가 자주 생겼습니다. 그 결과, 진행 상황이 파악이 안됐고, 계획을 세우지 않으면 제출 일에 가까워졌을 때 급하게 진행하다 만족하지 못한 채로 제출하게 될 것이라고 판단되었습니다. 팀원들과 상의 결과 그 팀원에게는 혼자 할 수 있는 업무를 주로 맡겼고 일주일 단위로 계획을 세워 진행 상황을 각자 SNS을 이용하여 알리기로 하였습니다. 저는 한 주간 각자 분담한 업무가 잘 진행되었는지 전체적으로 확인하고 정리하여 공지하고 팀원들에게 다음 주에 할 업무를 알리는 역할을 맡았습니다. 이를 통해 소통의 중요성에 대해 생각해 보게 되었고, 팀 활동에서 함께 코딩할 때 주의해야 할 점, 역할 분담 등을 알게 되었습니다.",
      "fourthInput":"우선, 프론트엔드 관련 스터디에 참여해 개발 지식을 키우고 싶습니다. 혼자 공부하는 것보다 함께 공부했을 때 자신이 놓쳤던 점을 다시 상기하고 몰랐던 점을 나누며 더욱 성장할 수 있다 생각합니다. \n두 번째로는 아파트 입주자들을 위한 반상회 웹 서비스에 대한 프로젝트를 하고 싶습니다. 웹 서비스를 통해 아파트 운영에 대해 아파트 주민 모두가 참여할 수 있고 안건을 내고 처리된 사항을 확인할 수 있는 웹을 만들고 싶습니다. 직접 프로젝트에 기획부터 하나하나 참여하여 아이디어를 구체화해가며 프로젝트가 어떻게 진행되는지 배울 수 있는 소중한 경험이 될 것이라고 생각하였습니다. 프로젝트를 모임에 소개하고 피드백을 요청해 피드백을 들으며 수정해가며 프로젝트 또한 더욱 완성도가 높아질 것이라 생각합니다. 저는 개발과 관련된 공부를 해왔지만 프로젝트 경험이 부족합니다. GDSC Ewha Member로 함께하며 부족한 점을 깨닫고 메꾸어가며 개발 능력을 향상시키고 스스로를 발전시켜가겠습니다. ",
      "stacks":"Front-end(spring), 파이썬",
      "paths":"에브리타임, 인스타그램",
      "portfolio":"https://blog.naver.com/minjoo9903"
   },
   {
      "info":{
         "userId":0,
         "name":"민경원",
         "tel":"01066192047",
         "email":"mkkw0207@ewhain.net",
         "major":"컴퓨터공학",
         "studentNum":"1976128",
         "isCore":0
      },
      "firstInput":" 학교 에브리타임에서 해커톤 대회,  모각코 등  GDSC Ewha에서 개최하는 다양한 행사 포스터를 봤었습니다. 그 행사 포스터를 볼 때마다 “재미있겠다.”, “나도 한번 참여하고 싶다.”라고 항상 생각하였습니다. 저학년 때는 아직 개발 실력을 갖추지 못하여 아쉽게도 지원하지 못하였지만 지금은 여러 프로젝트를 통해 실력을 키웠고 GDSC Ewha 활동에 기여를 할 수 있을 것이라고 자신합니다. GDSC Ewha에서 제가 하는 프로젝트에 대해서 발표하고 동아리원들과 함께 의견을 나누고 세미나를 통해서 여러 분야의 지식을 습득하며 제가 갖고 있는 전문성을 더욱 발전시키고자 합니다. 또한, 학교를 다니면서 개발자들끼리 모여서 개발 얘기를 하는 것이 어려웠는데 GDSC Ewha에서 이화 개발자 간 네트워킹에 활발하게 참여하고자 합니다. 그리고 GDG, GDE 개발자와의 만남과 세션 진행, 그리고 선배 초청 데이 등의 행사에 참여하여 저의 시야를 더 넓히고 싶습니다.",
      "secondInput":" 저는 커뮤니티는 상부상조하는 공동체라고 생각합니다. 특히, 그중에서 개발자 커뮤니티는  상부상조 성향이 두드러진다고 생각합니다. 예를 들어, 개발을 하다보니 자연스럽게 StackOverFlow의 글을 참고하게 될 일이 많았습니다. 이 사이트에는 정말 많은 질문과 도움요청 글이 있는데 그 수많은 글에도 높은 확률로 해결법이 담긴 댓글이나, ‘내가 해결해보려고 했는데 못했다. 미안하다’는 댓글을 볼 수 있었습니다. Github Issue도 비슷한 분위기였습니다. 이렇게 제가 경험했거나 봐온 개발자 커뮤니티에서는 ‘서로서로 도와주고 우리 같이 잘 해보자’ 이런 분위기가 강했습니다. 그간 GDSC Ewha의 활동을 보았을 때에도 동아리 부원 간 서로 협력하는 분위기를 느낄 수 있었습니다. 제가 GDSC Ewha의 Member가 되어 저도 다른 사람들과 협력하고, 다른사람들을 도와주고, 다른 사람들에게 새로운 지식을 알려주는 선한 영향력을 끼칠 수 있는 사람이 되고자 합니다.",
      "thirdInput":" 제가 가장 열심히 참여했던 프로젝트는 저번 학기에 빅데이터응용 강의를 수강하며 진행했던 프로젝트입니다. 이 프로젝트는 프론트엔드를 하는 친구 한 명과 함께 하였고, 제가 백엔드를 맡아 진행한 첫 프로젝트였습니다. 이 프로젝트는 고속도로 공공데이터를 이용하여 3개의 노선의 각각 3개의 휴게소(경부고속도로: 망향/안성/천안 삼거리 휴게소, 영동고속도로: 문막/평창/여주 휴게소, 호남고속도로: 여산/황전/벌곡 휴게소)의 인기 메뉴를 소개하는 웹사이트를 만드는 프로젝트였습니다. 5일 동안 50시간을 들여 프로젝트를 완성하였고 프로젝트 점수를 만점을 받으면서 성공적으로 마무리하였습니다. 이 프로젝트는 PHP로 백엔드를 구현해야했었습니다. 따라서 쿼리를 하나하나 다 작성하고 로직을 구체적으로 작성하면서 저의 백엔드 개발자로서 DB를 다루는 능력을 키울 수 있었고 프론트엔드와의 협업을 어떻게 하는지도 알게 되었습니다. 이 프로젝트를 통해 백엔드 개발자로서 첫 발을 내딛을 수 있었습니다.",
      "fourthInput":" 저는 GDSC Ewha에서 서버 사이드 렌더링에 집중한 프로젝트를 진행하고 싶습니다. 카카오톡/네이버 잔여 백신 시스템처럼 지도에서 확대 또는 축소 조작을 했을 때, 화면에 표시되는 것들이 달라지는 기능을 구현해보고 싶습니다. 예전부터 지도와 위치 정보를 활용한 서비스를 해보고 싶었는데 GDSC Ewha의 Member가 되어 이 프로젝트를 수행하고 다른 사람들에게도 이 기술에 대해 발표를 통해 알려드리고 싶습니다. GDSC Ewha의 도움을 받아 주제를 정하고 프로젝트 개발을 진행하면서 무박 2일동안 진행하는 해커톤에도 참여하여 팀원들끼리 협력하여 의미있는 결과물을 만들어내는 값진 경험을 할 계획입니다. 또한, 세미나를 통해 개발자로서 꼭 알아야하는 지식을 배워 저의 지식의 범위를 넓히고 개발자로서의 능력을 키우고자 합니다. 3개월간 개발에 집중하고 이후에는 일정기간 test와 유지보수, 보완을 거쳐 3-2기 활동을 마칠 때쯤에는 서비스를 완성하도록 할 계획입니다.",
      "stacks":"Backend(Spring)",
      "paths":"학교 에브리타임에서 행사 홍보 포스터를 보고 알게 되었습니다.",
      "portfolio":"노션: https://www.notion.so/e447466191a2408e822c7dc88b914b6e, 깃허브: https://github.com/mkwkw"
   },
   {
      "info":{
         "userId":0,
         "name":"김현수",
         "tel":"01076771072",
         "email":"kimhyunsu11@naver.com",
         "major":"컴퓨터공학",
         "studentNum":"2176113",
         "isCore":0
      },
      "firstInput":"저는 GDSC가 웹 프론트엔드 지식을 포함한 다방면에서의 개발 지식을 고루 갖춘 개발자로 성장하게 해주는 절호의 기회라고 생각해 지원하게 되었습니다. 이번 겨울 방학동안 html과 css, js 를 공부하고 개인 프로젝트를 진행하면서 프론트엔드와 백엔드 등 기본적인 웹 지식만으로는 고부가가치를 가진 웹을 만들기에 한계가 있다는 생각을 하게 되었습니다. 대신 데이터 분석, 머신러닝 등 웹의 생산성을 높일 수 있는 다양한 기술들을 종합적으로 웹에 적용하면 보다 더 큰 가치를 창출하는 웹이 될 수 있을 것이라 생각하게 되었습니다.  이에 이제는 프론트엔드뿐만 아니라 다른 개발 기술들 또한 프론트엔드 개발자라면 필수적으로 갖추어야 할 역량이며 해당 분야의 개발자와 소통하는 방법을 잘 알고 있어야 한다고 생각하게 되었습니다. GDSC에서는 다양한 분야의 개발자분들과 만나 소통하며 교류할 수 있고 세션을 통해 여러 개발 분야의 지식을 습득할 수 있을 것이라는 믿음과 기대로 지원하게 되었습니다.",
      "secondInput":"커뮤니티란 서로 성장하는 것을 도우려는 사람들의 모임이라고 생각합니다. 개인 프로젝트를 진행하면서 모르는 것이 생겼을 때 스택 오버 플로우 등 개발 커뮤니티의 도움을 받아 에러를 해결할 수 있었습니다. 제가 완성한 프로젝트를 개발 커뮤니티에 업로드해서 다른 분들의 피드백을 받았을 때는 이를 참고해 훨씬 더 완성도 높은 프로젝트를 빌드할 수 있었습니다. 피드백과 칭찬을 받으면서 생긴 긍정적인 경험을 다른 분들도 같이 공유했으면 좋겠다는 생각은 다른 분들의 프로젝트에 피드백을 남기는 동기가 되었습니다. 피드백을 할 때 다른 분들의 코드를 보며 좋은 점은 본받을 점으로 정리하고 보완이 필요하다고 생각되는 부분은 답변을 남기면서 공부했던 부분의 복습 효과를 볼 수 있었습니다. 이러한 개발 커뮤니티 경험을 통해 사람들이 모여 서로에게 도움을 받고 또 때로는 도움을 줌으로써 혼자였다면 얻을 수 없었을 시너지 효과를 얻을 수 있는 긍정적인 기능을 하는 것이 커뮤니티라고 생각하게 되었습니다.",
      "thirdInput":"가장 열심히 참여했던 프로젝트는 문제해결까지 시간이 가장 오래 걸린 excursion입니다. excursion 프로젝트는 video태그의 autoplay가 크롬에서는 muted 옵션을 추가해주지 않으면 영상 자동재생이 되지 않는 문제가 있었습니다. 처음에는 늘 그랬듯 코드 자체에 문제가 있다고만 생각했습니다. 그러나 아무리 코드를 고쳐보고 구글링을 해 보아도 문제를 찾을 수 없었습니다. 브라우저가 크롬이어서 문제가 생겼을 것이라는 생각을 해 보지 않았기 때문이었습니다. 이때 controls를 추가하였을 때 영상이 수동재생되는 것을 확인할 수 있었고 autoplay가 문제의 원인이라는 것을 찾을 수 있었습니다. autoplay의 재생 문제를 구글링해 보았을 때 브라우저에 따라 지원되지 않는 속성들이 있을 수 있다는 사실을 처음으로 알게되었고 이후 쉽게 해결되지 않는 문제는 코드 차원만 아니라 브라우저를 비롯해 여러 차원에서 고민해야 한다는 소중한 깨달음을 얻을 수 있었습니다.",
      "fourthInput":"여름방학이 되기 전까지 html, css, js, react와 통계청의 지역별 기온 및 강수량 현황 데이터를 이용한 기후 변화 관심 제고 웹을 만드는 것을 개인적인 목표로 삼고 있습니다. 6개월간 GDSC이화에서 이를 주제로 개인 프로젝트를 진행하고 싶습니다. 이 과정에서 프론트엔드에 관심이 있는 분들과 리액트 스터디를 진행하며 교류하고 프로젝트를 완성한 후에는 정규 세션에서 프로젝트 발표를 통해 배운 것을 함께 정리하고 공유하고 싶습니다. 특히 지난 겨울방학동안 개인적으로 개발 공부를 하면서 손글씨로 개발 지식을 정리하고, 유용한 해외 개발 정보 사이트를 많이 알게 되었습니다. 정규 세션을 통해 프로젝트의 결과물뿐만 아니라 이 사이트들과 손글씨로 개발을 공부하고 프로젝트를 완성하게 된 과정을 꼭 이화의 개발자분들과 공유하고 싶습니다. 이렇게 해서 완성한 프로젝트는 솔루션 챌린지에 활용하여 데이터 분석을 담당하시는 멤버분과 climate action 부문으로 함께 참여하고 싶습니다.",
      "stacks":"Frontend(Js, React)",
      "paths":"에브리타임과 인스타그램으로 알게 되었습니다!",
      "portfolio":"https://github.com/borimong"
   },
   {
      "info":{
         "userId":0,
         "name":"조현영",
         "tel":"01032349278",
         "email":"joayoung3@gmail.com",
         "major":"컴퓨터공학",
         "studentNum":"2076394",
         "isCore":0
      },
      "firstInput":"다양한 개발 분야의 전문성을 가진 멤버 분들의 스피치를 통해 자극을 받고 더 성장할 수 있을 것 같아서 지원하게 되었습니다. 여러 분야에서 각자 최선을 다하는 모습을 보고 같이 발전하고 싶습니다. 그리고 멤버 분들의 멋진 스피치만큼의 스피치를 해내야겠다는 책임감이 스스로 성장해야 하는 이유가 되어서 더 빠르게 성장할 수 있는 계기가 될 것 같았습니다. 프로젝트를 누군가에게 소개한다면 더 좋은 결과물을 만들 수 있게 될 것 같았고, 수업이 비대면인 상황에서 같은 관심사를 가진 분들과 네트워킹할 수 있는 기회를 찾고 싶어서 지원했습니다. GDSC 커뮤니티는 이화여대 뿐만 아니라 전 세계의 학생들이 참여하는 커뮤니티라는 것을 보고 더 체계적이고 의미 있는 활동들로 이루어져 있는 것 같아 꼭 참여하고 싶었습니다. \n",
      "secondInput":"다른 구성원에게 도움이 되어 어떤 구성원이 성장했을 때 그로 인해 그룹 전체가 성장한다는 것을 모두가 알고 있는 그룹이 좋은 커뮤니티인 것 같습니다. 남들보다 더 잘하고자 경쟁을 하겠다는 의식보다는 더 잘해서 구성원들의 발전에 기여하겠다는 마음을 갖고 있는 사람들의 모임이 좋은 커뮤니티라고 생각합니다. 좋은 커뮤니티에는 커뮤니티 내의 규율이 명확하고 그 규율을 잘 지키려는 책임감 있는 사람들의 노력이 필요하다고 생각합니다. ",
      "thirdInput":"오픈SW플랫폼 수업에서 React-Native로 일정 관리 앱을 만들었던 프로젝트에 참여했습니다. Javascript를 모르는 상태에서 시작한 프로젝트라 수업에서 주어진 메인 화면에 추가적인 기능들을 더해가는 방식으로 진행했습니다. 객체들을 추가하고, 삭제하고, 내비게이션을 더하고 로컬 저장소에 저장하는 모든 과정을 구글 검색으로 배우면서 진행해서 서툰 코드가 대부분이었지만 어떻게든 하면 된다는 것을 배우게 되었던 프로젝트였습니다. 시간을 더 투자해서 많은 기능을 넣어볼 수 있었다면 좋았겠다는 후회가 남았어서, 더 발전된 코드로 웹 서비스를 만들어보고 싶다는 생각을 하게 되었습니다. ",
      "fourthInput":" 목표를 설정하고 달성할 수 있도록 도와주는 웹 서비스를 만들고 싶습니다. 사용자가 장기 목표를 설정하면 장기 목표를 구체적인 목표 8개로 나눠 작성을 받고, 계단, 나무, 그래프 등 다양한 형식의 UI를 선택해 각 목표의 진행 상황을 보여줘서 목표 달성을 돕는 서비스를 진행해 보고 싶습니다. 3월 한 달 동안 서비스 기능을 기획하고 프런트엔드를 제작한 뒤 4, 5월에 백앤드 기능을 구현하고, 6월 한 달 동안 피드백을 받아서 기능을 수정하거나 추가하겠습니다. ",
      "stacks":"Backend(Java)",
      "paths":"과 단톡방",
      "portfolio":"https://github.com/aqswa"
   },
   {
      "info":{
         "userId":0,
         "name":"안채연",
         "tel":"01041142393",
         "email":"dkscodus1204@naver.com",
         "major":"컴퓨터공학",
         "studentNum":"2076232",
         "isCore":0
      },
      "firstInput":"GDSC 활동을 통해 얻고 싶은 것은 여러 분야를 공부하고 접할 수 있는 기회, 함께 공부하고 같은 주제로 대화와 마음을 나눌 수 있는 멤버들과의 네트워킹 이 두 가지입니다. 프론트엔드, 보안, 인공지능 등 IT와 관련된 분야는 너무 다양하고, 앞으로의 제 진로를 탐색하기 위해 여러 분야를 접해봐야겠다라는 생각이 들어 유튜브나 강의를 찾으며 공부하였습니다. 하지만 많은 분야를 혼자 탐색하고 공부하기에 막막함과 한계가 있었고 이 어려움을 해결하는데 GDSC 활동이 꼭 필요하다고 생각했습니다. GDSC에서 진행하는 다양한 주제의 세미나를 듣고 스터디, 프로젝트 활동을 통해 공부하며 제가 느꼈던 막막함을 해소하고 개발자로서의 미래를 구체적으로 생각할 기회를 갖고 싶습니다. 또, 혼자라서 어려웠던 것들을 함께 고민하고 서로에게 동기부여, 도움을 주고받는 이화 개발자 간 네트워크 활동을 함께 이어나가고 싶어 지원하게 되었습니다.",
      "secondInput":"커뮤니티는 같은 소속감을 느끼는 다양한 사람들이 서로의 생각을 접하고 대화를 나눌 수 있는 심리적 공동체이자 작은 사회라고 생각합니다. 학교 커뮤니티를 예로 들자면, 커뮤니티는 같은 학교에 소속한 학생들이 친구를 구하기도 하고 각자의 고민을 말하기도 하고 도움을 주고받기도 하는 학생들만의 사회이자 심리적으로 나눌 수 있는 공간입니다. 저는 이런 공간, 공동체 안에서 많은 사람과 생각을 나누고 공유할 수 있다는 것이 커뮤니티의 장점이라고 생각합니다. GDSC도 이화 개발자 커뮤니티로써, 비슷한 미래를 꿈꾸고 있는 학교 학생들끼리 비슷한 주제로 고민하고, 공유할 수 있다는 것이 너무 큰 장점이라고 생각합니다. 혼자 생각하기에 해결되지 않고 막막한 것들이 있을 수 있습니다. 진로에 대한 고민, 생활에 관한 고민 등 혼자 해결하기에 어려운 것들을 GDSC를 통해 해결할 수 있고, GDSC를 통해 개발자로서 공유하고, 네트워킹을 함께 할 수 있다는 것에 큰 의미가 있다고 생각합니다.",
      "thirdInput":"개발자로서 열심히 참여했던 프로젝트는 학교 수업에서 진행했던 리액트 네이티브를 이용한 ‘TodoList App’ 개발입니다. 당시 html,css의 기본적인 문법만 공부한 상태였고, 리액트에 관해서는 아무것도 몰라 어려움을 겪었습니다. 하지만 스스로 신청한 수업인 만큼 해내고 싶다는 생각에 자바스크립트, 리액트에 관한 인프런 강의를 찾아 듣고 맡은 기능을 구현하기 위해 밤을 새워가며 공부했었습니다. 결론적으로 개발을 완성할 수 있었고 프로젝트에서 공부한 것을 바탕으로 방학에 리액트를 더 본격적으로 공부하고 스스로 웹페이지를 개발할 수 있게끔 하는 발판이 되었습니다. 또 기획자로서 참여했던 문화기획동아리의 ‘라디오’ 프로젝트는 진행 과정 중 어려움은 없었지만 대학 입학 후 처음 진행했던 프로젝트인 만큼 열정적으로 참여했습니다. 당시 저의 모습, 열정은 새로운 도전 앞에서 망설이는 저에게 할 수 있게끔 용기를 주는 프로젝트입니다. ",
      "fourthInput":"우선 세미나를 통해 여러 분야를 접하고 이를 기반으로 프로젝트 진행 방향과 더불어 개발자로서 제 미래까지 바라보고 싶습니다. 공부하는 과정에서 흥미롭거나 깊게 알고 싶은 분야가 생기면 주 2회 이상 공부하고 개인 티스토리에 정리하는 등 관련 스터디를 진행하고 프로젝트까지 진행할 예정입니다. 현재까지는 프론트엔드 개발을 공부하고 있지만 백엔드 분야도 배워보고 싶다는 생각이 들어 백엔드 관련 스터디에 참여하는 등 좀 더 다양한 분야로 공부를 하고 싶습니다. 기술적인 능력 향상 뿐 아니라 평소 발표 부분에서 소극적이고 약했던 부분을 개발 과정 스피치를 통해 극복하고 보완할 예정입니다. 또한 멤버간의 소모임, 액티비티 등 멤버 간 네트워킹을 할 수 있는 다양한 활동에 참여하여 이화 개발자로서 원활한 네트워킹에 참여할 것입니다. 단지 일시적인 네트워킹이 아닌 지속적인 네트워킹을 하고자 GDSC 멤버로서 적극적으로 참여하고 활동할 것입니다.",
      "stacks":"Frontend(React), Backend(Spring)",
      "paths":"지인 소개, 에브리 타임",
      "portfolio":"https://github.com/chaeyeonan, https://12yeonii.tistory.com/"
   },
   {
      "info":{
         "userId":0,
         "name":"이진경",
         "tel":"010-5030-9819",
         "email":"lkh4317@naver.com",
         "major":"컴퓨터공학과",
         "studentNum":"1971039",
         "isCore":0
      },
      "firstInput":"컴퓨터공학과에 진학하고 나서, 전공수업에서 과제를 하며 코딩의 즐거움을 느꼈습니다. 하지만 개발 공부는 어떻게 해야 하는지 막막했습니다. 주변에 조언을 구해보니, 개발자가 되기 위해서는 일단 프로젝트를 해봐야 한다는 말을 많이 들었습니다. 하지만 저는 스스로가 할 줄 아는 것이 별로 없다고 생각해서 동아리나 프로젝트 지원을 미뤄왔습니다. 이후 개인적으로 강의를 듣기도 했지만 혼자 공부를 하니 제대로 끝마치기가 어려웠습니다. GDSC에 들어가면 중간에 그만두거나 대충 공부할 수 없다는 약간의 강제성이 저를 늘어지지 않게 할 것이라고 생각합니다. 또한 저 혼자 공부하는 것이 아니라 다른 멤버들과 함께 공부할 수 있기 때문에, 더더욱 시간을 많이 투자하고 집중할 수 있을 것입니다. 코로나로 인해 학교를 가지 않았었기 때문에 같은 고민을 가지고 있는 사람들을 만날 일이 적었습니다. GDSC에 들어가면 다른 멤버들과 고민도 나누고, 아이디어를 모아 개발도 하면서 같이 성장해 나가고 싶습니다.",
      "secondInput":"비슷한 관심사를 가진 사람들이 모여 자유롭게 소통할 수 있는 곳이 커뮤니티입니다. 공부만 열심히 하면 됐던 고등학교까지의 삶에 비해, 대학생이 되면 접하게 되는 세계가 넓어지고, 자율성과 선택지가 늘어나게 됩니다. 더불어 취업이나 대학원으로의 진학 등, 미래에 대한 걱정과 고민이 많아집니다. 이런 상황에서 학생들은 자신과 같은 고민을 가진 친구들과 대화를 하며 불안함을 해소하고 같이 성장해 나갈 수 있다고 생각합니다. 하지만 학교에 다니며 같은 과 친구들을 만날 수 있던 과거와 달리, 코로나로 인해 지금은 학생들이 쉽게 다른 친구들을 사귀기가 어렵습니다. 저 또한 친구를 사귀기 어렵다고 느꼈기 때문에 사람을 만날 수 있는 모임에 지원하고 있습니다. 저는 GDSC와 같은 커뮤니티를 통해 편안한 분위기에서 자유롭게 모르는 것을 질문하고 정보를 공유할 수 있는 친구들을 만나고 싶습니다. 서로가 서로에게 도움이 되고 같이 발전해 나가는 관계를 이룰 수 있는 커뮤니티에 소속되고 싶습니다.",
      "thirdInput":"오픈SW플랫폼 수업에서 프로젝트를 했었습니다. 저희 팀은 강의평가만으로는 수업 파악이 어렵다고 생각하여 Lecture Story라는 웹을 만들었습니다. 저희 서비스는 에타와 비슷하지만, 강의별로 게시판이 나누어져 있어, 특정 과목을 수강할 학생들에게 이전 수강생들의 경험을 전할 수 있다는 특징이 있습니다. 이 프로젝트는 각자 페이지를 나누어 1주일 동안 온라인으로 모각코를 하듯이 개발했습니다. 개발 중간에 회원가입 메일 인증 부분에서 막혀 다른 팀원이 해결하기도 하고, 제가 다른 페이지로 넘어갈 때 데이터를 저장하는 방법을 찾아서 문제를 해결하기도 하는 등, 팀원들과 서로 막히는 부분을 도와가며 코딩을 했더니 포기하지 않고 개발을 마칠 수 있었습니다. 오히려 혼자였다면 절대 완성하지 못했을 것이라고 생각합니다. 이 프로젝트를 통해, 기획이 명확할수록 개발이 편해진다는 것을 느꼈고, 문제가 있으면 계속 붙잡고 있는 것이 아니라 빨리 도움을 요청하는 것이 낫다는 것을 알게 되었습니다.",
      "fourthInput":"아직 별로 아는 것이 없어, 프론트엔드와 백엔드 중에 무엇이 저에게 맞을지 정하지 못했습니다. 활동을 하며 두 분야에 대해 공부해 보고 싶습니다. GDSC 팀 블로그를 보니 스터디를 만들어서 같이 공부할 수 있는 것 같았습니다. 저도 웹 개발 스터디를 만들어서 다른 부원들과 함께 공부하고 싶습니다. 혼자 공부하는 것과 달리 여러 사람과 함께 활동하기 때문에, 절대 미룰 수가 없을 것 같습니다. 해보고 싶은 프로젝트로는 병원 리뷰 웹사이트가 있습니다. 코로나가 없었던 19년도 에타를 보면 종종 병원에 대한 질문이 올라왔었습니다. 과잉진료는 없는지, 진료비는 어느 정도였는지 등에 대한 정보를 묻는 글들이 많았습니다. 비슷한 질문들이 여러 번 올라오는 것을 보니, 이런 질문과 답이 모여있으면 나중에 정보를 찾기 편하겠다는 생각을 했습니다. 그래서 학교 근처 병원 리뷰 사이트를 만들어 각각의 병원에 대한 리뷰를 남길 수 있도록 하는 서비스를 구현해 보고 싶습니다.",
      "stacks":"Frontend",
      "paths":"에브리타임 게시글",
      "portfolio":"github: https://github.com/dooli1971039 , 기술블로그: https://gyong0117.tistory.com/"
   },
   {
      "info":{
         "userId":0,
         "name":"고가형",
         "tel":"010-9855-7377",
         "email":"ewggh20202000@ewhain.net",
         "major":"컴퓨터공학과",
         "studentNum":"2076010",
         "isCore":0
      },
      "firstInput":"안녕하세요. 저는 컴퓨터공학과 20학번 고가형입니다. 코로나 시대에 이화에 입학하게 되면서 개발하는 다른 사람들과 교류하는 작업을 많이 하지는 못했습니다. 그러면서 자연스럽게 2-1 때까지 그저 수업을 따라가는 수준인 안주하는 공부를 해왔습니다. 그러다가 저번 2-2때 좋은 팀원들과 개발은 아니지만 프로젝트를 해 볼 수 있는 기회가 생겼고 저에게 앞으로 다양한 활동을 하고자 하는 마음을 잡게 해주는 계기가 되었습니다. 그래서 이번에 기획부터 개발까지 전부 경험할 수 있을뿐만 아니라 다른 부원들과 다양한 스터디와 소모임을 할 수 있는 GDSC에 지원하게 되었습니다. 또, 지인이 GDSC에서 활동 중인데 그 지인이 동아리 활동을 하면서 성장하는 모습을 보고 저도 GDSC를 통해 제 개발 실력을 성장시키고 발전하는 계기가 되었으면 좋겠다고 생각했습니다. 그러면서 같은 분야에 흥미 있는 멤버들과 서로의 고민과 경험을 공유하며 앞으로도 의지할 수 있는 돈독한 존재가 되고 싶다고 생각했습니다.",
      "secondInput":"커뮤니티의 사전적 의미는 공동체입니다. 하지만 제가 생각하는 GDSC의 커뮤니티는 단순한 의미에 그치지 않고 긍정적인 영향을 주고 받는 것에 초점을 두고 있다고 생각합니다. 커뮤니티가 가지는 긍정적인 첫번째 의미로는 '상부상조'가 있다고 생각합니다. 프로젝트를 진행하다보면 혼자서는 하기 힘든 일들이 많은데 다른 관심사들의 멤버들이 서로 도와 하나의 프로젝트를 완성해내가는 과정 자체가 '상부상조'를 뜻한다고 생각합니다. 또, 개발이라는 공통된 관심사로 모인만큼 서로가 서로에게 고민을 들어주고 조언해줄 수 있는 '상부상조'의 면모 또한 존재한다고 생각합니다.두 번째로는 '경험'이라고 생각합니다.보통 혼자 생활하다보면 자신만의 루틴이나 시각에 갇히기 쉽다고 생각합니다. 하지만 커뮤니티에서는 혼자서 하기 힘든 경험을 다른 사람을 통해 하기도 하고 제가 관심 없었던 혹은 안 맞을 거라고 생각했던 분야에 대해 접할 수 있는 다양한 기회가 주어진다는 점이 커뮤니티에서 쌓는 경험이라고 생각합니다.",
      "thirdInput":"저번 학기에 사용자 경험을 바탕으로 시장에 나와있는 모바일앱의 UI를 개선하는 프로젝트를 진행했었습니다. 비록 직접적인 개발 경험은 아니지만 프론트엔드 개발에 있어서 어떤 부분을 집중적으로 살펴보고 구현해야 하는지 알 수 있는 중요한 계기가 되었다고 생각합니다. 팀원들과 처음 프로젝트를 진행하면서 여러가지 시행착오에 부딪혔었습니다. 서로 소통에 오류가 있어서 중간에 테스트를 다시 했던 적도 있기도 했고 최종 발표날 밤샘을 하며 마감했던 기억이 있습니다. 그 중에 기억에 남는 건 시험기간에 지친 팀원들과 개선안을 도출했던 경험이었습니다. 프로젝트를 진행하면서 항상 잘 맞아왔던 팀원들이었지만 힘들 땐 모두 예민해질 수 밖에 없고 그렇기에 서로 배려하고 맞춰가는 과정이 필요하다는 걸 깨닫게 되었습니다. 며칠 뒤에 있던 최종 발표를 무사히 마무리하고 나서 당시에는 힘들었지만 오히려 그런 기억이 있었기에 팀원들과 더 돈독해지고 발전해나갈 수 있는 기회가 아니었을까하는 생각이 들었습니다. ",
      "fourthInput":"제가 아직 프로젝트 경험이 부족하기 때문에 능력이 가능한 선에서 많은 스터디를 들어보고 싶습니다.다양한 분야의 멤버들의 의견을 들으면서 제가 가장 잘하는, 가장 잘 맞는 개발 분야를 찾는 것이 저의 가장 큰 목표입니다.그리고 공통된 관심사를 가지고 있는 멤버들과 개발하는 과정에서의 고민과 의견을 나누며 좋은 관계를 만드는 것 또한 GDSC 활동의 목표입니다.개인 프로젝트로 제가 생각해 본 프로젝트는 HTML,CSS,JavaScript를 활용한 '지구 키우기' 입니다.최근에 UN에서 2050년에 지구 온도가 2도 상승한다는 논문을 내놓아 환경문제에 대한 관심이 증가했다는 기사를 보았습니다.따라서 환경 보호의 중요성을 다른 사람들에게도 알리는 취지로 '지구 키우기'라는 웹사이트를 구상해보았습니다.선택지를 고르는 거에 따라 30년 뒤에 지구의 모습이 결정되는 형식의 테스트를 구현하는 것이 최종 목표입니다.전체적인 테스트는 HTML와 CSS, 결과는 JavaScript로 구현할 계획입니다.",
      "stacks":"Frontend(JavaScript,HTML)",
      "paths":"현재 GDSC에서 활동하고 있는 지인이 있어서 먼저 알게 되었습니다. 동아리 활동을 하면서 성장하는 지인의 모습을 옆에서 지켜보다보니 저도 GDSC에서 함께 활동하고 싶다는 생각이 들어 지원하게 됐습니다!",
      "portfolio":"현재 뚜렷한 프로젝트 경험이 없어서 포트폴리오가 없습니다. GDSC에서 저의 포트폴리오를 채워 나가고 싶습니다!"
   },
   {
      "info":{
         "userId":0,
         "name":"이혜빈",
         "tel":"01029664227",
         "email":"porori0703@ewhain.net",
         "major":"초등교육과 (컴퓨터공학 복수전공)",
         "studentNum":"1737035",
         "isCore":0
      },
      "firstInput":"저는 3학년 2학기에 뒤늦게 컴퓨터공학 복수전공을 결심하고 개발에 관심을 갖게 되었습니다. 주변에 개발을 하거나 관심있어하는 사람이 없었기에 제 주된 관심사를 함께 나누고 고민할 수 있는 친구가 없다는 것에 늘 외로움과 아쉬움을 느끼고 있었습니다. 뿐만 아니라 워낙 영역이 방대하고 많은 개발 세계에서 지인 없이 저 혼자 개인프로젝트를 개발하기까지 많은 어려움과 고충이 있었습니다. 개발영역은 유독 정보가 방대하기 때문에 그만큼 더 커뮤니티의 필요성을 느끼기도 했습니다. 뒤늦게 본격적인 개발에 접어들면서 저같이 방황하고 고민이 많은 사람의 고민을 나누고 함께 공유하고 싶었고 같은 목표를 가진 사람들과 서로 긍정적인 자극과 도움이 되고 싶었습니다. GDSC 커뮤니티 활동을 통해 저는 단순히 학부 시절 동아리 같은 일회적인 개발 동료가 아니라 오랜 기간동안 같은 관심과 고민을 가지고 함께 성장하며 위로가 되어주는 친구를 많이 만나고 싶습니다. ",
      "secondInput":"커뮤니티란 함께 성장하는 것이라고 생각합니다. 성장에는 두 가지가 필요합니다.  발전할 시기의 추진력과 주춤할 시기의 지지입니다. 제가 생각하는 커뮤니티의 의미는 서로 도움으로써 발전해가고 서로 의지하며 위로와 힘이 되어주는 것에 있습니다. 컴퓨터공학 전공이 아니던 제가 개발에 관심을 갖게 된 계기도 여기에 있었습니다.  저는 정보를 타인과 공유하며 성장해나가는 개발 문화를 가장 좋아합니다.  좋은 커뮤니티란 상대적인 기준으로 타인과 경쟁하는 것이 아닌 절대적 목표와 가치를 위해 함께 성장하는 커뮤니티라고 생각합니다. 직접 마주한 오류나 고민을 타인과 공유하며 해결해나가고 발전해 가는 것은 단순히 기술적인 성장에만 의미가 있는 것을 넘어 사회적 정서적 의미도 있습니다. 따라서 저는 상호 긍정적인 자극과 활발한 정보 공유, 지원, 그리고 집단 지성을 활용하여 개인과 집단의 발전에 추진력을 주고 동시에 함께 고민을 나누며 정서적 지지가 되어주는 것이 커뮤니티의 의미라고 생각합니다. ",
      "thirdInput":"제가 가장 열심히 참여했던 프로젝트는 현재 진행중인 KnockKnock이라는 개인프로젝트입니다. KnockKnock은 위치기반 서비스를 활용하여 실시간으로 인근 유저들과 정보를 주고받고 그와 더불어 얻는 포인트를 화폐화 하여 정보를 거래하는 서비스입니다. 백엔드 개발 프레임워크와 기술에 대한 전반적인 공부를 마친 후 본격적으로 돌입한 첫 토이프로젝트이지만 배포와 출시까지 할 예정이며 실제로 AWS의 rds와 ec2 활용부터 Nginx를 활용한 무중단 배포까지 진행해 본 상태입니다. Springboot 프레임워크의 핵심 기술인 IoC, AOP, MVC구조를 적용하고 JPA를 활용해서 서버를 구현하고 있습니다. 또한 안드로이드 스튜디오를 활용하여 앱개발을 진행중이며 Rest API 를 바탕으로 서버와 클라이언트가 http 통신 하고 서버와 클라이언트 모두 JAVA 언어 기반으로 구현 중이라 프로젝트 전반에 객체 지향적 패턴을 적용하여 개발하고자 노력하고 있습니다. ",
      "fourthInput":"저는 GDSC에 가입하여 제가 다룰 줄 아는 Springboot의 기본적인 활용, JPA, AWS 관련하여 다른 멤버들에게 도움이 되고 싶습니다.  제가 알고 있던 내용을 더욱 공고히 하고 정리할 수 있고 타인에게 도움이 된다는 보람과 기쁨도 느끼고 싶습니다.  비대면 모임이 많은 코로나 상황을 고려하여 저는 제 기술블로그나 github을 적극 활용하고 공유하여 정보와 배움을 나누는 가치를 얻고 나아가 기회가 된다면 해당 내용에 대한 간단한 발표나 세미나까지도 하고 싶습니다. 또한 이제 단순히 원하는 기본 기능을 구현해보는 것을 넘어서 클린코드를 작성하는 연습, 객체 지향적으로 코드를 짜는 방법 들을 가능하면 여러 멤버들과 함께 고민하고 지속적인 상호 코드리뷰를 통해 개인프로젝트를 진행하더라도 그룹프로젝트 이상의 성취와 가치를 얻을 수 있도록 하고 싶습니다. 함께 리팩토링, 클린코드 등의 책을 공부하고 코드리뷰도 하는 스터디도 할 수 있다면 하고 싶습니다. ",
      "stacks":"Backend(Java,JPA,rdb,Springboot), Cloud Computing(AWS), AndroidStudio ",
      "paths":"에브리타임 공대게시판",
      "portfolio":"https://github.com/eeHeaven , https://velog.io/@eeheaven"
   },
   {
      "info":{
         "userId":0,
         "name":"박채린",
         "tel":"01064367017",
         "email":"chrpark11@ewhain.net",
         "major":"수학과",
         "studentNum":"1928016",
         "isCore":0
      },
      "firstInput":" 첫째로, 개발자 동기들을 만나고 함께 성장하고 싶습니다. 저는 사람들 사이에 있을 때 가장 뛰어난 기량을 발휘하는데, 다양한 아이디어를 가진 사람들과 접하는 것 자체가 저에게 강한 자극이 되기 때문입니다. 그러나 오랜 비대면 수업으로 인해 물리적, 정신적으로 고립되어 활발한 아이디어 소통과 프로젝트 활동이 쉽지 않았습니다. GDSC를 통해 cs의 각종 분야에서 활동하는 동기 개발자들을 적극적으로 만나고 서로에게 아이디어와 자극이 되고 싶습니다. 또 관심분야가 비슷한 사람들이 있다면 함께 프로젝트를 진행하고 해커톤에도 참여하며 시너지를 내는 관계를 만들고 싶습니다.\n 둘째로, 구글과 관련된 정보나 선배들의 이야기를 듣고 싶습니다. 저는 오래전부터 구글에 입사하는 것이 꿈이었는데, GDSC의 선배 초청 세미나와 같은 활동이 저에게 큰 도움이 될 것입니다. 이 뿐만 아니라 진행되는 모든 GDSC 활동에 적극적으로 참여하여 많은 정보를 얻어가고, 많은 지식을 나누는 멤버가 되고싶습니다.",
      "secondInput":"제가 생각하는 커뮤니티는 ‘불타는 거미줄’입니다. 기본적으로 어떤 모임 안에서는 거미줄과 같이 서로 영향을 주는 관계가 형성되어 있습니다. 그러나 서로 관계가 있고 모이기만 한다고 해서 진정한 의미의 커뮤니티가 만들어지지는 않는다고 생각합니다. 건강한 커뮤니티는 서로 긍정적인 무언가를 활발하게 주고받으며 시너지를 내고, 함께 성장하는 것이 필요합니다. 그래서 저는 커뮤니티의 불타는 분위기가 중요하다고 생각합니다. 분위기에 따라 멤버들이 자신의 생각과 기술을 주고 받는 행위가 억제될 수도, 촉진될 수도 있기 때문입니다. 또한 멤버 자신의 실력을 키우는 측면에서도 주변 분위기가 영향을 미칠 수 있습니다. 저는 커뮤니티 내에서 한명의 긍정적인 공기가 되어 다른 멤버들의 활동과 성장을 촉진시키는 데에 기여하고 싶습니다. 열정적인 분위기 속에서 서로가 생각하지 못한 점을 보완하면서, 기술적인 능력은 더해지고, 아이디어는 증폭될 수 있을 것입니다.",
      "thirdInput":"과 동아리 팀원들과 1년간 딥러닝에 대해 공부하고 데이콘 ‘농산물 가격 예측 AI 경진대회’에 참여한 것이 가장 기억에 남습니다. 관련 지식에 아무런 베이스가 없는 친구들끼리 만나 공모전에 나가는 것을 목표로 같이 공부할 커리큘럼을 짜고 매주 모이며 적극적으로 활동했습니다. 1학기에는 cs231n 수업을 들으며 기초를 쌓았는데, 팀원별로 각 챕터를 맡아 매주 내용설명 및 과제코딩을 책임졌고, 2학기에는 시계열데이터 책을 스터디하며 경진대회를 준비했습니다. 대회 제출용 코드를 작성할 때 저는 적합한 하이퍼파라미터를 설정하고 모델층을 쌓는 부분을 담당했는데, 많은 시도 끝에 loss 값이 가장 작은 효율적인 모델을 만들 수 있었고 기대한 것 이상의 성적으로 대회를 마무리 할 수 있었습니다. \n독학으로 배우는 길은 막막해보였지만, 주변의 좋은 조언과 정보를 공유할 멤버가 있다면 더 효율적인 공부를 할 수 있다는 것을 느꼈습니다.",
      "fourthInput":" 첫째로, 그림체 및 스토리 분석을 통한 사용자별 웹툰 추천 시스템을 만드는 프로젝트를 진행하고 싶습니다. 저는 11년째 웹툰을 보고 있는데, 제 취향의 웹툰을 하나하나 찾는 데에 오랜 시간이 걸려 불편함을 느껴왔고, 점점 커지는 웹툰 시장에서 저와 같은 불편을 느끼는 소비자가 많을 것이라고 예상합니다. 그동안 공부한 딥러닝 기술을 응용하여 실제로 상용화 될 수 있을 AI추천 시스템을 만드는 것을 시도해보고 싶습니다. 만약 저와 비슷한 아이디어를 가진 멤버가 있다면 협업하여 더 정교하고 발전된 시스템을 만들고 싶습니다.\n 둘째로, 자연어처리 또는 강화학습 스터디에 참여하고 싶습니다. 저는 다양한 분야에 관심이 많고 시도해보고 싶은데, 지금까지 이미지 데이터와 시계열 데이터를 다루며 딥러닝을 해봤으니 이번에는 텍스트 데이터를 다뤄보고 싶습니다. \n 이 외에 해커톤 및 각종 세미나에도 적극적으로 참여하여 이 커뮤니티에서 개발자로서 크게 성장하고 싶습니다.",
      "stacks":"Deep Learning, NLP, RL, Android Backend",
      "paths":"에브리타임 검색",
      "portfolio":""
   },
   {
      "info":{
         "userId":0,
         "name":"김승언",
         "tel":"01075567361",
         "email":"seungeon19@ewhain.net",
         "major":"컴퓨터공학",
         "studentNum":"1976070",
         "isCore":0
      },
      "firstInput":"GDSC의 가장 큰 장점은 본인이 주도하는 개인 프로젝트를 진행하면서 이를 공유하고, 자유로운 네트워킹이 가능하다는 점이라고 생각합니다. 그동안 제가 학교 수업이나 도전학기를 통해 경험한 모든 프로젝트들은 커뮤니티가 아닌 소규모의 팀에서 진행되었습니다. 다른 개발자에게 저희가 진행하고 있는 프로젝트를 발표하거나, 피드백을 받거나, 어려움이 생길 때 질문할 수 있는 기회가 없었습니다. GDSC에서 제 개발 과정을 발표하는 능력을 기르고 멤버들의 스피치에서 긍정적인 영향을 주고 받는 것이 기대됩니다.\n그 과정에서 GDSC는 또한 ‘나’를 알고, 알릴 수 있는 기회라고 생각했습니다. 다양한 관심사와 환경, 기술 스택을 가진 사람들 사이에서 저라는 개발자가 있다는 것을 알리는 과정에서 비슷한 관심사를 가진 멤버와 자연스럽게 네트워킹하며 저의 개발 실력에 깊이를 더하는 연속적인 학습으로 이어질 것이라 생각합니다. 따라서 GDSC는 제가 개발자로서 성장할 기회라고 생각하여 지원했습니다. ",
      "secondInput":"커뮤니티는 성장의 발판이라고 생각합니다.\n저는 소통이 개발자에게 중요한 역량 중 하나라고 생각합니다. 어떤 좋은 아이디어라도 이를 다른 사람에게 텍스트나 말로 잘 표현하지 못하면 그 가치를 인정받지 못하거나, 혼자만의 코드에서 그칠 것입니다. 다른 사람과의 의견 교환를 통해 더 발전할 수 있는 가능성을 스스로 차단하는 것일 수도 있습니다. \n그러나 공통된 목적으로 모인 커뮤니티에서는 자유롭고 활발한 교류를 통해 정체되지 않고 성장할 수 있을 것입니다. \n따라서 커뮤니티는 또한 서로의 멘토가 되어주는 공간이라고 생각합니다.  저마다 다른 경험과 지식을 가진 사람들이 모인 커뮤니티에서는 다른 사람을 통해 간접 경험하거나 동기를 부여 받고, 질답을 통해 배울 수 있는 기회가 풍부할 것입니다. GDSC는 제가 멘티로서 참여하는 커뮤니티이지만 저도 어떠한 부분에서는 다른 멤버의 멘토가 되어줄 수 있는 멤버가 되리라 생각합니다.",
      "thirdInput":"2학년 겨울부터 약 6개월간 교내 도전학기 프로그램에 선정되어 MZ 세대의 전통시장 유입을 위한 앱 ‘MOZORI’를 React native로 개발하는 프로젝트를 진행했습니다. 프로젝트의 목표는 공공데이터를 이용한 전통시장 식자재 가격 예측 모델을 탑재하고, 이를 이용한 레시피를 제공하는 커뮤니티 앱을 개발하는 것이었습니다. 교과 수업만으로는 충분한 지식을 가지고 있지 않아 방학 동안 개발 팀원들과 Python, Js, 딥러닝 스터디를 진행하며 학기를 준비했습니다.\n학기 중에는 시장 선정을 위해 8개의 시장을 답사했고, 식자재 품목 선정 기준 등 궁금한 점을 알아내기 위해 공공데이터 조사원에게 직접 연락을 취하기도 하는 등 적극적인 조사를 통해 ‘MOZORI’를 기획하고 본격적인 개발을 진행했습니다.디자인, 경영 등 다양한 전공의 팀원들이 모두 기획에 참여하면서 기획에 대한 다른 시각과 우선순위를 느낄 수 있었고 이를 조율하는 과정에서 소통의 중요성을 또 한번 깨닫게 되었습니다.",
      "fourthInput":"지금까지는 Js나 React native 등 거의 프론트 엔드만 개발해보았기 때문에 개인적으로 공부하던 Apache-Php-Mysql 연결 이상으로 백엔드와 프론트를 같이 개발하는 프로젝트를 진행할 계획입니다. 이번 학기부터 졸업 프로젝트가 예정되어 있기도 하고, Unity, UX/UI, 디지털 포렌식스 등 여태까지 배워보지 않은 기술을 배울 수 있는 강의를 수강할 예정이기 때문에 기존의 익숙한 언어에 새로 배운 지식을 적용한 개인 프로젝트를 진행해보고 싶습니다. 이를 위해 GDSC의 멤버들과 React, Java 스터디를 열어 공부하는 과정을 통해 지식의 깊이를 더하고 프로젝트에 적용할 것입니다. 또한, 여유가 된다면 기획이나 UI를 담당해보거나 배운 적 없는 언어로 팀 프로젝트에 참여해보고 싶습니다. 혼자서는 평소에 시도해볼 수 없었거나 생각하지 못했던 것들을 멤버들과 함께 경험할 수 있는 기간이 되었으면 합니다.",
      "stacks":"Frontend(Js,React), Backend(Java), UX/UI",
      "paths":"에브리타임",
      "portfolio":"https://github.com/seung-eon, https://encouraging-archduke-748.notion.site/74618b0ce9704b0e920852fd0a5c12e9"
   },
   {
      "info":{
         "userId":0,
         "name":"황유림",
         "tel":"01033653086",
         "email":"s2yurims2@ewhain.net",
         "major":"스크랜튼대학 뇌인지과학과(컴퓨터공학 부전공)",
         "studentNum":"1876460",
         "isCore":0
      },
      "firstInput":"사람들에게 도움을 주는 개발자가 되는 것이 저의 꿈입니다. 개발 공부를 시작한 이후로 인터넷, 강의, 책 가리지 않고 찾아가며 공부했고 작은 프로젝트들을 진행하고 있었습니다. 혼자 공부하며 어려운 점도 많았는데 모르는 것은 검색을 통해 알아보았고 노션에 기록했습니다. 그러던 중 소프트웨어공학 연구실 인턴을 하며 만난 동료들과 ‘데이터 시각화 공모전’에 나가게 되었는데 혼자서는 오래 걸리는 문제를 여럿이 함께 고민하니 빠르게 해결할 수 있는 것을 경험하하였습니다. 정보를 얻기 위해 컴퓨터공학과 홈페이지를 수시로 확인하거나 교내 ‘개발자 오픈채팅방’에 들어가기도 했지만 오프라인에서 직접 동료들을 만나 교류하고 함께 성장하는 것과는 비교가 안된다고 생각합니다. 또한 비전공자로써 프로젝트를 경험하는데 한계가 있다고 생각하던 차에 GDSC를 알게 되었습니다. GDSC의 ‘모각코’나 스터디 활동을 통해 함께 성장하고 ‘선배 초청 데이’같은 행사를 통해 개발자로서의 롤모델을 뵙고 싶습니다.",
      "secondInput":"커뮤니티는 비슷한 특성을 가진 사람들을 연결시켜주는 장이라고 생각합니다. 커뮤니티의 어원인 communis는 ‘함께’,‘공유’라는 뜻을 가지고 있습니다. 그런 의미에서 개발자 커뮤니티는 서로의 상상 속 이상을 현실에서 실현시킬 수 있는 힘을 가진 공간입니다. 상상력을 가진 개발자들이 모여 원하는 바를 공유하고 실현가능성에 대해 고민하다보면 세상을 바꾸는 발명이 탄생할 수도 있습니다. 저의 꿈은 사회에 이로운 개발자가 되는 것입니다. 원래는 뇌과학자가 되어 사람들을 돕는 기술을 연구하고 싶었지만 연구성과가 사람들에게 닿기까지 많은 시간이 걸린다는 것에 한계를 느꼈습니다. 반면 개발은 생각하는 것을 바로 구현해낼 수 있습니다. 저는 이 점에 끌려 개발공부를 시작했습니다. 그리고 개발자 커뮤니티에서 같은 뜻을 가진 사람들을 만나 프로젝트를 진행하고 싶었습니다. 또한 GDSC ewha에서 다른 여성 개발자들을 만나 서로의 힘이 되고 사회에 나가 함께 성장하는 발판을 마련하고 싶습니다.",
      "thirdInput":"개발공부를 시작하고부터 일상생활의 불편사항들을 모두 해결할 수 있다는 자신감이 생겼습니다. 그러던 중 어머니께서 냉장고 정리를 하다가 유통기한이 지난 음식들을 잔뜩 발견하시고는 속상해하시는 것을 보게 되었고, ‘유통기한 며칠 전 알려주는 프로그램이 있었으면 좋았을 텐데’하는 생각이 들었습니다. 그래서 c를 이용해 ‘냉장고 관리 프로그램’을 개발했습니다. 냉장고 속 식품을 구조체로 저장하여 ‘식품추가’, ‘식품정보 출력’, ‘유통기한 관리’, ‘식품 삭제’, ‘프로그램 종료(파일로 저장)’ 기능을 추가했습니다. 각 기능에는 사용자가 편리하게 사용할 수 있도록 하는 세부 기능도 추가하였습니다. 이 프로그램을 만들고 직접 집에 있는 채소, 유제품, 냉동식품 등을 추가해 실행해보았고, 유통기한이 얼마 남지 않은 식품들을 이용한 요리 추천 기능이 있으면 좋겠다는 생각을 했습니다. 또한 이 프로그램을 앱으로 만들어 어머니가 편하게 쓰실 수 있도록 하고 싶다는 생각을 했습니다.",
      "fourthInput":"GDSC의 활동들을 보며 전부 참여하고 싶은 마음이 들었습니다. 그 중에서도 훌륭한 동료들과 함께하는 팀 프로젝트가 가장 기대됩니다. 저의 메모장에 담긴 여러 가지 아이디어들을 꺼내보이고 깃을 통해 협업하는 경험을 하고 싶습니다.  두 번째로 공부한 것을 세미나 발표를 통해 공유하고 싶습니다. 최근 인공지능 분야에 관심이 생긴 것을 토대로 이 분야를 공부해 발표하고 동료들과 인사이트를 주고받고 싶습니다. 또한 제가 잘 모르는 프론트앤드 개발에 대해서 다른 동료들의 세미나를 들어보고 싶습니다. 세 번째로 다양한 스터디와 ‘모각코’ 활동을 통해 함께 공부하는 즐거움을 느끼고 싶습니다. 혼자 공부하며 같은 꿈을 꾸는 동료들를 찾고 싶었습니다. GDSC에서 함께 성장하는 공부 환경을 만들고 싶습니다. 마지막으로 ‘선배 초청 데이’를 통해 훌륭하신 선배님들을 뵙고 커리어를 위한 로드맵을 설정하고 싶습니다. 다양한 분야에서 일하고 계시는 선배님들을 뵙고 구체적인 커리어 계획을 세우고 싶습니다.",
      "stacks":"Backend, machine learning",
      "paths":"에브리타임",
      "portfolio":"https://www.notion.so/IT-6b31f9c796944a6db3a2850bbaa3157f"
   },
   {
      "info":{
         "userId":0,
         "name":"김도은",
         "tel":"010-9171-5848",
         "email":"doeun0802@ewhain.net",
         "major":"컴퓨터공학전공",
         "studentNum":"2076035",
         "isCore":0
      },
      "firstInput":"해당 활동을 통해 가장 얻고 싶은 것은 스스로 진행하는 프로젝트 경험과 이화 개발자 간의 네트워킹입니다. 어느덧 컴퓨터공학과 3학년을 앞두고 있지만, '나의 개발 실력이 향상되었나?'하는 질문에는 항상 답을 하기 어려웠습니다. 학기 중에 강의를 듣는 것만으로는 한계가 있었고, 혼자 프로젝트를 해보자니 막막함과 어려움이 앞섰습니다. 게다가 코로나로 인해 비대면 수업이 계속되면서 같은 과 동기들 뿐만 아니라 저와 같이 개발에 관심을 가지신 분들을 만나기가 더욱 어려웠습니다. 그래서 다가오는 22년 1학기에는 저와 비슷한 관심사를 가지신 분들과 함께 공부하며 서로 정보 공유도 하고, 혼자 개발 프로젝트를 진행해 볼 수 있는 활동을 해보고자 하였고, GDSC 커뮤니티 활동이 이 모든 것을 충족시킬 수 있는 활동이라고 생각하여 지원하게 되었습니다. 해당 활동을 통해 세미나와 스터디에 참여하면서 개발 역량을 쌓고, 배운 것들을 토대로 개인 프로젝트의 결과물까지 도출해보고 싶습니다.",
      "secondInput":"저는 공동체를 이루는 사람들간의 '소속감'이 커뮤니티의 가장 중요한 특성이라고 생각합니다. 팀원들과 함께 같은 경험을 공유하고, 비슷한 관심사를 공유하고, 서로의 의견을 공유하는 과정에서 자연스레 소속감이 생겨나는데, 이 소속감이 커뮤니티의 의미를 더욱 공고히 합니다. 혼자는 할 수 없었던 일들을 함께 했을 때 가능한 경우에 흔히들 '백지장도 맞들면 낫다'고 하지요. 저는 '백지장을 맞드'는 일이 완전한 타인보다는 소속감을 느끼는 사람들을 대상으로 훨씬 쉽게, 그리고 자주 일어난다고 생각합니다. 소속감을 느끼는 누군가의 일은 더 이상 '남'의 일이 아닌 '우리'의 일이 되기 때문입니다. 그렇기 때문에 커뮤니티 내에서는 서로 도움을 주고 받는 일이 활발하게 일어나고, 이 과정에서  자신이 몰랐던 것을 배우기도, 생각하지 못했던 것들을 생각해내기도 합니다. 이것이 제가 생각하는 커뮤니티의 의미이고, 이와 같은 맥락에서 GDSC Ewha 커뮤니티의 멤버가 되어 활동해보고 싶습니다.",
      "thirdInput":"제가 가장 열심히 참여한 프로젝트는 21년 2학기 Computer Architecture(컴퓨터구조) 수업에서 진행한 캐시 프로젝트입니다. C언어를 이용하여 n-way set associative 캐시 메커니즘을 구현하는 것이 목표였고, 저를 포함하여 총 두 명의 인원이 진행했습니다. 강의를 들을 때는 다 이해했다고 생각했지만 실제로 구현하려니 굉장히 어려웠고, 어디서부터 시작해야할지 막막하기도 했습니다. 하지만, 저는 무엇을 하든 끝까지 해결하고 싶어하고, 모르는 것은 어떻게 해서든지 알아내려고 하는 성격인지라 해당 프로젝트를 진행할 때에도 모르는 부분은 책과 유튜브, 구글링을 통해 찾아보고, 팀원과 함께 실시간으로 정보를 공유하며 프로젝트를 진행했습니다. 해당 프로젝트를 통해 코딩 및 개발 자체에 좀 더 흥미를 느끼게 되었고, 혼자는 해결하지 못했을 것을 누군가와 함께 함으로써 해낼 수 있었다는 생각에 협업 프로젝트, 팀프로젝트에 큰 관심을 갖게 되었습니다.",
      "fourthInput":"저는 현재 인공지능, 그 중에서도 자연어 처리에 큰 관심을 가지고 있어 이와 관련된 공부 및 프로젝트 진행을 해보고 싶습니다. 저와 같이 인공지능에 관심을 가지고 계신 멤버분들이 있다면, 함께 자연어 처리 입문용 책으로 유명한 'Do it! BERT와 GPT로 배우는 자연어 처리'라는 책으로 스터디를 진행해보고 싶습니다. 또한, 교내 교환학생들이나 외국인 유학생들이 사용할 수 있도록 줄임말이나 유행어, 밈(meme)들을 자연스럽게 번역하는 자연어 모델을 간단하게 구현하는 프로젝트도 진행해보고 싶습니다. 그리고 GDSC Ewha 멤버로 함께 하는 동안 참여할 수 있는 활동들을 최대한 많이, 가능하면 모두 참여하고 싶습니다. 특히 '선배 초청 데이'에는 꼭 참여해서 같은 길을 저보다 먼저 걸으신 선배님들을 뵙고 싶습니다. 마지막으로, 인스타그램을 통해 다양한 소모임 활동이 이루어지고 있다는 것을 알게 되었는데, 멤버들과 함께 개발 관련 책을 읽는 독서 스터디에도 참여해보고 싶습니다.",
      "stacks":"Backend(Java, Python), AI 분야",
      "paths":"'개발자 쟈미'님 유튜브, 에브리타임",
      "portfolio":"없습니다. 죄송합니다."
   },
   {
      "info":{
         "userId":0,
         "name":"노가영",
         "tel":"01032881028",
         "email":"gayoung.rho@gmail.com",
         "major":"휴먼기계바이오공학부",
         "studentNum":"20",
         "isCore":0
      },
      "firstInput":" 저는 뇌와 관련된 질병을 연구, 분석하는 뇌공학자가 되고 싶습니다. 고등학교때 참여한 한국 뇌 캠프에서 fMRI 등 기계를 통해 눈에 보이지 않는 뇌와 신경 질환을 연구하는 것이 매력적으로 다가와 꿈을 가지게 되었습니다. 뇌를 전문적으로 다루는 학부가 많지 않아 우선 공학적 지식을 갖춘 후 의학적 지식과 융합하고자 컴퓨터전자시스템공학과에서 2년을 보냈고, 올 해 휴먼기계바이오공학부로 편입하였습니다. \n 저의 궁극적인 목표는 뇌에 대한 의학적 지식과 현재 가지고 있는 기술인 공학적 지식을 접목하는 일 입니다. 전공을 통해 생체, 물리학적 지식을 배움과 동시에 GDSC 활동을 통해 개발을 꾸준히 하며 MRI, SPECT 등의 영상 시스템과 결과를 분석하는 프로그램을 개발하고 싶습니다. \n GDSC를 통해 실질적인 프로젝트를 진행하고 이론으로 배운 내용을 활용해 결과물을 만들고 싶습니다. 다양한 세션과 스터디, gitHub관리 등을 통해 개발적으로 더욱 성장하고 많이 배우고 싶습니다.",
      "secondInput":" \"협력, 경쟁, 인맥”\n\n 우리는 커뮤니티를 통해 비슷한 관심사를 가지거나 유사한 목표를 가진 사람들을 만납니다. 그 과정에서 서로 협력합니다. 모르는 점이 있다면 스터디를 통해 함께 배우고, 아는 것은 다른 사람에게 설명하고 나누며 상대를 돕고 동시에 스스로도 성장합니다. 이 때 서로를 통해 자극을 받고 더 많은 것을 얻기 위해 경쟁합니다. 다른 사람과의 긍정적인 경쟁을 통해 더욱 성숙한 구성원으로서 자라납니다. 나아가 좋은 상호작용을 한 커뮤니티 일원들과는 사회에 나가서도 서로에게 좋은 네트워크가 됩니다. \n 아래 항목에서 소개할 프로젝트에서, 리액트 스터디를 하며 javascript라는 언어 이상의 구현을 배웠습니다. 전공생보다 웹개발이 더욱 능숙하고 프로젝트 경험이 많은 비전공생을 보며 더욱 열심히 배우고자 계속해서 경쟁했습니다. 개발 뿐만 아니라 프로젝트 전체를 바라보며 하나의 시스템이 돌아가는 과정을 이해했고 서로 새로운 프로젝트를 추천해주며 프로젝트를 마무리했습니다.",
      "thirdInput":" 작년 초에, 학교의 정보를 공유하고 학생들이 자유롭게 소통할 수 있는 우리 대학만의 정보, 커뮤니티 사이트를 만들고자 웹페이지를 제작하는 프로젝트를 기획 및 진행하였습니다. 다양한 사고와 명확한 목표를 가진 사람을 찾고자 전공자에 국한하지 않고 전교생을 대상으로 팀원을 모집하였습니다. 8명의 사람이 모였고 약 7개월 간 ver2.0 배포까지 완료하였으며 적은 수지만 실 사용자 유입도 있었습니다. 웹프로그래밍 수업 때 이론으로 배운 내용을 활용하고, 모르는 부분이 있으면 팀원들과 스터디를 진행하며 개발적인 지식이 깊어졌습니다. 이 외에도 실력이 좋은 분들도 다른 팀원의 의견에 집중하고 계속 배워가려는 모습과, 오류가 발견되었을 때 바로 인정하며 새로운 방법을 함께 토의하려는 모습 등에서 좋은 팀원으로서 성장과 소통 방법 또한 배웠습니다.\n 기획 팀장과 프론트엔드 개발을 담당했으며 협력툴은 Notion, Figma, Slack, Google Drive, Github등을 사용하였습니다.",
      "fourthInput":"Project 1. 푸드트럭을 찾아라 - 앱개발\n 호떡, 붕어빵, 떡볶이 등 내가 좋아하는 푸드트럭이 지금 우리 동네에 있는지의 유무를 알 수 있는 어플을 개발하는 프로젝트를 진행하고 싶습니다. 푸드트럭 소유자가 어플에 등록만 하면 gps, 지도 등의 정보를 통해 푸드트럭이 동네의 어디에 있는지, 가격 정보와 함께 알려주는 앱이 있다면 편리하겠다는 생각이 들었습니다.\nProject 2. 영상 기기 제작 및 분석 - 딥러닝, 데이터 분석, 영상시스템, 보안 등\n 진로와 연관하여 MRI 같은 영상 기기 연구의 작은 프로젝트를 진행하고 싶습니다. 구체적인 프로젝트 계획은 조금 더 고민해 봐야 하겠지만 데이터 분석, 딥러닝, 확률 프로세스, 이미지 프로세싱 등을 통해 영상 시스템을 활용하고 분석하는 시스템을 제작하고 싶습니다. \n크게 두 가지 정도의 스몰프로젝트와 모임, GDE개발자와의 만남, 해커톤 등 여러 행사를 통해 비슷한 관심사를 가진 사람들과 소통하며 성장하는 개발자가 되겠습니다.",
      "stacks":"Frontend(javascript), python",
      "paths":"지인 소개",
      "portfolio":"\"  https://www.notion.so/Sarah-72e2b701f5b4404caa8ea077a4893b7f  \" 프로필 링크입니다. 접속 시 깃허브 주소 링크 걸어 뒀습니다 =)"
   },
   {
      "info":{
         "userId":0,
         "name":"공지나",
         "tel":"01027700776",
         "email":"kongjn226@gmail.com",
         "major":"사회과교육과 / 컴퓨터공학 복수전공",
         "studentNum":"1842058",
         "isCore":0
      },
      "firstInput":"컴퓨터공학과 복수전공생으로서, 개발 쪽 지인이 거의 없어 관련 정보를 얻거나 프로젝트 팀원을 구하기 힘든 점이 항상 아쉬웠습니다. 따라서 작년 초에는 교내 웹개발 스터디를 모집하여 프로젝트를 진행한 적이 있습니다. 7명의 스터디원들과의 협업을 경험해보면서 이러한 모임의 중요성을 더욱 체감했고, 보다 체계적인 모임을 찾게 되었습니다. GDSC Ewha는 다양한 개발자들을 만나며 성장할 기회를 줄 것이며 GDSC Ewha만의 네트워크를 바탕으로 한 행사 및 강연도 유익할 것으로 기대됩니다.\n\n또한 개인 프로젝트를 매주 모임에서 소개하고 핵심기술에 대해 스피치하는 시간이 매력적입니다. 프로젝트는 결과물에도 의미가 있지만, 무엇보다 기술을 익히고 실패하는 과정 속에서 얻는 것이 중요하다고 생각하기 때문입니다. GDSC Ewha를 통해 다른 멤버들과 그 경험을 공유하게 된다면 다양한 지식을 쌓으며 새로운 관심사도 발견할 수 있을 것이고, 피드백을 통해 같이 성장할 수 있을 것입니다.",
      "secondInput":"제가 생각하는 커뮤니티란 공통의 관심사를 바탕으로, 지식과 정보를 공유하는 과정 속에서 자극 받고 도움 받으며 함께 성장하는 모임입니다. 이러한 관점에서 GDSC Ewha는 개발이라는 공통의 관심사를 바탕으로, 각자의 프로젝트 및 스터디를 통해 지식과 정보를 공유하고, 네트워킹을 통해 자극 받고 도움 받으며 함께 성장하는 커뮤니티입니다. \n\n이러한 커뮤니티에서는 소통이 가장 중요하다고 생각합니다. 자연스러운 소통이 바로 지식과 정보를 어렵지 않게 공유할 수 있는 기반이 되기 때문입니다. 동일한 프로젝트를 준비하지는 않더라도, 공통의 관심사 아래에서 어려움이 닥쳤을 때 도움 받을 수 있으며 멤버들에게 피드백을 받으며 나은 발전 방향을 찾을 수 있을 것입니다. 도움만 주는 입장이 되더라도 이는 결코 일방적으로 도와주는 구조가 아닌 장기적으로 모두가 기술적으로 성장하는 방안이 될 것입니다. 특히 스터디에서는 동일한 공부 및 프로젝트를 진행하므로 다양한 관점도 기를 수 있을 것입니다.",
      "thirdInput":"재작년 초부터 컴퓨터공학과 복수전공을 했지만, 정작 실무적인 개발 경험이 없어 Git 사용조차 능숙치 않았습니다. 이에 작년 1학기에 교내 웹개발 스터디를 모집하여 최종적으로 웹개발 프로젝트를 진행해보고자 하였습니다. 스터디원은 backend와 frontend 각 4명씩 모집하였고, 저는 backend 파트로 활동하였습니다. 생활코딩의 html, css, javascript, nodejs 강의를 분량을 나누어, 매주 각자 실습 후 공유하는 방식으로 진행하였습니다. \n\n이후에는 유튜브와 인프런을 바탕으로 클론코딩을 하였고, 종강 이후에 본격적으로 채용공고 웹페이지를 구성하는 프로젝트를 기획 및 진행하였습니다. 멘토 없이 오직 스터디원 서로에게만 의지하며 진행하기엔 많은 어려움이 있었지만, 단기간에 기술적으로 성장했음을 느꼈습니다. 무엇보다 backend와 frontend가 소통하며 진행되는 전반적인 개발 프로세스를 경험해볼 수 있었다는 점에서 큰 의미가 있었다고 생각합니다.",
      "fourthInput":"개인 프로젝트로는, 오픈 API를 활용하여 실제적인 정보가 있는 웹페이지를 만들고 싶습니다. 예를 들어 공공데이터포털의 ‘한국소비자원 생필품 및 서비스 가격 정보’ API를 통해, 이용자 주변 마트의 생필품 가격을 비교하여 최적의 업체를 추천하는 사이트를 만들어보고 싶습니다. 이를 개인프로젝트로 진행하게 된다면 백엔드와 프론트엔드를 모두 경험해 볼 수 있다는 장점이 있지만, 조금 더 완성도있는 결과를 내기 위해 GDSC Ewha에서 프론트엔드 팀원 분을 구해 파트를 나누어 진행하며 협업하며 함께 성장하고 싶습니다. \n\n스터디로는, Spring를 이용한 토이프로젝트 스터디를 진행하고 싶습니다. 지난 웹개발 스터디에서는 웹개발 및 백엔드가 처음이어서 온라인 강의가 풍부한 Nodejs를 선택했었기 때문에, 이번에는 새롭게 Spring을 배워보고 싶기 때문입니다. 또한 데이터베이스(MySQL, MongoDB)에 관한 스터디를 통해 데이터를 다루는 연습도 해보고 싶습니다. ",
      "stacks":"Backend(Java, Nodejs, Spring), Database(MySQL, MongoDB)",
      "paths":"지인 소개",
      "portfolio":"https://github.com/JinaKong, https://kongjn.tistory.com"
   },
   {
      "info":{
         "userId":0,
         "name":"한수아",
         "tel":"01051382056",
         "email":"s2sooas2@ewhain.net",
         "major":"컴퓨터공학전공",
         "studentNum":"1976415",
         "isCore":0
      },
      "firstInput":"첫 번째는 일단 개발 실력 향상입니다. GDSC Ewha에서는 6개월동안 개인 프로젝트를 진행한다고 알고 있습니다. 지금까지 6개월이라는 긴 시간동안 진행하는 프로젝트를 경험해 본 적이 없기 때문에 장기 프로젝트를 하고 싶어 지원하였습니다. 특히, 기획부터 개발까지 스스로 하는, '개인' 프로젝트를 하는 곳은 GDSC밖에 없었기 때문에 GDSC에서 제 성장을 경험하고 싶었습니다.\n두 번째는 네트워킹입니다. 저는 호크마교양대학 학생으로 입학했기 때문에 컴퓨터공학과 동기들을 잘 알 지 못 합니다. 그리고 코로나19로 인해 과 동기 및 선후배를 사귈 기회가 거의 없었습니다. 그런 상황에서 GDSC에 들어간다면 다양한 개발자분들과 만날 수 있다고 생각했습니다.\n세 번째는 원동력입니다. 앞서 말했듯이 주변에 컴공생이나 개발자가 없다보니 안이해질 때가 종종 있었습니다. 스터디 등에 참여하고 열심히 노력하는 다른 분들의 모습을 보면, 그 모습에 자극을 받아 꾸준히 노력할 수 있을 거 같습니다. ",
      "secondInput":"제가 생각하는 커뮤니티란 서로 도움을 주고 받아 함께 발전하고자 하는 사람들이 모여있는 곳입니다. 실리콘밸리 온라인 인턴십에 참여한 적이 있습니다. 저희는 약 한 달 동안 매일 아침부터 저녁까지 온라인으로 만나면서 개발을 진행하였습니다. 그 시간 동안 한 번쯤은 갈등이나 의견의 대립이 있을 법도 했는데 그런 일은 일어나지 않았습니다. 오히려 저희 팀은 유독 사이가 좋은 팀이라고 알려졌습니다. 물론, 개발을 진행하면서 갈등이 없다는 게 꼭 좋은 일을 의미하는 게 아니라는 사실을 알고 있습니다. 그러나 저희 팀은 분위기가 좋은 것에 그치지 않고, 서로가 서로의 멘토가 되어 함께 발전해 나갔습니다. 모르는 부분이 있으면 서로에게 물어보고, 같이 고민해보는 시간을 가졌습니다. 그런 시간을 통해 팀원들은 각자 맡은 파트만 알고 있는 게 아닌, 프로젝트의 전반적인 이해 또한 할 수 있었습니다. 이 때의 경험과 팀워크가 좋은 기억으로 남았기 때문에 제가 바라는 커뮤니티의 이상이 되었습니다.",
      "thirdInput":"앞서 말했던 실리콘밸리 온라인 인턴십에서 진행했던 프로젝트에 대해 소개하겠습니다. 이 때 진행했던 프로젝트는 \"i-home\"입니다. 5-7세 아동을 대상으로 영어 그림책을 추천해주는 AI 기반 프로젝트로, 사용자가 평소 좋아하는 장난감을 인식하면 이를 기반으로 좋아할만한 영어 그림책을 추천해주는 것입니다. 프로젝트의 Main PoC는 '객체 인식'과 '유사도 검색'이었습니다. 저는 이 중에서 AI(Data Engineering) 파트를 맡았습니다. 정확히는 '객체 인식' 기능을 담당하였습니다. '객체 인식'에 대해 더 설명을 해보자면, 처음에는 tensorflow의 object detection API를 활용해 장난감 인식을 수행하려 했습니다. 그러나 인식률이 좋지 않고 기존 모델은 장난감을 그저 'toy'로 인식하는 문제가 있었습니다. 그래서 새로운 모델을 학습시켜 저희 프로젝트에 맞는, 장난감을 대상으로 한 새로운 model을 만들어 프로젝트를 완성시켰습니다.",
      "fourthInput":"먼저 6개월 간 진행하는 개인 프로젝트에서는, 기쁘거나 속상한 일이 있는데 누구에게 말하기 힘들 때, 익명으로 본인의 감정에 대한 글을 적으면 다른 사람들의 반응을 얻을 수 있는 프로젝트를 진행해보고 싶습니다. 혼자 개발할 수 있을까 걱정되기는 하지만 6개월이라는 긴 시간이 있기 때문에 도전하고 싶습니다.\n그리고 BackEnd와 Machine Learning에 관한 스터디를 주최하거나 이에 참여하고 싶습니다. 지금은 BackEnd에 관심이 제일 많으나, AI 개발을 한 적이 있기 때문에 진로를 확실하게 정하지 못 하였습니다. 그래서 가장 관심 있는 두 분야 스터디에 참여해 다른 분들과 지식을 공유하고 고민을 공유함으로써 보다 깊이 있는 내용을 배우고, 제 진로를 명확히 하고 싶습니다.\n그리고 여러 행사에 참여하고 싶습니다. 저는 협업 경험이 많지 않습니다. 그래서 GDSC Korea 해커톤 등 다양한 행사에 다른 Member 분들과 참여해 협업 경험을 쌓고 싶습니다.",
      "stacks":"BackEnd, Machine Learning(AI)",
      "paths":"에브리타임 홍보",
      "portfolio":"https://github.com/h-sooah"
   },
   {
      "info":{
         "userId":0,
         "name":"김민지",
         "tel":"01054291289",
         "email":"minji1289@ewhain.net",
         "major":"컴퓨터공학과",
         "studentNum":"2022008",
         "isCore":0
      },
      "firstInput":" 저는 개발자 커뮤니티의 중요성을 피부로 느낀 경험이 있습니다. 제가 실제로 개발 프로젝트를 진행하다보면, 예상을 전혀 하지 못한 다양하고 많은 어려움을 마주하곤 합니다. 전혀 예상하지 못한 에러가 뜨면, 처음엔 좌절했습니다. 그러나 구글링을 통해 Stack Overflow나 Github 같은 개발자 커뮤니티 사이트에서 해결책을 찾아 프로젝트를 이어나간 경우가 굉장히 많습니다. 이러한 개발자 커뮤니티 사이트에서 얻은 정보로 인해 프로젝트를 성공적이고 효율적으로 마칠 수 있었습니다. 어느 분야나 커뮤니티는 중요하겠지만, 개발 분야야말로 커뮤니티의 존재가 정말 중요하다고 생각합니다. 저는 GDSC Ewha 커뮤니티에 참여하여 개발에 관심이 있는 제 또래 또는 선배 벗들과 함께 스터디 및 교류를 통해 성장하고 싶습니다. 또한, GDSC 활동을 통해 다양한 개발자들과 교류하고, GDSC의 다양한 행사에 자발적으로 참여하여 보다 더 실력있는 개발자로 성장하고 싶습니다.",
      "secondInput":" 저는 커뮤니티란 ‘구성원의 성장과 유대감에 기여할 수 있는 좋은 기회’라고 생각합니다. 우선, 커뮤니티는 구성원들의 성장에 크게 기여할 수 있습니다. 다양한 구성원들이 모여있는 커뮤니티의 집단 지성이야말로 커뮤니티의 강점이라 생각합니다. 실제 개발에 있어서 커뮤니티의 중요성을 제가 피부로 느낀 것처럼, 집단 지성은 문제 해결에 굉장히 효율적으로 기여합니다. 커뮤니티의 이러한 네트워킹은 프로젝트의 완성도를 높이고, 시간을 단축시키며, 좋은 지식을 얻을 수 있고, 프로젝트에 착수하기 전 조언을 통해 스택/툴을 사전에 바꿔 사전에 문제를 예방하는 등 구성원들의 성장을 도울 수 있습니다. 또한, 커뮤니티는 구성원들의 유대감에 기여할 수 있습니다. GDSC의 경우, 자신의 프로젝트 경험과 과정을 공유하고 모각코 등의 교류 활동을 함으로써 구성원끼리의 유대감을 형성시킬 수 있습니다. 이러한 커뮤니티를 통한 유대감은 구성원 개인이 개발자로 성장하는 과정에서의 고독감 해소를 도울 것입니다.",
      "thirdInput":" 저는 중앙동아리 ECC의 부원으로서 참여했던 스터디의 연장선이었던, 라즈베리파이 프로젝트가 가장 기억에 남습니다. 한 학기동안 책을 통해 부원들과 라즈베리파이를 공부하고, 라즈베리파이를 이용한 딥러닝 프로젝트를 약 8개월 동안 진행하였습니다. 총 4인이서 하드웨어팀과 소프트웨어팀으로 나누어 협업했고, 저는 소프트웨어팀에서 OpenCV 빌드, 가상환경에 Tensorflow Lite 설치, 구글의 객체 검출(Object Detection) 라이브러리를 이용하여 Python 코드 작성, 쉘 스크립트 작성 등을 하였습니다. 이 프로젝트가 가장 기억에 남는 이유는 학교에서 배우지 않았던 새로운 분야에 대한 공부와 도전이었기 때문입니다. 아침부터 같이 동아리방에 모여 늦은 저녁까지 그야말로 맨 땅에 헤딩을 한 것이었는데, 오류가 발생할때 스택 오버플로우와 같은 개발 커뮤니티의 도움을 받아 팀원들과 함께 협업하고 격려했기에 프로젝트를 성공적으로 마무리할 수 있었던 것 같습니다.",
      "fourthInput":" 제가 GDSC Ewha의 멤버로 함께 한다면, 개발자로서 성장을 위한 스터디 활동에 활발히 참여하고, 함께 코딩을 하는 모각코 활동에도 활발히 참여하고 싶습니다. 특히, 이 과정에서 서로 코드 리뷰를 하게 된다면 상호 성장에 굉장히 도움이 될 것 같습니다. 6개월동안 진행할 개인 프로젝트의 경우, 지금까지 프론트엔드를 위주로 프로젝트 경험을 쌓아왔기에, 백엔드에 집중한 프로젝트를 진행하고 싶습니다. MERN(특히 Socket.IO)와 SpringBoot에 관심이 많아 관련 개인별 프로젝트를 진행하며, 백엔드 스터디가 있다면 스터디를 병행하며 프로젝트를 진행하고 공유하고 싶습니다. 이처럼 GDSC Ewha의 행사 뿐만 아니라 GDSC 커뮤니티 자체의 다양한 행사에도 활발하게 참여하고 싶습니다. 저는 오픈소스에도 관심이 많아 활발한 깃허브 및 커뮤니티 활동을 하고 싶습니다. 저는 네트워킹과 성장을 도모할 수 있는 GDSC Ewha의 멤버로서 꼭 함께 하고 싶습니다. ",
      "stacks":"관심 있는 개발 분야: Back-end(Java+Spring, MERN, MVC), Cloud, Serverless, Cross-Platform App(Flutter), ComputerVision, Deep-learning, BlockChain & 기술 스택: C, Python, Java, Html, CSS, Javascript, React",
      "paths":"지인 소개, 에브리타임",
      "portfolio":"Github: https://github.com/minji1289, Notion: https://www.notion.so/Bio-for-GDSC-ab4f436448b24b7d944f24a2ec4ccf10"
   },
   {
      "info":{
         "userId":0,
         "name":"최예원",
         "tel":"01072376542",
         "email":"ywchoi0625@gmail.com",
         "major":"사이버보안전공",
         "studentNum":"2071084",
         "isCore":0
      },
      "firstInput":"GDSC 커뮤니티 활동을 통해 평소 어렵게 느껴진 일들에 쉽게 다가가고 싶습니다. 계획한 일을 수행하는 것은 결코 쉽지 않고, 공부를 하며 훑은 지식을 온전히 자신의 것으로 만드는 일도 많은 노력이 필요합니다. GDSC에서는 저만의 계획을 세우고 이를 수행한 후 공유함으로써 목표한 바를 성공적으로 얻을 수 있을 것이라고 생각합니다. 이 과정에서 저도 다른 멋진 개발자 분들의 프로젝트를 공유받으면서 결론적으로 끈끈한 네트워크와 활발한 개발자 커뮤니티/생태계를 만드는 데에 참여하고 싶습니다. \n또한 다양한 스터디를 자율적으로 참여할 수 있다는 점에서 놓치고 싶지 않은 기회였습니다. GDSC 활동을 통해 제가 원하는 스터디에 들어가고 새로 만들기도 하며 평소 알아보고 싶었던 것들을 후회없이 공부할 수 있을 것 같다는 점에서 크게 기대가 됩니다. ",
      "secondInput":"커뮤니티란 소속된 사람들이 같은 관심사로부터 출발해 공유하는 환경과 문화라고 생각합니다. \n커뮤니티 안에서 사람들은 긍정적인 환경과 발전을 위해 많은 것들을 공유하는데 이 과정에서 서로가 서로에게 보완점이 되어주며 부족한 점을 채워나가게 됩니다. \nGDSC에서는 \"개발자\"라는 공통의 관심사 및 목표가 있을 것이고 이를 지향하는 사람들이 만나 다양한 지식을 공유하며 함께 성장할 것이라고 생각합니다. ",
      "thirdInput":"신촌연합 IT 창업 동아리에서 \"풀링\"이라는 프로젝트를 진행했습니다. 풀링은 유용한 링크들을 카테고리화하여 편리하게 관리할 수 있도록 도와주고, 비슷한 관심사의 다른 유저들이 저장한 링크들을 탐색할 수 있는 웹서비스입니다. 링크 저장 시 해당 사이트의 미리보기 이미지와 파비콘을 크롤링해온 뒤 피드 형태로 보여주기 때문에 한눈에 링크를 알아보기 쉽다는 것이 특징입니다. 기획, 디자인, 프론트와 협업했으며 django 프레임워크를 사용해 서버 개발을 맡았습니다. \n작년 4월부터 시작해 MVP 개발 및 출시는 마쳤고 현재 계속해서 사용자 유치를 하고 있습니다. 개발용 서버를 따로 두어 확장 프로그램과 오픈 아카이빙(링크 공유) 기능 또한 추가 개발 진행에 있는데, 이때 코드 리팩토링 과정을 같이 하고 있습니다. 특히 공유 기능에서 웹 소켓 관련된 내용이 필요하기 때문에 최근에도 비동기 연결에 대해 공부하고 있습니다. ",
      "fourthInput":"우선 첫 3개월 간 스프링 프레임워크를 공부하며 백엔드 아키텍처를 정리할 예정이며 이때 개인 프로젝트를 기획해 실제 개발 응용을 경험할 것입니다. 이후 코틀린 스터디에 참여해 코틀린 + 스프링으로 코드 리팩토링을 진행할 계획입니다. \n그리고 프로젝트 진행 동시에 GDSC 커뮤니티에서 진행하는 해커톤이나 행사 등에 활발히 참여해 팀원 분들께 긍정적인 자극을 받아 프로그래밍에 대한 흥미와 열정을 끌어올리고 싶습니다. ",
      "stacks":"Backend(Java), DevOps",
      "paths":"지인 소개",
      "portfolio":"https://github.com/julia-ing, https://velog.io/@julia"
   },
   {
      "info":{
         "userId":0,
         "name":"정수진",
         "tel":"010-2316-4934",
         "email":"offsujin@gmail.com",
         "major":"컴퓨터공학과",
         "studentNum":"1976355",
         "isCore":0
      },
      "firstInput":"저는 지난 학기 GDSC에 지원했지만 슬프게도 함께 하지 못하게 되었던 경험이 있습니다. 모집에 떨어진 후 저는 제 자신을 돌아보며 좀 더 적극적으로 사람들과 교류해보자고 마음을 먹게 되었습니다. 그 후 저는 사람을 모아 스터디를 진행하기도 하고, 다른 사람들과 토이 프로젝트를 만들기도 했습니다. 많은 사람들을 만나며 다양한 생각을 접하고, 함께 소통하며 발전해나가는 소중한 경험을 얻었습니다. 배움은 많았지만 모임에 대한 소속감이 부족했고, 좀 더 긴밀한 네트워킹을 하기에는 힘들었습니다. 저는 GDSC에서 많은 사람들과 소통하며 지식을 공유하고 함께 발전해나가고 싶습니다. 또 각자의 분야에서 열심히 활동하는 사람들을 알아가며 서로의 버팀목이 되어주는 끈끈한 네트워킹을 얻고 싶습니다. GDSC에서 사람을 만나고 싶습니다.",
      "secondInput":" 저는 지난 겨울에 JPA에 관심이 있는 사람들을 모아 커뮤니티를 만들었습니다. 시작은 제가 읽고자 하는 JPA 관련 도서가 너무 분량이 많아 혼자 완독할 수 있을까라는 우려에서부터 였습니다. 처음에는 책을 읽고 공부한 내용을 공유하는 단순한 JPA 도서 스터디에 지나지 않았습니다. 하지만 저는 스터디 발표 시간마다 책을 읽으면서 궁금했던 점, 더 나아가 생각해볼 점들을 공유했습니다. 그리고 이런 이슈들에 대한 각자의 생각과 경험들을 나누고, 관련된 정보들을 찾아가며 책에 쓰인 내용 이상을 알아가기 시작했습니다. 시간이 지나자 다른 분들도 책을 읽으며 이야기를 나눌 수 있는 이슈를 공유하기 시작했고, 저희 스터디는 토론의 장이 되었습니다. 저는 이 스터디를 커뮤니티라고 말하고 싶습니다. 왜냐하면 저는 이 모임 속에서 지식을 공유하고, 토론하며 사고력을 증진시키며, 다양한 사람과 네트워킹하고있기 때문입니다.",
      "thirdInput":"지난 학기에 저는 졸업 프로젝트로 사투리 발화 오디오북 서비스, [코소롱]을 제작했습니다. 코소롱은 유저가 표준어로 된 텍스트를 입력하면 이를 제주도 사투리로 번역하고, 제주도 사투리를 살려 발화하는 서비스입니다. 딥러닝 모델로 작동하지만 팀원 모두 딥러닝을 접해본 경험이 없기 때문에 많은 난항을 겪었습니다. 딥러닝을 공부하고 개발에 착수하자는 의견이 많았기 때문에 많은 시간을 스터디 진행에 소모했지만, 공부를 하면할수록 딥러닝이라는 분야는 어렵게 느껴지고 손을 댈 엄두가 나지 않았습니다. 그래서 저는 잘 모르더라도 일단 부딪혀보는 것이 팀 상황에 더 좋을 것이라고 판단하고 팀원들을 설득했습니다. 팀원들과 간단한 모델을 만드는 것부터 직접 따라해보며 실제로 딥러닝이 어떻게 동작하는지를 몸으로 느껴보고, 할 수 있다는 자신감을 얻을 수 있었습니다. 이 프로젝트를 통해 새로운 분야에 도전할 때 때로는 이론보다 직접 부딪혀보는 것이 습득하는 데에 도움이 될 수 있다는 것을 깨달았습니다.",
      "fourthInput":"먼저 다양한 스터디에 참여하고, 스터디를 만들어가고 싶습니다. 제가 만들고 싶은 스터디는 알고리즘 스터디입니다. 이 알고리즘 스터디는 현존하는 알고리즘 스터디처럼 단순히 문제를 풀고 어떻게 풀었는지를 공유하는 스터디가 아니라, 알고리즘을 푸는 방식을 바꿔나가는 스터디입니다. 주석을 이용하여 문제를 푸는 과정을 정리하며 알고리즘에 대한 자신의 생각을 정리하고 논리적으로 고민하는 문제 풀이 방식을 몸에 익혀나가는 것입니다.\n 그리고 개인 프로젝트로는 분리수거를 도와주는 서비스를 만들고 싶습니다. 상품의 포장이 다양해지면서 분리수거가 점점 복잡해지는 것을 느껴서 생각하게 되었습니다. 만약 함께 프로젝트를 진행할 AI 개발자를 구하게 된다면 카메라로 상품을 찍으면, 이 상품을 분리수거하는 방법을 알려주는 서비스를 만들고 싶습니다. AI 개발자를 구하지 못하게 된다면 상품마다 카테고리를 나눠 궁금한 분리수거 방법을 찾기 쉽도록 만들 것입니다.\n",
      "stacks":"Backend(java)",
      "paths":"학교 커뮤니티",
      "portfolio":"https://github.com/offsuijn, https://velog.io/@offsujin"
   },
   {
      "info":{
         "userId":0,
         "name":"김명지",
         "tel":"01095033324",
         "email":"kimmyeongji3@gmail.com",
         "major":"컴퓨터공학과  ",
         "studentNum":"2071007",
         "isCore":0
      },
      "firstInput":"컴퓨터공학과 학생으로서 2년 동안 학교를 성실히 다녔지만 코로나로 인해 동기들을 자주 보지 못했고 자연스레 동기들과 개발에 관해, 전공에 관해 이야기를 할 수 있는 시간이 많이 없었습니다. 관심 분야가 비슷한 사람들끼리 이야기를 통해 정보를 공유하며 함께 공부하는 활동이 굉장히 유익하고 중요하다고 생각하는 사람으로서 이런 점이 대학 생활에서 가장 아쉬웠습니다. 하지만 이번에 지인을 통해 GDSC를 알게 되었고 GDSC에서는 제가 코로나가 터지기 전 대학 생활에서 꿈꿔왔던 활동들을 마음껏 할 수 있을 것이라고 생각해 지원했습니다. 저와 비슷한 고민을 하며 진로를 고민하는 사람들을 만나서 서로 도움이 되는 이야기를 하며 모두 발전해 나가는 모습을 보여주며 함께 스터디하며 서로가 서로에게 동기부여 되어 주는 좋은 동료, 친구가 되고 싶습니다. 또한 제가 함께 공부하면 더 열심히 하는 성격으로 GDSC의 부원이 된다면 활동 기간만큼은 개발에 충분히 집중할 수 있을 것 같습니다.",
      "secondInput":"커뮤니티는 코로나로 인해 사람들을 자주 만날 수 없는 요즘 같은 시대에 꼭 필요한 만남의 장이라고 생각합니다. 서로 정보를 공유할 때 한 공간에 같이 있지 않아도, 같은 시간에 깨어 있지 않아도 충분히 서로가 원하는 정보와 지식을 알아갈 수 있는 이유가 바로 그러한 사람들을 한 곳으로 모아주는 커뮤니티가 존재하기 때문이라고 생각합니다. 인맥으로만 정보를 얻을 수 있었던 시대와는 달리 요새는 커뮤니티에서도 활발한 소통의 장, 지식, 정보 교환의 장이 열리기 때문에 어느 정도의 정보 격차를 해소해주는 역할을 커뮤니티가 하고 있다고 생각합니다. 사람들이 전기가 없던 시절에 촛불로 불을 밝히며 살았던 것처럼 커뮤니티가 없어도 살 수 있지만 전기가 발견된 이후로는 전기만 사용하는 것처럼 커뮤니티를 사용하지 않을 이유가 없다고 생각합니다. 커뮤니티는 자신의 경계선을 벗어나 더 많은 사람과 더 효과적이고 효율적으로 소통하며 성장해 나갈 기회를 제공한다고 생각합니다.",
      "thirdInput":"동기와 pytorch를 이용해 손동작으로 테트리스 게임을 조작하며 실시간으로 상대방의 점수가 담긴 통신을 주고받으며 더 스릴 있게 게임을 할 수 있도록 만드는 프로젝트를 진행했습니다. 학회에 제출할 논문을 쓰기 위해 시작했던 첫 프로젝트로 구글링을 통해 배워가야 할 점이 너무 많아서 중간에 포기하고 싶었던 때도 많았지만 개인 프로젝트가 아닌 만큼 프로젝트를 진행할 때마다 생기는 트러블슈팅에만 3개월을 썼을 정도로 장기적으로 꾸준히, 포기하지 않고 진행했었습니다. 첫 대형 프로젝트라 도커 사용법, mqtt 서버 사용법, pytorch 사용법 등 모르는 분야가 너무 많았지만 구글링으로 온종일 정보를 뒤지면서 어떻게 해서든 꾸역꾸역 오류들을 하나씩 해결해나갔습니다. 이 프로젝트 경험을 통해 아무리 어려운 프로젝트라도 구글링과 유튜브, 책을 적재적소에 잘 활용하면서 공부해나가면 반드시 얻어가는 점이 많다는 것과 괴로울 만큼 문제 해결에 사용한 시간에 배우는 점이 비례한다는 것을 배웠습니다.",
      "fourthInput":"블록체인과 웹 개발에 관심이 있는 사람들이 있다면 함께 스터디하며 도움이 필요한 사람들을 직접적으로 도와줄 수 있는 블록체인 기반 웹 프로젝트를 진행해보고 싶습니다. 소액기부자의 입장에서는 자신이 기부한 돈이 정말 필요한 사람들에게 진짜로 전달이 되었는지 확인이 어려워 기부를 꺼리는 경향이 있는데 블록체인을 이용해 기부자와 수혜자의 정보가 투명하게 기록된다면 더 많은 사람이 기부를 할 수 있도록 격려할 수 있다고 생각해 예전부터 꼭 진행해보고 싶었습니다. 만약 블록체인에 관심 있는 사람들이 없어서 혼자 진행해야 한다고 하더라도 꼭 진행해보고 싶습니다. 두 번째로는 소상공인만을 위한 기프티콘을 제작하는 프로젝트를 진행해보고 싶습니다. 기프티콘을 제공하지 않기 때문에 프랜차이즈 마켓들과는 다르게 기프티콘 시장에서 소상공인들은 경쟁에 많이 뒤처질 수밖에 없습니다. 이를 조금이라도 완화하는 데에 도움을 주는 웹이나 앱 서비스를 구현해보고 이때 필요한 지식을 서로 나누고 싶습니다.",
      "stacks":"Backend(Spring), Frontend(React), Blockchain, Cuda",
      "paths":"지인 소개",
      "portfolio":"https://github.com/Gom3rye, https://gom3rye.tistory.com"
   },
   {
      "info":{
         "userId":0,
         "name":"한현경",
         "tel":"01031361843",
         "email":"hhk@ewhain.net",
         "major":"컴퓨터공학전공",
         "studentNum":"2176410",
         "isCore":0
      },
      "firstInput":"이번 방학에 처음 접한 프론트엔드 개발은 웹페이지를 작성하는과정에서 시시각각 변하는 페이지의 모습을 확인할 수 있다는 점, 그리고 저의 노력이 실용적인 결과물로 나타난다는 점에서 매력적으로 느껴졌습니다. 그래서 개인적으로 웹 페이지를 제작하는 프로젝트를 진행했습니다. 그런데 혼자 공부하고 웹 페이지를 만들면서 개발 과정이나 방법에 대한 이야기를 나눌 사람이 없다는 것이 아쉬웠습니다. 하지만 GDSC에서는 다양한 분야의 개발자들이 함께 모여 각자의 프로젝트에 대해 이야기하는 시간이 있다고 들어 지원하게 되었습니다. 이 시간을 통해 다른 개발자분들은 어떤 생각을 가지고 계신지 알고 싶습니다. 그래서 GDSC커뮤니티 활동을 통해 얻고 싶은 것을 한 단어로 표현하자면 개발이라는 공통 관심사를 가지는 '동료'라고 답할 것 같습니다. 또한 멋진 동료들과 함께 관심 분야 스터디를 진행하고, 해커톤에 참여하고, 기회가 된다면 협업 프로젝트를 진행할 기회를 GDSC를 통해 꼭 얻고 싶습니다. ",
      "secondInput":"같은 관심사를 가진 사람들로 이루어진 커뮤니티는 존재만으로도 구성원들에게 긍정적인 영향을 줍니다. 서로를 통해 몰랐던 정보를 얻으며, 혼자서는 하기 힘들었던 프로젝트를 협업을 통해 해낼 수 있기 때문입니다.  뿐만 아니라 커뮤니티의 가장 강력한 힘은 '동료'를 얻는 것에 있다고 생각합니다. 커뮤니티 내의 구성원들은 각자의 커리어를 준비하는 과정에서 겪는 어려움을 누구보다 잘 이해할 수 있고, 잠시 지쳤을 때 주위의 동료들을 보고 다시 동기부여를 얻을 수 있습니다. 제가 알게 된 GDSC는 열정적인 개발자들이 네트워킹을 통해 각자의 성장을 도모하는 커뮤니티입니다. 인스타그램 계정을 팔로우하면서 GDSC의 활동을 봐왔는데, 정말 대단한 분들이 많이 계셔서 구성원이 아닌 저도 더 열심히 공부해야겠다는 동기부여를 얻었습니다. 이렇게 개인의 존재가 힘이 되어 구성원들 전체에게 긍정적인 영향을 주는 GDSC에 제가 합류한다면 개발자로서 크게 성장할 수 있을 것 같습니다. ",
      "thirdInput":"최근 'animalMBTI'라는 저의 첫 웹 사이트를 만들었습니다. animalMBTI는 직접 만든 mbti 검사를 통해 사용자에게 어울리는 동물을 매칭해주는 사이트입니다. mbti의 I/E, N/S, T/F, J/P별로 각각 세문제씩 만들어 더 종류별로 많이 선택한 성향을 결과로 나타내는 원리를 사용했습니다. 또한 버튼과 상단 진행바는 jQuery라이브러리를 사용해 만들었습니다. 웹 제작이 처음이다 보니 작업 과정 중 생각지 못한 어려움이 있었습니다. 저는 github pages를 통해 페이지를 만들었는데, 깃허브에 코드를 올리면 이미지 저장 경로도 함께 바꿔줘야 한다는 것을 몰라서 헤맸던 경험, 모바일 웹에서만 이미지가 찌그러지는 문제를 해결하려고 시간을 쏟았던 경험이 생각납니다. 하지만 이 문제들을 모두 해결하고 웹을 완성했을 때의 성취감은 저로 하여금 앞으로 계속 프론트엔드 개발을 하고 싶게 만들었습니다. 앞으로의 저의 여정을 GDSC와 함께 하고 싶습니다.",
      "fourthInput":"GDSC 멤버로서 제가 할 활동은 크게 세가지로 나눌 수 있습니다. 먼저, 제가 6개월동안 진행할 개인 프로젝트입니다. 저는 지금 외국인들에게 서울의 관광지를 안내하는 웹 페이지를 구상하고 있습니다. 서울 지도를 메인 화면에 배치하고 지역별로 클릭을 하면 인기있는 관광지/맛집/숙박시설을 안내해주는 웹을 만들고 싶습니다. 제가 가진 html/css/javascript 역량을 가지고 웹을 제작할 계획입니다. 기회가 된다면 개발자분들과 협업하고자하는 마음도 있습니다. 두번째로 GDSC내에서 진행되는 스터디 참여입니다. 프론트엔드 관련 스터디에 열심히 참여하고 개발자로서 성장하도록 끊임없이 노력할 것입니다. 또한 매주 열리는 세션을 통해 새로 관심있는 분야를 찾는다면 이에 대해 탐구할 것입니다. 세번째로 GDSC Winter Hack과 같은 해커톤에 참여해 실력을 향상시키고 싶습니다. 이 외에도 열리는 각종 세미나나 DevFest와 같은 활동들에 적극적으로 참여할 계획입니다. ",
      "stacks":"Frontend(html, css, javascript)",
      "paths":"에브리타임",
      "portfolio":"https://github.com/HyunKyungHan"
   }
]

 export default TempDB;